Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x126 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x3c767): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x54cc2): ../Core/Src/freertos_hooks.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x7fb10): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 7 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 1 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0x12ac1): unsigned int
 <1><38>: Abbrev Number: 1 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x69985): long long int

 <1><191>: Abbrev Number: 5 (DW_TAG_base_type)
    <192>   DW_AT_byte_size   : 2
    <193>   DW_AT_encoding    : 7	(unsigned)
    <194>   DW_AT_name        : (indirect string, offset: 0xde34b): short unsigned int
 <1><198>: Abbrev Number: 5 (DW_TAG_base_type)
    <199>   DW_AT_byte_size   : 4
    <19a>   DW_AT_encoding    : 5	(signed)
    <19b>   DW_AT_name        : (indirect string, offset: 0x135b8): long int
 <1><19f>: Abbrev Number: 3 (DW_TAG_typedef)
    <1a0>   DW_AT_name        : (indirect string, offset: 0xe8b56): __uint32_t
    <1a4>   DW_AT_decl_file   : 3
    <1a5>   DW_AT_decl_line   : 79
    <1a6>   DW_AT_decl_column : 25
    <1a7>   DW_AT_type        : <0x1ab>
 <1><1ab>: Abbrev Number: 5 (DW_TAG_base_type)
    <1ac>   DW_AT_byte_size   : 4
    <1ad>   DW_AT_encoding    : 7	(unsigned)
    <1ae>   DW_AT_name        : (indirect string, offset: 0x58285): long unsigned int
 <1><1b2>: Abbrev Number: 3 (DW_TAG_typedef)
    <1b3>   DW_AT_name        : (indirect string, offset: 0xe8a8c): __uint64_t
    <1b7>   DW_AT_decl_file   : 3
    <1b8>   DW_AT_decl_line   : 105
    <1b9>   DW_AT_decl_column : 25
    <1ba>   DW_AT_type        : <0x1be>
 <1><1be>: Abbrev Number: 5 (DW_TAG_base_type)
    <1bf>   DW_AT_byte_size   : 8
    <1c0>   DW_AT_encoding    : 7	(unsigned)
    <1c1>   DW_AT_name        : (indirect string, offset: 0x3004c): long long unsigned int
 <1><1c5>: Abbrev Number: 3 (DW_TAG_typedef)
    <1c6>   DW_AT_name        : (indirect string, offset: 0x4354f): uint8_t
    <1ca>   DW_AT_decl_file   : 4
    <1cb>   DW_AT_decl_line   : 24
    <1cc>   DW_AT_decl_column : 19
    <1cd>   DW_AT_type        : <0x177>
 <1><1d1>: Abbrev Number: 7 (DW_TAG_const_type)
    <1d2>   DW_AT_type        : <0x1c5>
 <1><1d6>: Abbrev Number: 3 (DW_TAG_typedef)
    <1d7>   DW_AT_name        : (indirect string, offset: 0xa82d1): uint32_t
    <1db>   DW_AT_decl_file   : 4
    <1dc>   DW_AT_decl_line   : 48
    <1dd>   DW_AT_decl_column : 20
    <1de>   DW_AT_type        : <0x19f>
 <1><1e2>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <1e3>   DW_AT_type        : <0x1d6>
 <1><1e7>: Abbrev Number: 3 (DW_TAG_typedef)
    <1e8>   DW_AT_name        : (indirect string, offset: 0xe8a8e): uint64_t
    <1ec>   DW_AT_decl_file   : 4
    <1ed>   DW_AT_decl_line   : 60
    <1ee>   DW_AT_decl_column : 20
    <1ef>   DW_AT_type        : <0x1b2>
 <1><1f3>: Abbrev Number: 3 (DW_TAG_typedef)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x6da98): TaskFunction_t
    <1f8>   DW_AT_decl_file   : 5
    <1f9>   DW_AT_decl_line   : 36
    <1fa>   DW_AT_decl_column : 17
    <1fb>   DW_AT_type        : <0x1ff>
 <1><1ff>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <200>   DW_AT_byte_size   : 4
    <200>   DW_AT_type        : <0x204>
 <1><204>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <205>   DW_AT_prototyped  : 1
    <205>   DW_AT_sibling     : <0x20f>
 <2><209>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <20a>   DW_AT_type        : <0x20f>
 <2><20e>: Abbrev Number: 0
 <1><20f>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <210>   DW_AT_byte_size   : 4
 <1><211>: Abbrev Number: 7 (DW_TAG_const_type)
    <212>   DW_AT_type        : <0x20f>
 <1><216>: Abbrev Number: 3 (DW_TAG_typedef)
    <217>   DW_AT_name        : (indirect string, offset: 0xd522e): StackType_t
    <21b>   DW_AT_decl_file   : 6
    <21c>   DW_AT_decl_line   : 58
    <21d>   DW_AT_decl_column : 26
    <21e>   DW_AT_type        : <0x1d6>
 <1><222>: Abbrev Number: 7 (DW_TAG_const_type)
    <223>   DW_AT_type        : <0x216>
 <1><227>: Abbrev Number: 3 (DW_TAG_typedef)
    <228>   DW_AT_name        : (indirect string, offset: 0xe8cf9): BaseType_t
    <22c>   DW_AT_decl_file   : 6
    <22d>   DW_AT_decl_line   : 59
    <22e>   DW_AT_decl_column : 26
    <22f>   DW_AT_type        : <0x198>
 <1><233>: Abbrev Number: 3 (DW_TAG_typedef)
    <234>   DW_AT_name        : (indirect string, offset: 0xe8cf8): UBaseType_t
    <238>   DW_AT_decl_file   : 6
    <239>   DW_AT_decl_line   : 60
    <23a>   DW_AT_decl_column : 26
    <23b>   DW_AT_type        : <0x1ab>
 <1><23f>: Abbrev Number: 3 (DW_TAG_typedef)
    <240>   DW_AT_name        : (indirect string, offset: 0x8004b): TickType_t
    <244>   DW_AT_decl_file   : 6
    <245>   DW_AT_decl_line   : 66
    <246>   DW_AT_decl_column : 26
    <247>   DW_AT_type        : <0x1d6>
 <1><24b>: Abbrev Number: 7 (DW_TAG_const_type)
    <24c>   DW_AT_type        : <0x23f>
 <1><250>: Abbrev Number: 3 (DW_TAG_typedef)
    <251>   DW_AT_name        : (indirect string, offset: 0xc99d6): TaskHandle_t
    <255>   DW_AT_decl_file   : 7
    <256>   DW_AT_decl_line   : 95
    <257>   DW_AT_decl_column : 46
    <258>   DW_AT_type        : <0x25c>
 <1><25c>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <25d>   DW_AT_byte_size   : 4
    <25d>   DW_AT_type        : <0x261>
 <1><261>: Abbrev Number: 24 (DW_TAG_structure_type)
    <262>   DW_AT_name        : (indirect string, offset: 0xc511a): tskTaskControlBlock
    <266>   DW_AT_declaration : 1
 <1><266>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <267>   DW_AT_byte_size   : 4
    <267>   DW_AT_type        : <0x277>
 <1><26b>: Abbrev Number: 7 (DW_TAG_const_type)
    <26c>   DW_AT_type        : <0x266>
 <1><270>: Abbrev Number: 5 (DW_TAG_base_type)
    <271>   DW_AT_byte_size   : 1
    <272>   DW_AT_encoding    : 8	(unsigned char)
    <273>   DW_AT_name        : (indirect string, offset: 0x4ad84): char
 <1><277>: Abbrev Number: 7 (DW_TAG_const_type)
    <278>   DW_AT_type        : <0x270>
 <1><27c>: Abbrev Number: 12 (DW_TAG_structure_type)
    <27d>   DW_AT_byte_size   : 48
    <27e>   DW_AT_decl_file   : 8
    <27e>   DW_AT_decl_line   : 531
    <280>   DW_AT_decl_column : 9
    <280>   DW_AT_sibling     : <0x309>
 <2><284>: Abbrev Number: 1 (DW_TAG_member)
    <285>   DW_AT_name        : (indirect string, offset: 0xe88ba): MODER
    <289>   DW_AT_decl_file   : 8
    <289>   DW_AT_decl_line   : 533
    <28b>   DW_AT_decl_column : 17
    <28b>   DW_AT_type        : <0x1e2>
    <28f>   DW_AT_data_member_location: 0
 <2><290>: Abbrev Number: 1 (DW_TAG_member)
    <291>   DW_AT_name        : (indirect string, offset: 0xe8bc8): OTYPER
    <295>   DW_AT_decl_file   : 8
    <295>   DW_AT_decl_line   : 534
    <297>   DW_AT_decl_column : 17
    <297>   DW_AT_type        : <0x1e2>
    <29b>   DW_AT_data_member_location: 4
 <2><29c>: Abbrev Number: 1 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0xe8c52): OSPEEDR
    <2a1>   DW_AT_decl_file   : 8
    <2a1>   DW_AT_decl_line   : 535
    <2a3>   DW_AT_decl_column : 17
    <2a3>   DW_AT_type        : <0x1e2>
    <2a7>   DW_AT_data_member_location: 8
 <2><2a8>: Abbrev Number: 1 (DW_TAG_member)
    <2a9>   DW_AT_name        : (indirect string, offset: 0xe8b61): PUPDR
    <2ad>   DW_AT_decl_file   : 8
    <2ad>   DW_AT_decl_line   : 536
    <2af>   DW_AT_decl_column : 17
    <2af>   DW_AT_type        : <0x1e2>
    <2b3>   DW_AT_data_member_location: 12
 <2><2b4>: Abbrev Number: 6 (DW_TAG_member)
    <2b5>   DW_AT_name        : IDR
    <2b9>   DW_AT_decl_file   : 8
    <2b9>   DW_AT_decl_line   : 537
    <2bb>   DW_AT_decl_column : 17
    <2bb>   DW_AT_type        : <0x1e2>
    <2bf>   DW_AT_data_member_location: 16
 <2><2c0>: Abbrev Number: 6 (DW_TAG_member)
    <2c1>   DW_AT_name        : ODR
    <2c5>   DW_AT_decl_file   : 8
    <2c5>   DW_AT_decl_line   : 538
    <2c7>   DW_AT_decl_column : 17
    <2c7>   DW_AT_type        : <0x1e2>
    <2cb>   DW_AT_data_member_location: 20
 <2><2cc>: Abbrev Number: 1 (DW_TAG_member)
    <2cd>   DW_AT_name        : (indirect string, offset: 0xe898f): BSRR
    <2d1>   DW_AT_decl_file   : 8
    <2d1>   DW_AT_decl_line   : 539
    <2d3>   DW_AT_decl_column : 17
    <2d3>   DW_AT_type        : <0x1e2>
    <2d7>   DW_AT_data_member_location: 24
 <2><2d8>: Abbrev Number: 1 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0xe8c39): LCKR
    <2dd>   DW_AT_decl_file   : 8
    <2dd>   DW_AT_decl_line   : 540
    <2df>   DW_AT_decl_column : 17
    <2df>   DW_AT_type        : <0x1e2>
    <2e3>   DW_AT_data_member_location: 28
 <2><2e4>: Abbrev Number: 6 (DW_TAG_member)
    <2e5>   DW_AT_name        : AFR
    <2e9>   DW_AT_decl_file   : 8
    <2e9>   DW_AT_decl_line   : 541
    <2eb>   DW_AT_decl_column : 17
    <2eb>   DW_AT_type        : <0x319>
    <2ef>   DW_AT_data_member_location: 32
 <2><2f0>: Abbrev Number: 6 (DW_TAG_member)
    <2f1>   DW_AT_name        : BRR
    <2f5>   DW_AT_decl_file   : 8
    <2f5>   DW_AT_decl_line   : 542
    <2f7>   DW_AT_decl_column : 17
    <2f7>   DW_AT_type        : <0x1e2>
    <2fb>   DW_AT_data_member_location: 40
 <2><2fc>: Abbrev Number: 1 (DW_TAG_member)
    <2fd>   DW_AT_name        : (indirect string, offset: 0xe88c5): ASCR
    <301>   DW_AT_decl_file   : 8
    <301>   DW_AT_decl_line   : 543
    <303>   DW_AT_decl_column : 17
    <303>   DW_AT_type        : <0x1e2>
    <307>   DW_AT_data_member_location: 44
 <2><308>: Abbrev Number: 0
 <1><309>: Abbrev Number: 16 (DW_TAG_array_type)
    <30a>   DW_AT_type        : <0x1e2>
    <30e>   DW_AT_sibling     : <0x319>
 <2><312>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <313>   DW_AT_type        : <0x15b>
    <317>   DW_AT_upper_bound : 1
 <2><318>: Abbrev Number: 0
 <1><319>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <31a>   DW_AT_type        : <0x309>
 <1><31e>: Abbrev Number: 13 (DW_TAG_typedef)
    <31f>   DW_AT_name        : (indirect string, offset: 0xe8d04): GPIO_TypeDef
    <323>   DW_AT_decl_file   : 8
    <323>   DW_AT_decl_line   : 545
    <325>   DW_AT_decl_column : 3
    <325>   DW_AT_type        : <0x27c>
 <1><329>: Abbrev Number: 12 (DW_TAG_structure_type)
    <32a>   DW_AT_byte_size   : 44
    <32b>   DW_AT_decl_file   : 8
    <32b>   DW_AT_decl_line   : 552
    <32d>   DW_AT_decl_column : 9
    <32d>   DW_AT_sibling     : <0x3b6>
 <2><331>: Abbrev Number: 6 (DW_TAG_member)
    <332>   DW_AT_name        : CR1
    <336>   DW_AT_decl_file   : 8
    <336>   DW_AT_decl_line   : 554
    <338>   DW_AT_decl_column : 17
    <338>   DW_AT_type        : <0x1e2>
    <33c>   DW_AT_data_member_location: 0
 <2><33d>: Abbrev Number: 6 (DW_TAG_member)
    <33e>   DW_AT_name        : CR2
    <342>   DW_AT_decl_file   : 8
    <342>   DW_AT_decl_line   : 555
    <344>   DW_AT_decl_column : 17
    <344>   DW_AT_type        : <0x1e2>
    <348>   DW_AT_data_member_location: 4
 <2><349>: Abbrev Number: 1 (DW_TAG_member)
    <34a>   DW_AT_name        : (indirect string, offset: 0xe8956): OAR1
    <34e>   DW_AT_decl_file   : 8
    <34e>   DW_AT_decl_line   : 556
    <350>   DW_AT_decl_column : 17
    <350>   DW_AT_type        : <0x1e2>
    <354>   DW_AT_data_member_location: 8
 <2><355>: Abbrev Number: 1 (DW_TAG_member)
    <356>   DW_AT_name        : (indirect string, offset: 0xe8a46): OAR2
    <35a>   DW_AT_decl_file   : 8
    <35a>   DW_AT_decl_line   : 557
    <35c>   DW_AT_decl_column : 17
    <35c>   DW_AT_type        : <0x1e2>
    <360>   DW_AT_data_member_location: 12
 <2><361>: Abbrev Number: 1 (DW_TAG_member)
    <362>   DW_AT_name        : (indirect string, offset: 0xe8cde): TIMINGR
    <366>   DW_AT_decl_file   : 8
    <366>   DW_AT_decl_line   : 558
    <368>   DW_AT_decl_column : 17
    <368>   DW_AT_type        : <0x1e2>
    <36c>   DW_AT_data_member_location: 16
 <2><36d>: Abbrev Number: 1 (DW_TAG_member)
    <36e>   DW_AT_name        : (indirect string, offset: 0xe8be4): TIMEOUTR
    <372>   DW_AT_decl_file   : 8
    <372>   DW_AT_decl_line   : 559
    <374>   DW_AT_decl_column : 17
    <374>   DW_AT_type        : <0x1e2>
    <378>   DW_AT_data_member_location: 20
 <2><379>: Abbrev Number: 6 (DW_TAG_member)
    <37a>   DW_AT_name        : ISR
    <37e>   DW_AT_decl_file   : 8
    <37e>   DW_AT_decl_line   : 560
    <380>   DW_AT_decl_column : 17
    <380>   DW_AT_type        : <0x1e2>
    <384>   DW_AT_data_member_location: 24
 <2><385>: Abbrev Number: 6 (DW_TAG_member)
    <386>   DW_AT_name        : ICR
    <38a>   DW_AT_decl_file   : 8
    <38a>   DW_AT_decl_line   : 561
    <38c>   DW_AT_decl_column : 17
    <38c>   DW_AT_type        : <0x1e2>
    <390>   DW_AT_data_member_location: 28
 <2><391>: Abbrev Number: 1 (DW_TAG_member)
    <392>   DW_AT_name        : (indirect string, offset: 0xe8b8a): PECR
    <396>   DW_AT_decl_file   : 8
    <396>   DW_AT_decl_line   : 562
    <398>   DW_AT_decl_column : 17
    <398>   DW_AT_type        : <0x1e2>
    <39c>   DW_AT_data_member_location: 32
 <2><39d>: Abbrev Number: 1 (DW_TAG_member)
    <39e>   DW_AT_name        : (indirect string, offset: 0xe8bfc): RXDR
    <3a2>   DW_AT_decl_file   : 8
    <3a2>   DW_AT_decl_line   : 563
    <3a4>   DW_AT_decl_column : 17
    <3a4>   DW_AT_type        : <0x1e2>
    <3a8>   DW_AT_data_member_location: 36
 <2><3a9>: Abbrev Number: 1 (DW_TAG_member)
    <3aa>   DW_AT_name        : (indirect string, offset: 0xe8964): TXDR
    <3ae>   DW_AT_decl_file   : 8
    <3ae>   DW_AT_decl_line   : 564
    <3b0>   DW_AT_decl_column : 17
    <3b0>   DW_AT_type        : <0x1e2>
    <3b4>   DW_AT_data_member_location: 40
 <2><3b5>: Abbrev Number: 0
 <1><3b6>: Abbrev Number: 13 (DW_TAG_typedef)
    <3b7>   DW_AT_name        : (indirect string, offset: 0xe8bcf): I2C_TypeDef
    <3bb>   DW_AT_decl_file   : 8
    <3bb>   DW_AT_decl_line   : 565
    <3bd>   DW_AT_decl_column : 3
    <3bd>   DW_AT_type        : <0x329>
 <1><3c1>: Abbrev Number: 12 (DW_TAG_structure_type)
    <3c2>   DW_AT_byte_size   : 152
    <3c3>   DW_AT_decl_file   : 8
    <3c3>   DW_AT_decl_line   : 685
    <3c5>   DW_AT_decl_column : 9
    <3c5>   DW_AT_sibling     : <0x591>
 <2><3c9>: Abbrev Number: 6 (DW_TAG_member)
    <3ca>   DW_AT_name        : CR
    <3cd>   DW_AT_decl_file   : 8
    <3cd>   DW_AT_decl_line   : 687
    <3cf>   DW_AT_decl_column : 17
    <3cf>   DW_AT_type        : <0x1e2>
    <3d3>   DW_AT_data_member_location: 0
 <2><3d4>: Abbrev Number: 1 (DW_TAG_member)
    <3d5>   DW_AT_name        : (indirect string, offset: 0xe8adc): ICSCR
    <3d9>   DW_AT_decl_file   : 8
    <3d9>   DW_AT_decl_line   : 688
    <3db>   DW_AT_decl_column : 17
    <3db>   DW_AT_type        : <0x1e2>
    <3df>   DW_AT_data_member_location: 4
 <2><3e0>: Abbrev Number: 1 (DW_TAG_member)
    <3e1>   DW_AT_name        : (indirect string, offset: 0xe8a03): CFGR
    <3e5>   DW_AT_decl_file   : 8
    <3e5>   DW_AT_decl_line   : 689
    <3e7>   DW_AT_decl_column : 17
    <3e7>   DW_AT_type        : <0x1e2>
    <3eb>   DW_AT_data_member_location: 8
 <2><3ec>: Abbrev Number: 1 (DW_TAG_member)
    <3ed>   DW_AT_name        : (indirect string, offset: 0xe8bab): PLLCFGR
    <3f1>   DW_AT_decl_file   : 8
    <3f1>   DW_AT_decl_line   : 690
    <3f3>   DW_AT_decl_column : 17
    <3f3>   DW_AT_type        : <0x1e2>
    <3f7>   DW_AT_data_member_location: 12
 <2><3f8>: Abbrev Number: 1 (DW_TAG_member)
    <3f9>   DW_AT_name        : (indirect string, offset: 0xe89fc): PLLSAI1CFGR
    <3fd>   DW_AT_decl_file   : 8
    <3fd>   DW_AT_decl_line   : 691
    <3ff>   DW_AT_decl_column : 17
    <3ff>   DW_AT_type        : <0x1e2>
    <403>   DW_AT_data_member_location: 16
 <2><404>: Abbrev Number: 1 (DW_TAG_member)
    <405>   DW_AT_name        : (indirect string, offset: 0xe8b6c): PLLSAI2CFGR
    <409>   DW_AT_decl_file   : 8
    <409>   DW_AT_decl_line   : 692
    <40b>   DW_AT_decl_column : 17
    <40b>   DW_AT_type        : <0x1e2>
    <40f>   DW_AT_data_member_location: 20
 <2><410>: Abbrev Number: 1 (DW_TAG_member)
    <411>   DW_AT_name        : (indirect string, offset: 0xe88cf): CIER
    <415>   DW_AT_decl_file   : 8
    <415>   DW_AT_decl_line   : 693
    <417>   DW_AT_decl_column : 17
    <417>   DW_AT_type        : <0x1e2>
    <41b>   DW_AT_data_member_location: 24
 <2><41c>: Abbrev Number: 1 (DW_TAG_member)
    <41d>   DW_AT_name        : (indirect string, offset: 0xe88ca): CIFR
    <421>   DW_AT_decl_file   : 8
    <421>   DW_AT_decl_line   : 694
    <423>   DW_AT_decl_column : 17
    <423>   DW_AT_type        : <0x1e2>
    <427>   DW_AT_data_member_location: 28
 <2><428>: Abbrev Number: 1 (DW_TAG_member)
    <429>   DW_AT_name        : (indirect string, offset: 0xe88c0): CICR
    <42d>   DW_AT_decl_file   : 8
    <42d>   DW_AT_decl_line   : 695
    <42f>   DW_AT_decl_column : 17
    <42f>   DW_AT_type        : <0x1e2>
    <433>   DW_AT_data_member_location: 32
 <2><434>: Abbrev Number: 1 (DW_TAG_member)
    <435>   DW_AT_name        : (indirect string, offset: 0xe8ca2): RESERVED0
    <439>   DW_AT_decl_file   : 8
    <439>   DW_AT_decl_line   : 696
    <43b>   DW_AT_decl_column : 17
    <43b>   DW_AT_type        : <0x1d6>
    <43f>   DW_AT_data_member_location: 36
 <2><440>: Abbrev Number: 1 (DW_TAG_member)
    <441>   DW_AT_name        : (indirect string, offset: 0xe8bdb): AHB1RSTR
    <445>   DW_AT_decl_file   : 8
    <445>   DW_AT_decl_line   : 697
    <447>   DW_AT_decl_column : 17
    <447>   DW_AT_type        : <0x1e2>
    <44b>   DW_AT_data_member_location: 40
 <2><44c>: Abbrev Number: 1 (DW_TAG_member)
    <44d>   DW_AT_name        : (indirect string, offset: 0xe8916): AHB2RSTR
    <451>   DW_AT_decl_file   : 8
    <451>   DW_AT_decl_line   : 698
    <453>   DW_AT_decl_column : 17
    <453>   DW_AT_type        : <0x1e2>
    <457>   DW_AT_data_member_location: 44
 <2><458>: Abbrev Number: 1 (DW_TAG_member)
    <459>   DW_AT_name        : (indirect string, offset: 0xe89f3): AHB3RSTR
    <45d>   DW_AT_decl_file   : 8
    <45d>   DW_AT_decl_line   : 699
    <45f>   DW_AT_decl_column : 17
    <45f>   DW_AT_type        : <0x1e2>
    <463>   DW_AT_data_member_location: 48
 <2><464>: Abbrev Number: 1 (DW_TAG_member)
    <465>   DW_AT_name        : (indirect string, offset: 0xe8cac): RESERVED1
    <469>   DW_AT_decl_file   : 8
    <469>   DW_AT_decl_line   : 700
    <46b>   DW_AT_decl_column : 17
    <46b>   DW_AT_type        : <0x1d6>
    <46f>   DW_AT_data_member_location: 52
 <2><470>: Abbrev Number: 1 (DW_TAG_member)
    <471>   DW_AT_name        : (indirect string, offset: 0xe8969): APB1RSTR1
    <475>   DW_AT_decl_file   : 8
    <475>   DW_AT_decl_line   : 701
    <477>   DW_AT_decl_column : 17
    <477>   DW_AT_type        : <0x1e2>
    <47b>   DW_AT_data_member_location: 56
 <2><47c>: Abbrev Number: 1 (DW_TAG_member)
    <47d>   DW_AT_name        : (indirect string, offset: 0xe8973): APB1RSTR2
    <481>   DW_AT_decl_file   : 8
    <481>   DW_AT_decl_line   : 702
    <483>   DW_AT_decl_column : 17
    <483>   DW_AT_type        : <0x1e2>
    <487>   DW_AT_data_member_location: 60
 <2><488>: Abbrev Number: 1 (DW_TAG_member)
    <489>   DW_AT_name        : (indirect string, offset: 0xe8a4b): APB2RSTR
    <48d>   DW_AT_decl_file   : 8
    <48d>   DW_AT_decl_line   : 703
    <48f>   DW_AT_decl_column : 17
    <48f>   DW_AT_type        : <0x1e2>
    <493>   DW_AT_data_member_location: 64
 <2><494>: Abbrev Number: 1 (DW_TAG_member)
    <495>   DW_AT_name        : (indirect string, offset: 0xe8cb6): RESERVED2
    <499>   DW_AT_decl_file   : 8
    <499>   DW_AT_decl_line   : 704
    <49b>   DW_AT_decl_column : 17
    <49b>   DW_AT_type        : <0x1d6>
    <49f>   DW_AT_data_member_location: 68
 <2><4a0>: Abbrev Number: 1 (DW_TAG_member)
    <4a1>   DW_AT_name        : (indirect string, offset: 0xe8909): AHB1ENR
    <4a5>   DW_AT_decl_file   : 8
    <4a5>   DW_AT_decl_line   : 705
    <4a7>   DW_AT_decl_column : 17
    <4a7>   DW_AT_type        : <0x1e2>
    <4ab>   DW_AT_data_member_location: 72
 <2><4ac>: Abbrev Number: 1 (DW_TAG_member)
    <4ad>   DW_AT_name        : (indirect string, offset: 0xe89a8): AHB2ENR
    <4b1>   DW_AT_decl_file   : 8
    <4b1>   DW_AT_decl_line   : 706
    <4b3>   DW_AT_decl_column : 17
    <4b3>   DW_AT_type        : <0x1e2>
    <4b7>   DW_AT_data_member_location: 76
 <2><4b8>: Abbrev Number: 1 (DW_TAG_member)
    <4b9>   DW_AT_name        : (indirect string, offset: 0xe8a6b): AHB3ENR
    <4bd>   DW_AT_decl_file   : 8
    <4bd>   DW_AT_decl_line   : 707
    <4bf>   DW_AT_decl_column : 17
    <4bf>   DW_AT_type        : <0x1e2>
    <4c3>   DW_AT_data_member_location: 80
 <2><4c4>: Abbrev Number: 1 (DW_TAG_member)
    <4c5>   DW_AT_name        : (indirect string, offset: 0xe8cc0): RESERVED3
    <4c9>   DW_AT_decl_file   : 8
    <4c9>   DW_AT_decl_line   : 708
    <4cb>   DW_AT_decl_column : 17
    <4cb>   DW_AT_type        : <0x1d6>
    <4cf>   DW_AT_data_member_location: 84
 <2><4d0>: Abbrev Number: 1 (DW_TAG_member)
    <4d1>   DW_AT_name        : (indirect string, offset: 0xe88d4): APB1ENR1
    <4d5>   DW_AT_decl_file   : 8
    <4d5>   DW_AT_decl_line   : 709
    <4d7>   DW_AT_decl_column : 17
    <4d7>   DW_AT_type        : <0x1e2>
    <4db>   DW_AT_data_member_location: 88
 <2><4dc>: Abbrev Number: 1 (DW_TAG_member)
    <4dd>   DW_AT_name        : (indirect string, offset: 0xe88dd): APB1ENR2
    <4e1>   DW_AT_decl_file   : 8
    <4e1>   DW_AT_decl_line   : 710
    <4e3>   DW_AT_decl_column : 17
    <4e3>   DW_AT_type        : <0x1e2>
    <4e7>   DW_AT_data_member_location: 92
 <2><4e8>: Abbrev Number: 1 (DW_TAG_member)
    <4e9>   DW_AT_name        : (indirect string, offset: 0xe891f): APB2ENR
    <4ed>   DW_AT_decl_file   : 8
    <4ed>   DW_AT_decl_line   : 711
    <4ef>   DW_AT_decl_column : 17
    <4ef>   DW_AT_type        : <0x1e2>
    <4f3>   DW_AT_data_member_location: 96
 <2><4f4>: Abbrev Number: 1 (DW_TAG_member)
    <4f5>   DW_AT_name        : (indirect string, offset: 0xe8b01): RESERVED4
    <4f9>   DW_AT_decl_file   : 8
    <4f9>   DW_AT_decl_line   : 712
    <4fb>   DW_AT_decl_column : 17
    <4fb>   DW_AT_type        : <0x1d6>
    <4ff>   DW_AT_data_member_location: 100
 <2><500>: Abbrev Number: 1 (DW_TAG_member)
    <501>   DW_AT_name        : (indirect string, offset: 0xe8a82): AHB1SMENR
    <505>   DW_AT_decl_file   : 8
    <505>   DW_AT_decl_line   : 713
    <507>   DW_AT_decl_column : 17
    <507>   DW_AT_type        : <0x1e2>
    <50b>   DW_AT_data_member_location: 104
 <2><50c>: Abbrev Number: 1 (DW_TAG_member)
    <50d>   DW_AT_name        : (indirect string, offset: 0xe8c80): AHB2SMENR
    <511>   DW_AT_decl_file   : 8
    <511>   DW_AT_decl_line   : 714
    <513>   DW_AT_decl_column : 17
    <513>   DW_AT_type        : <0x1e2>
    <517>   DW_AT_data_member_location: 108
 <2><518>: Abbrev Number: 1 (DW_TAG_member)
    <519>   DW_AT_name        : (indirect string, offset: 0xe8a21): AHB3SMENR
    <51d>   DW_AT_decl_file   : 8
    <51d>   DW_AT_decl_line   : 715
    <51f>   DW_AT_decl_column : 17
    <51f>   DW_AT_type        : <0x1e2>
    <523>   DW_AT_data_member_location: 112
 <2><524>: Abbrev Number: 1 (DW_TAG_member)
    <525>   DW_AT_name        : (indirect string, offset: 0xe8cca): RESERVED5
    <529>   DW_AT_decl_file   : 8
    <529>   DW_AT_decl_line   : 716
    <52b>   DW_AT_decl_column : 17
    <52b>   DW_AT_type        : <0x1d6>
    <52f>   DW_AT_data_member_location: 116
 <2><530>: Abbrev Number: 1 (DW_TAG_member)
    <531>   DW_AT_name        : (indirect string, offset: 0xe88e6): APB1SMENR1
    <535>   DW_AT_decl_file   : 8
    <535>   DW_AT_decl_line   : 717
    <537>   DW_AT_decl_column : 17
    <537>   DW_AT_type        : <0x1e2>
    <53b>   DW_AT_data_member_location: 120
 <2><53c>: Abbrev Number: 1 (DW_TAG_member)
    <53d>   DW_AT_name        : (indirect string, offset: 0xe88f1): APB1SMENR2
    <541>   DW_AT_decl_file   : 8
    <541>   DW_AT_decl_line   : 718
    <543>   DW_AT_decl_column : 17
    <543>   DW_AT_type        : <0x1e2>
    <547>   DW_AT_data_member_location: 124
 <2><548>: Abbrev Number: 1 (DW_TAG_member)
    <549>   DW_AT_name        : (indirect string, offset: 0xe8bbe): APB2SMENR
    <54d>   DW_AT_decl_file   : 8
    <54d>   DW_AT_decl_line   : 719
    <54f>   DW_AT_decl_column : 17
    <54f>   DW_AT_type        : <0x1e2>
    <553>   DW_AT_data_member_location: 128
 <2><554>: Abbrev Number: 1 (DW_TAG_member)
    <555>   DW_AT_name        : (indirect string, offset: 0xe8b0b): RESERVED6
    <559>   DW_AT_decl_file   : 8
    <559>   DW_AT_decl_line   : 720
    <55b>   DW_AT_decl_column : 17
    <55b>   DW_AT_type        : <0x1d6>
    <55f>   DW_AT_data_member_location: 132
 <2><560>: Abbrev Number: 1 (DW_TAG_member)
    <561>   DW_AT_name        : (indirect string, offset: 0xe89d0): CCIPR
    <565>   DW_AT_decl_file   : 8
    <565>   DW_AT_decl_line   : 721
    <567>   DW_AT_decl_column : 17
    <567>   DW_AT_type        : <0x1e2>
    <56b>   DW_AT_data_member_location: 136
 <2><56c>: Abbrev Number: 1 (DW_TAG_member)
    <56d>   DW_AT_name        : (indirect string, offset: 0xe8cd4): RESERVED7
    <571>   DW_AT_decl_file   : 8
    <571>   DW_AT_decl_line   : 722
    <573>   DW_AT_decl_column : 17
    <573>   DW_AT_type        : <0x1d6>
    <577>   DW_AT_data_member_location: 140
 <2><578>: Abbrev Number: 1 (DW_TAG_member)
    <579>   DW_AT_name        : (indirect string, offset: 0xe89a3): BDCR
    <57d>   DW_AT_decl_file   : 8
    <57d>   DW_AT_decl_line   : 723
    <57f>   DW_AT_decl_column : 17
    <57f>   DW_AT_type        : <0x1e2>
    <583>   DW_AT_data_member_location: 144
 <2><584>: Abbrev Number: 6 (DW_TAG_member)
    <585>   DW_AT_name        : CSR
    <589>   DW_AT_decl_file   : 8
    <589>   DW_AT_decl_line   : 724
    <58b>   DW_AT_decl_column : 17
    <58b>   DW_AT_type        : <0x1e2>
    <58f>   DW_AT_data_member_location: 148
 <2><590>: Abbrev Number: 0
 <1><591>: Abbrev Number: 13 (DW_TAG_typedef)
    <592>   DW_AT_name        : (indirect string, offset: 0xe8a97): RCC_TypeDef
    <596>   DW_AT_decl_file   : 8
    <596>   DW_AT_decl_line   : 725
    <598>   DW_AT_decl_column : 3
    <598>   DW_AT_type        : <0x3c1>
 <1><59c>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <59d>   DW_AT_encoding    : 7	(unsigned)
    <59e>   DW_AT_byte_size   : 1
    <59f>   DW_AT_type        : <0x183>
    <5a3>   DW_AT_decl_file   : 9
    <5a4>   DW_AT_decl_line   : 39
    <5a5>   DW_AT_decl_column : 1
    <5a6>   DW_AT_sibling     : <0x5c3>
 <2><5aa>: Abbrev Number: 10 (DW_TAG_enumerator)
    <5ab>   DW_AT_name        : (indirect string, offset: 0xe8a08): HAL_OK
    <5af>   DW_AT_const_value : 0
 <2><5b0>: Abbrev Number: 10 (DW_TAG_enumerator)
    <5b1>   DW_AT_name        : (indirect string, offset: 0xe8b4c): HAL_ERROR
    <5b5>   DW_AT_const_value : 1
 <2><5b6>: Abbrev Number: 10 (DW_TAG_enumerator)
    <5b7>   DW_AT_name        : (indirect string, offset: 0xe895b): HAL_BUSY
    <5bb>   DW_AT_const_value : 2
 <2><5bc>: Abbrev Number: 10 (DW_TAG_enumerator)
    <5bd>   DW_AT_name        : (indirect string, offset: 0xe89b0): HAL_TIMEOUT
    <5c1>   DW_AT_const_value : 3
 <2><5c2>: Abbrev Number: 0
 <1><5c3>: Abbrev Number: 3 (DW_TAG_typedef)
    <5c4>   DW_AT_name        : (indirect string, offset: 0xe8ce6): HAL_StatusTypeDef
    <5c8>   DW_AT_decl_file   : 9
    <5c9>   DW_AT_decl_line   : 44
    <5ca>   DW_AT_decl_column : 3
    <5cb>   DW_AT_type        : <0x59c>
 <1><5cf>: Abbrev Number: 14 (DW_TAG_structure_type)
    <5d0>   DW_AT_byte_size   : 28
    <5d1>   DW_AT_decl_file   : 10
    <5d1>   DW_AT_decl_line   : 45
    <5d2>   DW_AT_decl_column : 9
    <5d2>   DW_AT_sibling     : <0x624>
 <2><5d6>: Abbrev Number: 2 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0xe8b78): PLLState
    <5db>   DW_AT_decl_file   : 10
    <5db>   DW_AT_decl_line   : 47
    <5dc>   DW_AT_decl_column : 12
    <5dc>   DW_AT_type        : <0x1d6>
    <5e0>   DW_AT_data_member_location: 0
 <2><5e1>: Abbrev Number: 2 (DW_TAG_member)
    <5e2>   DW_AT_name        : (indirect string, offset: 0xe8ba1): PLLSource
    <5e6>   DW_AT_decl_file   : 10
    <5e6>   DW_AT_decl_line   : 50
    <5e7>   DW_AT_decl_column : 12
    <5e7>   DW_AT_type        : <0x1d6>
    <5eb>   DW_AT_data_member_location: 4
 <2><5ec>: Abbrev Number: 2 (DW_TAG_member)
    <5ed>   DW_AT_name        : (indirect string, offset: 0xe8b67): PLLM
    <5f1>   DW_AT_decl_file   : 10
    <5f1>   DW_AT_decl_line   : 53
    <5f2>   DW_AT_decl_column : 12
    <5f2>   DW_AT_type        : <0x1d6>
    <5f6>   DW_AT_data_member_location: 8
 <2><5f7>: Abbrev Number: 2 (DW_TAG_member)
    <5f8>   DW_AT_name        : (indirect string, offset: 0xe8c16): PLLN
    <5fc>   DW_AT_decl_file   : 10
    <5fc>   DW_AT_decl_line   : 57
    <5fd>   DW_AT_decl_column : 12
    <5fd>   DW_AT_type        : <0x1d6>
    <601>   DW_AT_data_member_location: 12
 <2><602>: Abbrev Number: 2 (DW_TAG_member)
    <603>   DW_AT_name        : (indirect string, offset: 0xe8c1b): PLLP
    <607>   DW_AT_decl_file   : 10
    <607>   DW_AT_decl_line   : 61
    <608>   DW_AT_decl_column : 12
    <608>   DW_AT_type        : <0x1d6>
    <60c>   DW_AT_data_member_location: 16
 <2><60d>: Abbrev Number: 2 (DW_TAG_member)
    <60e>   DW_AT_name        : (indirect string, offset: 0xa839d): PLLQ
    <612>   DW_AT_decl_file   : 10
    <612>   DW_AT_decl_line   : 65
    <613>   DW_AT_decl_column : 12
    <613>   DW_AT_type        : <0x1d6>
    <617>   DW_AT_data_member_location: 20
 <2><618>: Abbrev Number: 2 (DW_TAG_member)
    <619>   DW_AT_name        : (indirect string, offset: 0xe8c20): PLLR
    <61d>   DW_AT_decl_file   : 10
    <61d>   DW_AT_decl_line   : 68
    <61e>   DW_AT_decl_column : 12
    <61e>   DW_AT_type        : <0x1d6>
    <622>   DW_AT_data_member_location: 24
 <2><623>: Abbrev Number: 0
 <1><624>: Abbrev Number: 3 (DW_TAG_typedef)
    <625>   DW_AT_name        : (indirect string, offset: 0xe8b39): RCC_PLLInitTypeDef
    <629>   DW_AT_decl_file   : 10
    <62a>   DW_AT_decl_line   : 73
    <62b>   DW_AT_decl_column : 2
    <62c>   DW_AT_type        : <0x5cf>
 <1><630>: Abbrev Number: 14 (DW_TAG_structure_type)
    <631>   DW_AT_byte_size   : 68
    <632>   DW_AT_decl_file   : 10
    <632>   DW_AT_decl_line   : 78
    <633>   DW_AT_decl_column : 9
    <633>   DW_AT_sibling     : <0x6b3>
 <2><637>: Abbrev Number: 2 (DW_TAG_member)
    <638>   DW_AT_name        : (indirect string, offset: 0xe8bed): OscillatorType
    <63c>   DW_AT_decl_file   : 10
    <63c>   DW_AT_decl_line   : 80
    <63d>   DW_AT_decl_column : 12
    <63d>   DW_AT_type        : <0x1d6>
    <641>   DW_AT_data_member_location: 0
 <2><642>: Abbrev Number: 2 (DW_TAG_member)
    <643>   DW_AT_name        : (indirect string, offset: 0xe8b81): HSEState
    <647>   DW_AT_decl_file   : 10
    <647>   DW_AT_decl_line   : 83
    <648>   DW_AT_decl_column : 12
    <648>   DW_AT_type        : <0x1d6>
    <64c>   DW_AT_data_member_location: 4
 <2><64d>: Abbrev Number: 2 (DW_TAG_member)
    <64e>   DW_AT_name        : (indirect string, offset: 0xe8a3d): LSEState
    <652>   DW_AT_decl_file   : 10
    <652>   DW_AT_decl_line   : 86
    <653>   DW_AT_decl_column : 12
    <653>   DW_AT_type        : <0x1d6>
    <657>   DW_AT_data_member_location: 8
 <2><658>: Abbrev Number: 2 (DW_TAG_member)
    <659>   DW_AT_name        : (indirect string, offset: 0xe8a62): HSIState
    <65d>   DW_AT_decl_file   : 10
    <65d>   DW_AT_decl_line   : 89
    <65e>   DW_AT_decl_column : 12
    <65e>   DW_AT_type        : <0x1d6>
    <662>   DW_AT_data_member_location: 12
 <2><663>: Abbrev Number: 2 (DW_TAG_member)
    <664>   DW_AT_name        : (indirect string, offset: 0xe8c3e): HSICalibrationValue
    <668>   DW_AT_decl_file   : 10
    <668>   DW_AT_decl_line   : 92
    <669>   DW_AT_decl_column : 12
    <669>   DW_AT_type        : <0x1d6>
    <66d>   DW_AT_data_member_location: 16
 <2><66e>: Abbrev Number: 2 (DW_TAG_member)
    <66f>   DW_AT_name        : (indirect string, offset: 0xe8a18): LSIState
    <673>   DW_AT_decl_file   : 10
    <673>   DW_AT_decl_line   : 98
    <674>   DW_AT_decl_column : 12
    <674>   DW_AT_type        : <0x1d6>
    <678>   DW_AT_data_member_location: 20
 <2><679>: Abbrev Number: 2 (DW_TAG_member)
    <67a>   DW_AT_name        : (indirect string, offset: 0xe8a0f): MSIState
    <67e>   DW_AT_decl_file   : 10
    <67e>   DW_AT_decl_line   : 106
    <67f>   DW_AT_decl_column : 12
    <67f>   DW_AT_type        : <0x1d6>
    <683>   DW_AT_data_member_location: 24
 <2><684>: Abbrev Number: 2 (DW_TAG_member)
    <685>   DW_AT_name        : (indirect string, offset: 0xe89bc): MSICalibrationValue
    <689>   DW_AT_decl_file   : 10
    <689>   DW_AT_decl_line   : 109
    <68a>   DW_AT_decl_column : 12
    <68a>   DW_AT_type        : <0x1d6>
    <68e>   DW_AT_data_member_location: 28
 <2><68f>: Abbrev Number: 2 (DW_TAG_member)
    <690>   DW_AT_name        : (indirect string, offset: 0xe8aad): MSIClockRange
    <694>   DW_AT_decl_file   : 10
    <694>   DW_AT_decl_line   : 112
    <695>   DW_AT_decl_column : 12
    <695>   DW_AT_type        : <0x1d6>
    <699>   DW_AT_data_member_location: 32
 <2><69a>: Abbrev Number: 2 (DW_TAG_member)
    <69b>   DW_AT_name        : (indirect string, offset: 0xe8bb3): HSI48State
    <69f>   DW_AT_decl_file   : 10
    <69f>   DW_AT_decl_line   : 115
    <6a0>   DW_AT_decl_column : 12
    <6a0>   DW_AT_type        : <0x1d6>
    <6a4>   DW_AT_data_member_location: 36
 <2><6a5>: Abbrev Number: 26 (DW_TAG_member)
    <6a6>   DW_AT_name        : PLL
    <6aa>   DW_AT_decl_file   : 10
    <6ab>   DW_AT_decl_line   : 118
    <6ac>   DW_AT_decl_column : 22
    <6ad>   DW_AT_type        : <0x624>
    <6b1>   DW_AT_data_member_location: 40
 <2><6b2>: Abbrev Number: 0
 <1><6b3>: Abbrev Number: 3 (DW_TAG_typedef)
    <6b4>   DW_AT_name        : (indirect string, offset: 0xe8abb): RCC_OscInitTypeDef
    <6b8>   DW_AT_decl_file   : 10
    <6b9>   DW_AT_decl_line   : 120
    <6ba>   DW_AT_decl_column : 2
    <6bb>   DW_AT_type        : <0x630>
 <1><6bf>: Abbrev Number: 14 (DW_TAG_structure_type)
    <6c0>   DW_AT_byte_size   : 20
    <6c1>   DW_AT_decl_file   : 10
    <6c1>   DW_AT_decl_line   : 125
    <6c2>   DW_AT_decl_column : 9
    <6c2>   DW_AT_sibling     : <0x6fe>
 <2><6c6>: Abbrev Number: 2 (DW_TAG_member)
    <6c7>   DW_AT_name        : (indirect string, offset: 0xe89d6): ClockType
    <6cb>   DW_AT_decl_file   : 10
    <6cb>   DW_AT_decl_line   : 127
    <6cc>   DW_AT_decl_column : 12
    <6cc>   DW_AT_type        : <0x1d6>
    <6d0>   DW_AT_data_member_location: 0
 <2><6d1>: Abbrev Number: 2 (DW_TAG_member)
    <6d2>   DW_AT_name        : (indirect string, offset: 0xe8b21): SYSCLKSource
    <6d6>   DW_AT_decl_file   : 10
    <6d6>   DW_AT_decl_line   : 130
    <6d7>   DW_AT_decl_column : 12
    <6d7>   DW_AT_type        : <0x1d6>
    <6db>   DW_AT_data_member_location: 4
 <2><6dc>: Abbrev Number: 2 (DW_TAG_member)
    <6dd>   DW_AT_name        : (indirect string, offset: 0xe8c08): AHBCLKDivider
    <6e1>   DW_AT_decl_file   : 10
    <6e1>   DW_AT_decl_line   : 133
    <6e2>   DW_AT_decl_column : 12
    <6e2>   DW_AT_type        : <0x1d6>
    <6e6>   DW_AT_data_member_location: 8
 <2><6e7>: Abbrev Number: 2 (DW_TAG_member)
    <6e8>   DW_AT_name        : (indirect string, offset: 0xe8927): APB1CLKDivider
    <6ec>   DW_AT_decl_file   : 10
    <6ec>   DW_AT_decl_line   : 136
    <6ed>   DW_AT_decl_column : 12
    <6ed>   DW_AT_type        : <0x1d6>
    <6f1>   DW_AT_data_member_location: 12
 <2><6f2>: Abbrev Number: 2 (DW_TAG_member)
    <6f3>   DW_AT_name        : (indirect string, offset: 0xe8a73): APB2CLKDivider
    <6f7>   DW_AT_decl_file   : 10
    <6f7>   DW_AT_decl_line   : 139
    <6f8>   DW_AT_decl_column : 12
    <6f8>   DW_AT_type        : <0x1d6>
    <6fc>   DW_AT_data_member_location: 16
 <2><6fd>: Abbrev Number: 0
 <1><6fe>: Abbrev Number: 3 (DW_TAG_typedef)
    <6ff>   DW_AT_name        : (indirect string, offset: 0xe89e0): RCC_ClkInitTypeDef
    <703>   DW_AT_decl_file   : 10
    <704>   DW_AT_decl_line   : 142
    <705>   DW_AT_decl_column : 2
    <706>   DW_AT_type        : <0x6bf>
 <1><70a>: Abbrev Number: 7 (DW_TAG_const_type)
    <70b>   DW_AT_type        : <0x6fe>
 <1><70f>: Abbrev Number: 16 (DW_TAG_array_type)
    <710>   DW_AT_type        : <0x1d1>
    <714>   DW_AT_sibling     : <0x71f>
 <2><718>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <719>   DW_AT_type        : <0x15b>
    <71d>   DW_AT_upper_bound : 6
 <2><71e>: Abbrev Number: 0
 <1><71f>: Abbrev Number: 7 (DW_TAG_const_type)
    <720>   DW_AT_type        : <0x70f>
 <1><724>: Abbrev Number: 9 (DW_TAG_variable)
    <725>   DW_AT_name        : (indirect string, offset: 0x2d6ad): CHANNEL_OFFSET_TAB
    <729>   DW_AT_decl_file   : 12
    <72a>   DW_AT_decl_line   : 49
    <72b>   DW_AT_decl_column : 22
    <72c>   DW_AT_type        : <0x71f>
    <730>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><736>: Abbrev Number: 27 (DW_TAG_variable)
    <737>   DW_AT_name        : (indirect string, offset: 0xe8c01): tmpreg
    <73b>   DW_AT_decl_file   : 1
    <73c>   DW_AT_decl_line   : 17
    <73d>   DW_AT_decl_column : 19
    <73e>   DW_AT_type        : <0x1e2>
    <742>   DW_AT_external    : 1
    <742>   DW_AT_location    : 5 byte block: 3 34 0 0 20 	(DW_OP_addr: 20000034)
 <1><748>: Abbrev Number: 11 (DW_TAG_subprogram)
    <749>   DW_AT_external    : 1
    <749>   DW_AT_name        : (indirect string, offset: 0xe8c25): HAL_RCC_ClockConfig
    <74d>   DW_AT_decl_file   : 10
    <74e>   DW_AT_decl_line   : 4837
    <750>   DW_AT_decl_column : 19
    <751>   DW_AT_prototyped  : 1
    <751>   DW_AT_type        : <0x5c3>
    <755>   DW_AT_declaration : 1
    <755>   DW_AT_sibling     : <0x764>
 <2><759>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <75a>   DW_AT_type        : <0x764>
 <2><75e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <75f>   DW_AT_type        : <0x1d6>
 <2><763>: Abbrev Number: 0
 <1><764>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <765>   DW_AT_byte_size   : 4
    <765>   DW_AT_type        : <0x70a>
 <1><769>: Abbrev Number: 11 (DW_TAG_subprogram)
    <76a>   DW_AT_external    : 1
    <76a>   DW_AT_name        : (indirect string, offset: 0xe8b8f): HAL_RCC_OscConfig
    <76e>   DW_AT_decl_file   : 10
    <76f>   DW_AT_decl_line   : 4836
    <771>   DW_AT_decl_column : 19
    <772>   DW_AT_prototyped  : 1
    <772>   DW_AT_type        : <0x5c3>
    <776>   DW_AT_declaration : 1
    <776>   DW_AT_sibling     : <0x780>
 <2><77a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <77b>   DW_AT_type        : <0x780>
 <2><77f>: Abbrev Number: 0
 <1><780>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <781>   DW_AT_byte_size   : 4
    <781>   DW_AT_type        : <0x6b3>
 <1><785>: Abbrev Number: 11 (DW_TAG_subprogram)
    <786>   DW_AT_external    : 1
    <786>   DW_AT_name        : (indirect string, offset: 0xe8936): HAL_PWREx_ControlVoltageScaling
    <78a>   DW_AT_decl_file   : 11
    <78b>   DW_AT_decl_line   : 837
    <78d>   DW_AT_decl_column : 19
    <78e>   DW_AT_prototyped  : 1
    <78e>   DW_AT_type        : <0x5c3>
    <792>   DW_AT_declaration : 1
    <792>   DW_AT_sibling     : <0x79c>
 <2><796>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <797>   DW_AT_type        : <0x1d6>
 <2><79b>: Abbrev Number: 0
 <1><79c>: Abbrev Number: 11 (DW_TAG_subprogram)
    <79d>   DW_AT_external    : 1
    <79d>   DW_AT_name        : (indirect string, offset: 0xe8b15): xTaskCreate
    <7a1>   DW_AT_decl_file   : 7
    <7a2>   DW_AT_decl_line   : 385
    <7a4>   DW_AT_decl_column : 16
    <7a5>   DW_AT_prototyped  : 1
    <7a5>   DW_AT_type        : <0x227>
    <7a9>   DW_AT_declaration : 1
    <7a9>   DW_AT_sibling     : <0x7cc>
 <2><7ad>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <7ae>   DW_AT_type        : <0x1f3>
 <2><7b2>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <7b3>   DW_AT_type        : <0x26b>
 <2><7b7>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <7b8>   DW_AT_type        : <0x222>
 <2><7bc>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <7bd>   DW_AT_type        : <0x211>
 <2><7c1>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <7c2>   DW_AT_type        : <0x233>
 <2><7c6>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <7c7>   DW_AT_type        : <0x7d1>
 <2><7cb>: Abbrev Number: 0
 <1><7cc>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <7cd>   DW_AT_byte_size   : 4
    <7cd>   DW_AT_type        : <0x250>
 <1><7d1>: Abbrev Number: 7 (DW_TAG_const_type)
    <7d2>   DW_AT_type        : <0x7cc>
 <1><7d6>: Abbrev Number: 28 (DW_TAG_subprogram)
    <7d7>   DW_AT_external    : 1
    <7d7>   DW_AT_name        : (indirect string, offset: 0xe8af6): vTaskDelay
    <7db>   DW_AT_decl_file   : 7
    <7dc>   DW_AT_decl_line   : 859
    <7de>   DW_AT_decl_column : 6
    <7df>   DW_AT_prototyped  : 1
    <7df>   DW_AT_declaration : 1
    <7df>   DW_AT_sibling     : <0x7e9>
 <2><7e3>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <7e4>   DW_AT_type        : <0x24b>
 <2><7e8>: Abbrev Number: 0
 <1><7e9>: Abbrev Number: 29 (DW_TAG_subprogram)
    <7ea>   DW_AT_external    : 1
    <7ea>   DW_AT_name        : (indirect string, offset: 0xe8ae2): vTaskStartScheduler
    <7ee>   DW_AT_decl_file   : 7
    <7ef>   DW_AT_decl_line   : 1520
    <7f1>   DW_AT_decl_column : 6
    <7f2>   DW_AT_prototyped  : 1
    <7f2>   DW_AT_declaration : 1
 <1><7f2>: Abbrev Number: 30 (DW_TAG_subprogram)
    <7f3>   DW_AT_external    : 1
    <7f3>   DW_AT_name        : (indirect string, offset: 0xe8c99): HAL_Init
    <7f7>   DW_AT_decl_file   : 13
    <7f8>   DW_AT_decl_line   : 636
    <7fa>   DW_AT_decl_column : 19
    <7fb>   DW_AT_prototyped  : 1
    <7fb>   DW_AT_type        : <0x5c3>
    <7ff>   DW_AT_declaration : 1
 <1><7ff>: Abbrev Number: 31 (DW_TAG_subprogram)
    <800>   DW_AT_external    : 1
    <800>   DW_AT_name        : (indirect string, offset: 0xe8a54): Error_Handler
    <804>   DW_AT_decl_file   : 1
    <805>   DW_AT_decl_line   : 144
    <806>   DW_AT_decl_column : 6
    <807>   DW_AT_prototyped  : 1
    <807>   DW_AT_low_pc      : 0x8000854
    <80b>   DW_AT_high_pc     : 0xc
    <80f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <811>   DW_AT_call_all_calls: 1
    <811>   DW_AT_sibling     : <0x826>
 <2><815>: Abbrev Number: 32 (DW_TAG_inlined_subroutine)
    <816>   DW_AT_abstract_origin: <0x8f2>
    <81a>   DW_AT_low_pc      : 0x8000858
    <81e>   DW_AT_high_pc     : 0x4
    <822>   DW_AT_call_file   : 1
    <823>   DW_AT_call_line   : 146
    <824>   DW_AT_call_column : 3
 <2><825>: Abbrev Number: 0
 <1><826>: Abbrev Number: 18 (DW_TAG_subprogram)
    <827>   DW_AT_external    : 1
    <827>   DW_AT_name        : (indirect string, offset: 0xe8c5a): SystemClock_Config
    <82b>   DW_AT_decl_file   : 1
    <82b>   DW_AT_decl_line   : 103
    <82c>   DW_AT_decl_column : 6
    <82c>   DW_AT_prototyped  : 1
    <82c>   DW_AT_low_pc      : 0x80007b0
    <830>   DW_AT_high_pc     : 0xa4
    <834>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <836>   DW_AT_call_all_tail_calls: 1
    <836>   DW_AT_sibling     : <0x85b>
 <2><83a>: Abbrev Number: 9 (DW_TAG_variable)
    <83b>   DW_AT_name        : (indirect string, offset: 0xe897d): RCC_OscInitStruct
    <83f>   DW_AT_decl_file   : 1
    <840>   DW_AT_decl_line   : 105
    <841>   DW_AT_decl_column : 22
    <842>   DW_AT_type        : <0x6b3>
    <846>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><84a>: Abbrev Number: 9 (DW_TAG_variable)
    <84b>   DW_AT_name        : (indirect string, offset: 0xe8a2b): RCC_ClkInitStruct
    <84f>   DW_AT_decl_file   : 1
    <850>   DW_AT_decl_line   : 106
    <851>   DW_AT_decl_column : 22
    <852>   DW_AT_type        : <0x6fe>
    <856>   DW_AT_location    : 3 byte block: 91 a0 7f 	(DW_OP_fbreg: -96)
 <2><85a>: Abbrev Number: 0
 <1><85b>: Abbrev Number: 19 (DW_TAG_subprogram)
    <85c>   DW_AT_external    : 1
    <85c>   DW_AT_name        : (indirect string, offset: 0xe8c8a): GPIOPortConfig
    <860>   DW_AT_decl_file   : 1
    <860>   DW_AT_decl_line   : 84
    <861>   DW_AT_decl_column : 6
    <861>   DW_AT_prototyped  : 1
    <861>   DW_AT_low_pc      : 0x80006f0
    <865>   DW_AT_high_pc     : 0xc0
    <869>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <86b>   DW_AT_call_all_calls: 1
 <1><86b>: Abbrev Number: 19 (DW_TAG_subprogram)
    <86c>   DW_AT_external    : 1
    <86c>   DW_AT_name        : (indirect string, offset: 0xe88b0): I2CConfig
    <870>   DW_AT_decl_file   : 1
    <870>   DW_AT_decl_line   : 52
    <871>   DW_AT_decl_column : 6
    <871>   DW_AT_prototyped  : 1
    <871>   DW_AT_low_pc      : 0x8000660
    <875>   DW_AT_high_pc     : 0x90
    <879>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <87b>   DW_AT_call_all_calls: 1
 <1><87b>: Abbrev Number: 33 (DW_TAG_subprogram)
    <87c>   DW_AT_name        : (indirect string, offset: 0xe8994): prvCreateTasks
    <880>   DW_AT_decl_file   : 1
    <881>   DW_AT_decl_line   : 47
    <882>   DW_AT_decl_column : 13
    <883>   DW_AT_prototyped  : 1
    <883>   DW_AT_low_pc      : 0x8000634
    <887>   DW_AT_high_pc     : 0x2c
    <88b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <88d>   DW_AT_call_all_tail_calls: 1
    <88d>   DW_AT_sibling     : <0x8a4>
 <2><891>: Abbrev Number: 9 (DW_TAG_variable)
    <892>   DW_AT_name        : (indirect string, offset: 0xe8d11): rate
    <896>   DW_AT_decl_file   : 1
    <897>   DW_AT_decl_line   : 48
    <898>   DW_AT_decl_column : 18
    <899>   DW_AT_type        : <0x1d6>
    <89d>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <2><8a3>: Abbrev Number: 0
 <1><8a4>: Abbrev Number: 18 (DW_TAG_subprogram)
    <8a5>   DW_AT_external    : 1
    <8a5>   DW_AT_name        : (indirect string, offset: 0xe8b2e): vHeartbeat
    <8a9>   DW_AT_decl_file   : 1
    <8a9>   DW_AT_decl_line   : 36
    <8aa>   DW_AT_decl_column : 6
    <8aa>   DW_AT_prototyped  : 1
    <8aa>   DW_AT_low_pc      : 0x80004f2
    <8ae>   DW_AT_high_pc     : 0x142
    <8b2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8b4>   DW_AT_call_all_tail_calls: 1
    <8b4>   DW_AT_sibling     : <0x8d7>
 <2><8b8>: Abbrev Number: 34 (DW_TAG_formal_parameter)
    <8b9>   DW_AT_name        : (indirect string, offset: 0xe88fc): pvParameters
    <8bd>   DW_AT_decl_file   : 1
    <8be>   DW_AT_decl_line   : 36
    <8bf>   DW_AT_decl_column : 23
    <8c0>   DW_AT_type        : <0x20f>
    <8c4>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><8c7>: Abbrev Number: 9 (DW_TAG_variable)
    <8c8>   DW_AT_name        : (indirect string, offset: 0xe8d11): rate
    <8cc>   DW_AT_decl_file   : 1
    <8cd>   DW_AT_decl_line   : 37
    <8ce>   DW_AT_decl_column : 12
    <8cf>   DW_AT_type        : <0x8d7>
    <8d3>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><8d6>: Abbrev Number: 0
 <1><8d7>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <8d8>   DW_AT_byte_size   : 4
    <8d8>   DW_AT_type        : <0x1d6>
 <1><8dc>: Abbrev Number: 35 (DW_TAG_subprogram)
    <8dd>   DW_AT_external    : 1
    <8dd>   DW_AT_name        : (indirect string, offset: 0xe8911): main
    <8e1>   DW_AT_decl_file   : 1
    <8e2>   DW_AT_decl_line   : 19
    <8e3>   DW_AT_decl_column : 5
    <8e4>   DW_AT_prototyped  : 1
    <8e4>   DW_AT_type        : <0x154>
    <8e8>   DW_AT_low_pc      : 0x80004d2
    <8ec>   DW_AT_high_pc     : 0x20
    <8f0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8f2>   DW_AT_call_all_tail_calls: 1
 <1><8f2>: Abbrev Number: 36 (DW_TAG_subprogram)
    <8f3>   DW_AT_name        : (indirect string, offset: 0xe8ace): __disable_irq
    <8f7>   DW_AT_decl_file   : 2
    <8f8>   DW_AT_decl_line   : 207
    <8f9>   DW_AT_decl_column : 27
    <8fa>   DW_AT_prototyped  : 1
    <8fa>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><8fb>: Abbrev Number: 0
  Compilation Unit @ offset 0x8fc:
   Length:        0x2fd (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x322
   Pointer Size:  4
 <0><908>: Abbrev Number: 7 (DW_TAG_compile_unit)
    <909>   DW_AT_producer    : (indirect string, offset: 0x3c767): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <90d>   DW_AT_language    : 29	(C11)
    <90e>   DW_AT_name        : (indirect string, offset: 0xe8d22): ../Core/Src/stm32l4xx_hal_msp.c
    <912>   DW_AT_comp_dir    : (indirect string, offset: 0x7fb10): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <916>   DW_AT_ranges      : 0x60
    <91a>   DW_AT_low_pc      : 0
    <91e>   DW_AT_stmt_list   : 0x1126
    <922>   DW_AT_macros      : 0x2508c
 <1><926>: Abbrev Number: 2 (DW_TAG_base_type)
    <927>   DW_AT_byte_size   : 1
    <928>   DW_AT_encoding    : 6	(signed char)
    <929>   DW_AT_name        : (indirect string, offset: 0x751ec): signed char
 <1><92d>: Abbrev Number: 3 (DW_TAG_typedef)
    <92e>   DW_AT_name        : (indirect string, offset: 0x4354d): __uint8_t
    <932>   DW_AT_decl_file   : 2
    <933>   DW_AT_decl_line   : 43
    <934>   DW_AT_decl_column : 24
    <935>   DW_AT_type        : <0x939>
 <1><939>: Abbrev Number: 2 (DW_TAG_base_type)
    <93a>   DW_AT_byte_size   : 1
    <93b>   DW_AT_encoding    : 8	(unsigned char)
    <93c>   DW_AT_name        : (indirect string, offset: 0xdfda1): unsigned char
 <1><940>: Abbrev Number: 2 (DW_TAG_base_type)
    <941>   DW_AT_byte_size   : 2
    <942>   DW_AT_encoding    : 5	(signed)
    <943>   DW_AT_name        : (indirect string, offset: 0xac250): short int
 <1><947>: Abbrev Number: 2 (DW_TAG_base_type)
    <948>   DW_AT_byte_size   : 2
    <949>   DW_AT_encoding    : 7	(unsigned)
    <94a>   DW_AT_name        : (indirect string, offset: 0xde34b): short unsigned int
 <1><94e>: Abbrev Number: 2 (DW_TAG_base_type)
    <94f>   DW_AT_byte_size   : 4
    <950>   DW_AT_encoding    : 5	(signed)
    <951>   DW_AT_name        : (indirect string, offset: 0x135b8): long int
 <1><955>: Abbrev Number: 3 (DW_TAG_typedef)
    <956>   DW_AT_name        : (indirect string, offset: 0xe8b56): __uint32_t
    <95a>   DW_AT_decl_file   : 2
    <95b>   DW_AT_decl_line   : 79
    <95c>   DW_AT_decl_column : 25
    <95d>   DW_AT_type        : <0x961>
 <1><961>: Abbrev Number: 2 (DW_TAG_base_type)
    <962>   DW_AT_byte_size   : 4
    <963>   DW_AT_encoding    : 7	(unsigned)
    <964>   DW_AT_name        : (indirect string, offset: 0x58285): long unsigned int
 <1><968>: Abbrev Number: 2 (DW_TAG_base_type)
    <969>   DW_AT_byte_size   : 8
    <96a>   DW_AT_encoding    : 5	(signed)
    <96b>   DW_AT_name        : (indirect string, offset: 0x69985): long long int
 <1><96f>: Abbrev Number: 2 (DW_TAG_base_type)
    <970>   DW_AT_byte_size   : 8
    <971>   DW_AT_encoding    : 7	(unsigned)
    <972>   DW_AT_name        : (indirect string, offset: 0x3004c): long long unsigned int
 <1><976>: Abbrev Number: 8 (DW_TAG_base_type)
    <977>   DW_AT_byte_size   : 4
    <978>   DW_AT_encoding    : 5	(signed)
    <979>   DW_AT_name        : int
 <1><97d>: Abbrev Number: 2 (DW_TAG_base_type)
    <97e>   DW_AT_byte_size   : 4
    <97f>   DW_AT_encoding    : 7	(unsigned)
    <980>   DW_AT_name        : (indirect string, offset: 0x12ac1): unsigned int
 <1><984>: Abbrev Number: 3 (DW_TAG_typedef)
    <985>   DW_AT_name        : (indirect string, offset: 0x4354f): uint8_t
    <989>   DW_AT_decl_file   : 3
    <98a>   DW_AT_decl_line   : 24
    <98b>   DW_AT_decl_column : 19
    <98c>   DW_AT_type        : <0x92d>
 <1><990>: Abbrev Number: 5 (DW_TAG_const_type)
    <991>   DW_AT_type        : <0x984>
 <1><995>: Abbrev Number: 3 (DW_TAG_typedef)
    <996>   DW_AT_name        : (indirect string, offset: 0xa82d1): uint32_t
    <99a>   DW_AT_decl_file   : 3
    <99b>   DW_AT_decl_line   : 48
    <99c>   DW_AT_decl_column : 20
    <99d>   DW_AT_type        : <0x955>
 <1><9a1>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <9a2>   DW_AT_type        : <0x995>
 <1><9a6>: Abbrev Number: 10 (DW_TAG_structure_type)
    <9a7>   DW_AT_byte_size   : 152
    <9a8>   DW_AT_decl_file   : 4
    <9a9>   DW_AT_decl_line   : 685
    <9ab>   DW_AT_decl_column : 9
    <9ac>   DW_AT_sibling     : <0xb78>
 <2><9b0>: Abbrev Number: 6 (DW_TAG_member)
    <9b1>   DW_AT_name        : CR
    <9b4>   DW_AT_decl_file   : 4
    <9b4>   DW_AT_decl_line   : 687
    <9b6>   DW_AT_decl_column : 17
    <9b6>   DW_AT_type        : <0x9a1>
    <9ba>   DW_AT_data_member_location: 0
 <2><9bb>: Abbrev Number: 1 (DW_TAG_member)
    <9bc>   DW_AT_name        : (indirect string, offset: 0xe8adc): ICSCR
    <9c0>   DW_AT_decl_file   : 4
    <9c0>   DW_AT_decl_line   : 688
    <9c2>   DW_AT_decl_column : 17
    <9c2>   DW_AT_type        : <0x9a1>
    <9c6>   DW_AT_data_member_location: 4
 <2><9c7>: Abbrev Number: 1 (DW_TAG_member)
    <9c8>   DW_AT_name        : (indirect string, offset: 0xe8a03): CFGR
    <9cc>   DW_AT_decl_file   : 4
    <9cc>   DW_AT_decl_line   : 689
    <9ce>   DW_AT_decl_column : 17
    <9ce>   DW_AT_type        : <0x9a1>
    <9d2>   DW_AT_data_member_location: 8
 <2><9d3>: Abbrev Number: 1 (DW_TAG_member)
    <9d4>   DW_AT_name        : (indirect string, offset: 0xe8bab): PLLCFGR
    <9d8>   DW_AT_decl_file   : 4
    <9d8>   DW_AT_decl_line   : 690
    <9da>   DW_AT_decl_column : 17
    <9da>   DW_AT_type        : <0x9a1>
    <9de>   DW_AT_data_member_location: 12
 <2><9df>: Abbrev Number: 1 (DW_TAG_member)
    <9e0>   DW_AT_name        : (indirect string, offset: 0xe89fc): PLLSAI1CFGR
    <9e4>   DW_AT_decl_file   : 4
    <9e4>   DW_AT_decl_line   : 691
    <9e6>   DW_AT_decl_column : 17
    <9e6>   DW_AT_type        : <0x9a1>
    <9ea>   DW_AT_data_member_location: 16
 <2><9eb>: Abbrev Number: 1 (DW_TAG_member)
    <9ec>   DW_AT_name        : (indirect string, offset: 0xe8b6c): PLLSAI2CFGR
    <9f0>   DW_AT_decl_file   : 4
    <9f0>   DW_AT_decl_line   : 692
    <9f2>   DW_AT_decl_column : 17
    <9f2>   DW_AT_type        : <0x9a1>
    <9f6>   DW_AT_data_member_location: 20
 <2><9f7>: Abbrev Number: 1 (DW_TAG_member)
    <9f8>   DW_AT_name        : (indirect string, offset: 0xe88cf): CIER
    <9fc>   DW_AT_decl_file   : 4
    <9fc>   DW_AT_decl_line   : 693
    <9fe>   DW_AT_decl_column : 17
    <9fe>   DW_AT_type        : <0x9a1>
    <a02>   DW_AT_data_member_location: 24
 <2><a03>: Abbrev Number: 1 (DW_TAG_member)
    <a04>   DW_AT_name        : (indirect string, offset: 0xe88ca): CIFR
    <a08>   DW_AT_decl_file   : 4
    <a08>   DW_AT_decl_line   : 694
    <a0a>   DW_AT_decl_column : 17
    <a0a>   DW_AT_type        : <0x9a1>
    <a0e>   DW_AT_data_member_location: 28
 <2><a0f>: Abbrev Number: 1 (DW_TAG_member)
    <a10>   DW_AT_name        : (indirect string, offset: 0xe88c0): CICR
    <a14>   DW_AT_decl_file   : 4
    <a14>   DW_AT_decl_line   : 695
    <a16>   DW_AT_decl_column : 17
    <a16>   DW_AT_type        : <0x9a1>
    <a1a>   DW_AT_data_member_location: 32
 <2><a1b>: Abbrev Number: 1 (DW_TAG_member)
    <a1c>   DW_AT_name        : (indirect string, offset: 0xe8ca2): RESERVED0
    <a20>   DW_AT_decl_file   : 4
    <a20>   DW_AT_decl_line   : 696
    <a22>   DW_AT_decl_column : 17
    <a22>   DW_AT_type        : <0x995>
    <a26>   DW_AT_data_member_location: 36
 <2><a27>: Abbrev Number: 1 (DW_TAG_member)
    <a28>   DW_AT_name        : (indirect string, offset: 0xe8bdb): AHB1RSTR
    <a2c>   DW_AT_decl_file   : 4
    <a2c>   DW_AT_decl_line   : 697
    <a2e>   DW_AT_decl_column : 17
    <a2e>   DW_AT_type        : <0x9a1>
    <a32>   DW_AT_data_member_location: 40
 <2><a33>: Abbrev Number: 1 (DW_TAG_member)
    <a34>   DW_AT_name        : (indirect string, offset: 0xe8916): AHB2RSTR
    <a38>   DW_AT_decl_file   : 4
    <a38>   DW_AT_decl_line   : 698
    <a3a>   DW_AT_decl_column : 17
    <a3a>   DW_AT_type        : <0x9a1>
    <a3e>   DW_AT_data_member_location: 44
 <2><a3f>: Abbrev Number: 1 (DW_TAG_member)
    <a40>   DW_AT_name        : (indirect string, offset: 0xe89f3): AHB3RSTR
    <a44>   DW_AT_decl_file   : 4
    <a44>   DW_AT_decl_line   : 699
    <a46>   DW_AT_decl_column : 17
    <a46>   DW_AT_type        : <0x9a1>
    <a4a>   DW_AT_data_member_location: 48
 <2><a4b>: Abbrev Number: 1 (DW_TAG_member)
    <a4c>   DW_AT_name        : (indirect string, offset: 0xe8cac): RESERVED1
    <a50>   DW_AT_decl_file   : 4
    <a50>   DW_AT_decl_line   : 700
    <a52>   DW_AT_decl_column : 17
    <a52>   DW_AT_type        : <0x995>
    <a56>   DW_AT_data_member_location: 52
 <2><a57>: Abbrev Number: 1 (DW_TAG_member)
    <a58>   DW_AT_name        : (indirect string, offset: 0xe8969): APB1RSTR1
    <a5c>   DW_AT_decl_file   : 4
    <a5c>   DW_AT_decl_line   : 701
    <a5e>   DW_AT_decl_column : 17
    <a5e>   DW_AT_type        : <0x9a1>
    <a62>   DW_AT_data_member_location: 56
 <2><a63>: Abbrev Number: 1 (DW_TAG_member)
    <a64>   DW_AT_name        : (indirect string, offset: 0xe8973): APB1RSTR2
    <a68>   DW_AT_decl_file   : 4
    <a68>   DW_AT_decl_line   : 702
    <a6a>   DW_AT_decl_column : 17
    <a6a>   DW_AT_type        : <0x9a1>
    <a6e>   DW_AT_data_member_location: 60
 <2><a6f>: Abbrev Number: 1 (DW_TAG_member)
    <a70>   DW_AT_name        : (indirect string, offset: 0xe8a4b): APB2RSTR
    <a74>   DW_AT_decl_file   : 4
    <a74>   DW_AT_decl_line   : 703
    <a76>   DW_AT_decl_column : 17
    <a76>   DW_AT_type        : <0x9a1>
    <a7a>   DW_AT_data_member_location: 64
 <2><a7b>: Abbrev Number: 1 (DW_TAG_member)
    <a7c>   DW_AT_name        : (indirect string, offset: 0xe8cb6): RESERVED2
    <a80>   DW_AT_decl_file   : 4
    <a80>   DW_AT_decl_line   : 704
    <a82>   DW_AT_decl_column : 17
    <a82>   DW_AT_type        : <0x995>
    <a86>   DW_AT_data_member_location: 68
 <2><a87>: Abbrev Number: 1 (DW_TAG_member)
    <a88>   DW_AT_name        : (indirect string, offset: 0xe8909): AHB1ENR
    <a8c>   DW_AT_decl_file   : 4
    <a8c>   DW_AT_decl_line   : 705
    <a8e>   DW_AT_decl_column : 17
    <a8e>   DW_AT_type        : <0x9a1>
    <a92>   DW_AT_data_member_location: 72
 <2><a93>: Abbrev Number: 1 (DW_TAG_member)
    <a94>   DW_AT_name        : (indirect string, offset: 0xe89a8): AHB2ENR
    <a98>   DW_AT_decl_file   : 4
    <a98>   DW_AT_decl_line   : 706
    <a9a>   DW_AT_decl_column : 17
    <a9a>   DW_AT_type        : <0x9a1>
    <a9e>   DW_AT_data_member_location: 76
 <2><a9f>: Abbrev Number: 1 (DW_TAG_member)
    <aa0>   DW_AT_name        : (indirect string, offset: 0xe8a6b): AHB3ENR
    <aa4>   DW_AT_decl_file   : 4
    <aa4>   DW_AT_decl_line   : 707
    <aa6>   DW_AT_decl_column : 17
    <aa6>   DW_AT_type        : <0x9a1>
    <aaa>   DW_AT_data_member_location: 80
 <2><aab>: Abbrev Number: 1 (DW_TAG_member)
    <aac>   DW_AT_name        : (indirect string, offset: 0xe8cc0): RESERVED3
    <ab0>   DW_AT_decl_file   : 4
    <ab0>   DW_AT_decl_line   : 708
    <ab2>   DW_AT_decl_column : 17
    <ab2>   DW_AT_type        : <0x995>
    <ab6>   DW_AT_data_member_location: 84
 <2><ab7>: Abbrev Number: 1 (DW_TAG_member)
    <ab8>   DW_AT_name        : (indirect string, offset: 0xe88d4): APB1ENR1
    <abc>   DW_AT_decl_file   : 4
    <abc>   DW_AT_decl_line   : 709
    <abe>   DW_AT_decl_column : 17
    <abe>   DW_AT_type        : <0x9a1>
    <ac2>   DW_AT_data_member_location: 88
 <2><ac3>: Abbrev Number: 1 (DW_TAG_member)
    <ac4>   DW_AT_name        : (indirect string, offset: 0xe88dd): APB1ENR2
    <ac8>   DW_AT_decl_file   : 4
    <ac8>   DW_AT_decl_line   : 710
    <aca>   DW_AT_decl_column : 17
    <aca>   DW_AT_type        : <0x9a1>
    <ace>   DW_AT_data_member_location: 92
 <2><acf>: Abbrev Number: 1 (DW_TAG_member)
    <ad0>   DW_AT_name        : (indirect string, offset: 0xe891f): APB2ENR
    <ad4>   DW_AT_decl_file   : 4
    <ad4>   DW_AT_decl_line   : 711
    <ad6>   DW_AT_decl_column : 17
    <ad6>   DW_AT_type        : <0x9a1>
    <ada>   DW_AT_data_member_location: 96
 <2><adb>: Abbrev Number: 1 (DW_TAG_member)
    <adc>   DW_AT_name        : (indirect string, offset: 0xe8b01): RESERVED4
    <ae0>   DW_AT_decl_file   : 4
    <ae0>   DW_AT_decl_line   : 712
    <ae2>   DW_AT_decl_column : 17
    <ae2>   DW_AT_type        : <0x995>
    <ae6>   DW_AT_data_member_location: 100
 <2><ae7>: Abbrev Number: 1 (DW_TAG_member)
    <ae8>   DW_AT_name        : (indirect string, offset: 0xe8a82): AHB1SMENR
    <aec>   DW_AT_decl_file   : 4
    <aec>   DW_AT_decl_line   : 713
    <aee>   DW_AT_decl_column : 17
    <aee>   DW_AT_type        : <0x9a1>
    <af2>   DW_AT_data_member_location: 104
 <2><af3>: Abbrev Number: 1 (DW_TAG_member)
    <af4>   DW_AT_name        : (indirect string, offset: 0xe8c80): AHB2SMENR
    <af8>   DW_AT_decl_file   : 4
    <af8>   DW_AT_decl_line   : 714
    <afa>   DW_AT_decl_column : 17
    <afa>   DW_AT_type        : <0x9a1>
    <afe>   DW_AT_data_member_location: 108
 <2><aff>: Abbrev Number: 1 (DW_TAG_member)
    <b00>   DW_AT_name        : (indirect string, offset: 0xe8a21): AHB3SMENR
    <b04>   DW_AT_decl_file   : 4
    <b04>   DW_AT_decl_line   : 715
    <b06>   DW_AT_decl_column : 17
    <b06>   DW_AT_type        : <0x9a1>
    <b0a>   DW_AT_data_member_location: 112
 <2><b0b>: Abbrev Number: 1 (DW_TAG_member)
    <b0c>   DW_AT_name        : (indirect string, offset: 0xe8cca): RESERVED5
    <b10>   DW_AT_decl_file   : 4
    <b10>   DW_AT_decl_line   : 716
    <b12>   DW_AT_decl_column : 17
    <b12>   DW_AT_type        : <0x995>
    <b16>   DW_AT_data_member_location: 116
 <2><b17>: Abbrev Number: 1 (DW_TAG_member)
    <b18>   DW_AT_name        : (indirect string, offset: 0xe88e6): APB1SMENR1
    <b1c>   DW_AT_decl_file   : 4
    <b1c>   DW_AT_decl_line   : 717
    <b1e>   DW_AT_decl_column : 17
    <b1e>   DW_AT_type        : <0x9a1>
    <b22>   DW_AT_data_member_location: 120
 <2><b23>: Abbrev Number: 1 (DW_TAG_member)
    <b24>   DW_AT_name        : (indirect string, offset: 0xe88f1): APB1SMENR2
    <b28>   DW_AT_decl_file   : 4
    <b28>   DW_AT_decl_line   : 718
    <b2a>   DW_AT_decl_column : 17
    <b2a>   DW_AT_type        : <0x9a1>
    <b2e>   DW_AT_data_member_location: 124
 <2><b2f>: Abbrev Number: 1 (DW_TAG_member)
    <b30>   DW_AT_name        : (indirect string, offset: 0xe8bbe): APB2SMENR
    <b34>   DW_AT_decl_file   : 4
    <b34>   DW_AT_decl_line   : 719
    <b36>   DW_AT_decl_column : 17
    <b36>   DW_AT_type        : <0x9a1>
    <b3a>   DW_AT_data_member_location: 128
 <2><b3b>: Abbrev Number: 1 (DW_TAG_member)
    <b3c>   DW_AT_name        : (indirect string, offset: 0xe8b0b): RESERVED6
    <b40>   DW_AT_decl_file   : 4
    <b40>   DW_AT_decl_line   : 720
    <b42>   DW_AT_decl_column : 17
    <b42>   DW_AT_type        : <0x995>
    <b46>   DW_AT_data_member_location: 132
 <2><b47>: Abbrev Number: 1 (DW_TAG_member)
    <b48>   DW_AT_name        : (indirect string, offset: 0xe89d0): CCIPR
    <b4c>   DW_AT_decl_file   : 4
    <b4c>   DW_AT_decl_line   : 721
    <b4e>   DW_AT_decl_column : 17
    <b4e>   DW_AT_type        : <0x9a1>
    <b52>   DW_AT_data_member_location: 136
 <2><b53>: Abbrev Number: 1 (DW_TAG_member)
    <b54>   DW_AT_name        : (indirect string, offset: 0xe8cd4): RESERVED7
    <b58>   DW_AT_decl_file   : 4
    <b58>   DW_AT_decl_line   : 722
    <b5a>   DW_AT_decl_column : 17
    <b5a>   DW_AT_type        : <0x995>
    <b5e>   DW_AT_data_member_location: 140
 <2><b5f>: Abbrev Number: 1 (DW_TAG_member)
    <b60>   DW_AT_name        : (indirect string, offset: 0xe89a3): BDCR
    <b64>   DW_AT_decl_file   : 4
    <b64>   DW_AT_decl_line   : 723
    <b66>   DW_AT_decl_column : 17
    <b66>   DW_AT_type        : <0x9a1>
    <b6a>   DW_AT_data_member_location: 144
 <2><b6b>: Abbrev Number: 6 (DW_TAG_member)
    <b6c>   DW_AT_name        : CSR
    <b70>   DW_AT_decl_file   : 4
    <b70>   DW_AT_decl_line   : 724
    <b72>   DW_AT_decl_column : 17
    <b72>   DW_AT_type        : <0x9a1>
    <b76>   DW_AT_data_member_location: 148
 <2><b77>: Abbrev Number: 0
 <1><b78>: Abbrev Number: 11 (DW_TAG_typedef)
    <b79>   DW_AT_name        : (indirect string, offset: 0xe8a97): RCC_TypeDef
    <b7d>   DW_AT_decl_file   : 4
    <b7e>   DW_AT_decl_line   : 725
    <b80>   DW_AT_decl_column : 3
    <b81>   DW_AT_type        : <0x9a6>
 <1><b85>: Abbrev Number: 2 (DW_TAG_base_type)
    <b86>   DW_AT_byte_size   : 8
    <b87>   DW_AT_encoding    : 4	(float)
    <b88>   DW_AT_name        : (indirect string, offset: 0xee423): long double
 <1><b8c>: Abbrev Number: 12 (DW_TAG_array_type)
    <b8d>   DW_AT_type        : <0x990>
    <b91>   DW_AT_sibling     : <0xb9c>
 <2><b95>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <b96>   DW_AT_type        : <0x97d>
    <b9a>   DW_AT_upper_bound : 6
 <2><b9b>: Abbrev Number: 0
 <1><b9c>: Abbrev Number: 5 (DW_TAG_const_type)
    <b9d>   DW_AT_type        : <0xb8c>
 <1><ba1>: Abbrev Number: 4 (DW_TAG_variable)
    <ba2>   DW_AT_name        : (indirect string, offset: 0x2d6ad): CHANNEL_OFFSET_TAB
    <ba6>   DW_AT_decl_file   : 5
    <ba7>   DW_AT_decl_line   : 49
    <ba8>   DW_AT_decl_column : 22
    <ba9>   DW_AT_type        : <0xb9c>
    <bad>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><bb3>: Abbrev Number: 14 (DW_TAG_subprogram)
    <bb4>   DW_AT_external    : 1
    <bb4>   DW_AT_name        : (indirect string, offset: 0xe8d16): HAL_MspInit
    <bb8>   DW_AT_decl_file   : 1
    <bb9>   DW_AT_decl_line   : 64
    <bba>   DW_AT_decl_column : 6
    <bbb>   DW_AT_prototyped  : 1
    <bbb>   DW_AT_low_pc      : 0x8000860
    <bbf>   DW_AT_high_pc     : 0x48
    <bc3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bc5>   DW_AT_call_all_calls: 1
 <2><bc5>: Abbrev Number: 15 (DW_TAG_lexical_block)
    <bc6>   DW_AT_low_pc      : 0x8000866
    <bca>   DW_AT_high_pc     : 0x18
    <bce>   DW_AT_sibling     : <0xbe2>
 <3><bd2>: Abbrev Number: 4 (DW_TAG_variable)
    <bd3>   DW_AT_name        : (indirect string, offset: 0xe8c01): tmpreg
    <bd7>   DW_AT_decl_file   : 1
    <bd8>   DW_AT_decl_line   : 71
    <bd9>   DW_AT_decl_column : 3
    <bda>   DW_AT_type        : <0x9a1>
    <bde>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><be1>: Abbrev Number: 0
 <2><be2>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <be3>   DW_AT_low_pc      : 0x800087e
    <be7>   DW_AT_high_pc     : 0x18
 <3><beb>: Abbrev Number: 4 (DW_TAG_variable)
    <bec>   DW_AT_name        : (indirect string, offset: 0xe8c01): tmpreg
    <bf0>   DW_AT_decl_file   : 1
    <bf1>   DW_AT_decl_line   : 72
    <bf2>   DW_AT_decl_column : 3
    <bf3>   DW_AT_type        : <0x9a1>
    <bf7>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><bfa>: Abbrev Number: 0
 <2><bfb>: Abbrev Number: 0
 <1><bfc>: Abbrev Number: 0
  Compilation Unit @ offset 0xbfd:
   Length:        0x118 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x3ff
   Pointer Size:  4
 <0><c09>: Abbrev Number: 5 (DW_TAG_compile_unit)
    <c0a>   DW_AT_producer    : (indirect string, offset: 0x3c767): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <c0e>   DW_AT_language    : 29	(C11)
    <c0f>   DW_AT_name        : (indirect string, offset: 0xe8d72): ../Core/Src/stm32l4xx_it.c
    <c13>   DW_AT_comp_dir    : (indirect string, offset: 0x7fb10): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <c17>   DW_AT_ranges      : 0x73
    <c1b>   DW_AT_low_pc      : 0
    <c1f>   DW_AT_stmt_list   : 0x1828
    <c23>   DW_AT_macros      : 0x2523d
 <1><c27>: Abbrev Number: 1 (DW_TAG_base_type)
    <c28>   DW_AT_byte_size   : 1
    <c29>   DW_AT_encoding    : 6	(signed char)
    <c2a>   DW_AT_name        : (indirect string, offset: 0x751ec): signed char
 <1><c2e>: Abbrev Number: 3 (DW_TAG_typedef)
    <c2f>   DW_AT_name        : (indirect string, offset: 0x4354d): __uint8_t
    <c33>   DW_AT_decl_file   : 2
    <c34>   DW_AT_decl_line   : 43
    <c35>   DW_AT_decl_column : 24
    <c36>   DW_AT_type        : <0xc3a>
 <1><c3a>: Abbrev Number: 1 (DW_TAG_base_type)
    <c3b>   DW_AT_byte_size   : 1
    <c3c>   DW_AT_encoding    : 8	(unsigned char)
    <c3d>   DW_AT_name        : (indirect string, offset: 0xdfda1): unsigned char
 <1><c41>: Abbrev Number: 1 (DW_TAG_base_type)
    <c42>   DW_AT_byte_size   : 2
    <c43>   DW_AT_encoding    : 5	(signed)
    <c44>   DW_AT_name        : (indirect string, offset: 0xac250): short int
 <1><c48>: Abbrev Number: 1 (DW_TAG_base_type)
    <c49>   DW_AT_byte_size   : 2
    <c4a>   DW_AT_encoding    : 7	(unsigned)
    <c4b>   DW_AT_name        : (indirect string, offset: 0xde34b): short unsigned int
 <1><c4f>: Abbrev Number: 1 (DW_TAG_base_type)
    <c50>   DW_AT_byte_size   : 4
    <c51>   DW_AT_encoding    : 5	(signed)
    <c52>   DW_AT_name        : (indirect string, offset: 0x135b8): long int
 <1><c56>: Abbrev Number: 1 (DW_TAG_base_type)
    <c57>   DW_AT_byte_size   : 4
    <c58>   DW_AT_encoding    : 7	(unsigned)
    <c59>   DW_AT_name        : (indirect string, offset: 0x58285): long unsigned int
 <1><c5d>: Abbrev Number: 1 (DW_TAG_base_type)
    <c5e>   DW_AT_byte_size   : 8
    <c5f>   DW_AT_encoding    : 5	(signed)
    <c60>   DW_AT_name        : (indirect string, offset: 0x69985): long long int
 <1><c64>: Abbrev Number: 1 (DW_TAG_base_type)
    <c65>   DW_AT_byte_size   : 8
    <c66>   DW_AT_encoding    : 7	(unsigned)
    <c67>   DW_AT_name        : (indirect string, offset: 0x3004c): long long unsigned int
 <1><c6b>: Abbrev Number: 6 (DW_TAG_base_type)
    <c6c>   DW_AT_byte_size   : 4
    <c6d>   DW_AT_encoding    : 5	(signed)
    <c6e>   DW_AT_name        : int
 <1><c72>: Abbrev Number: 1 (DW_TAG_base_type)
    <c73>   DW_AT_byte_size   : 4
    <c74>   DW_AT_encoding    : 7	(unsigned)
    <c75>   DW_AT_name        : (indirect string, offset: 0x12ac1): unsigned int
 <1><c79>: Abbrev Number: 3 (DW_TAG_typedef)
    <c7a>   DW_AT_name        : (indirect string, offset: 0x4354f): uint8_t
    <c7e>   DW_AT_decl_file   : 3
    <c7f>   DW_AT_decl_line   : 24
    <c80>   DW_AT_decl_column : 19
    <c81>   DW_AT_type        : <0xc2e>
 <1><c85>: Abbrev Number: 4 (DW_TAG_const_type)
    <c86>   DW_AT_type        : <0xc79>
 <1><c8a>: Abbrev Number: 1 (DW_TAG_base_type)
    <c8b>   DW_AT_byte_size   : 8
    <c8c>   DW_AT_encoding    : 4	(float)
    <c8d>   DW_AT_name        : (indirect string, offset: 0xee423): long double
 <1><c91>: Abbrev Number: 7 (DW_TAG_array_type)
    <c92>   DW_AT_type        : <0xc85>
    <c96>   DW_AT_sibling     : <0xca1>
 <2><c9a>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <c9b>   DW_AT_type        : <0xc72>
    <c9f>   DW_AT_upper_bound : 6
 <2><ca0>: Abbrev Number: 0
 <1><ca1>: Abbrev Number: 4 (DW_TAG_const_type)
    <ca2>   DW_AT_type        : <0xc91>
 <1><ca6>: Abbrev Number: 9 (DW_TAG_variable)
    <ca7>   DW_AT_name        : (indirect string, offset: 0x2d6ad): CHANNEL_OFFSET_TAB
    <cab>   DW_AT_decl_file   : 4
    <cac>   DW_AT_decl_line   : 49
    <cad>   DW_AT_decl_column : 22
    <cae>   DW_AT_type        : <0xca1>
    <cb2>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><cb8>: Abbrev Number: 2 (DW_TAG_subprogram)
    <cb9>   DW_AT_external    : 1
    <cb9>   DW_AT_name        : (indirect string, offset: 0xe8d61): DebugMon_Handler
    <cbd>   DW_AT_decl_file   : 1
    <cbd>   DW_AT_decl_line   : 159
    <cbe>   DW_AT_decl_column : 6
    <cbe>   DW_AT_prototyped  : 1
    <cbe>   DW_AT_low_pc      : 0x80008d0
    <cc2>   DW_AT_high_pc     : 0xe
    <cc6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cc8>   DW_AT_call_all_calls: 1
 <1><cc8>: Abbrev Number: 2 (DW_TAG_subprogram)
    <cc9>   DW_AT_external    : 1
    <cc9>   DW_AT_name        : (indirect string, offset: 0xe8d4e): UsageFault_Handler
    <ccd>   DW_AT_decl_file   : 1
    <ccd>   DW_AT_decl_line   : 129
    <cce>   DW_AT_decl_column : 6
    <cce>   DW_AT_prototyped  : 1
    <cce>   DW_AT_low_pc      : 0x80008c8
    <cd2>   DW_AT_high_pc     : 0x8
    <cd6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cd8>   DW_AT_call_all_calls: 1
 <1><cd8>: Abbrev Number: 2 (DW_TAG_subprogram)
    <cd9>   DW_AT_external    : 1
    <cd9>   DW_AT_name        : (indirect string, offset: 0xe8d9f): BusFault_Handler
    <cdd>   DW_AT_decl_file   : 1
    <cdd>   DW_AT_decl_line   : 114
    <cde>   DW_AT_decl_column : 6
    <cde>   DW_AT_prototyped  : 1
    <cde>   DW_AT_low_pc      : 0x80008c0
    <ce2>   DW_AT_high_pc     : 0x8
    <ce6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ce8>   DW_AT_call_all_calls: 1
 <1><ce8>: Abbrev Number: 2 (DW_TAG_subprogram)
    <ce9>   DW_AT_external    : 1
    <ce9>   DW_AT_name        : (indirect string, offset: 0xe8dc2): MemManage_Handler
    <ced>   DW_AT_decl_file   : 1
    <ced>   DW_AT_decl_line   : 99
    <cee>   DW_AT_decl_column : 6
    <cee>   DW_AT_prototyped  : 1
    <cee>   DW_AT_low_pc      : 0x80008b8
    <cf2>   DW_AT_high_pc     : 0x8
    <cf6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cf8>   DW_AT_call_all_calls: 1
 <1><cf8>: Abbrev Number: 2 (DW_TAG_subprogram)
    <cf9>   DW_AT_external    : 1
    <cf9>   DW_AT_name        : (indirect string, offset: 0xe8d8d): HardFault_Handler
    <cfd>   DW_AT_decl_file   : 1
    <cfd>   DW_AT_decl_line   : 84
    <cfe>   DW_AT_decl_column : 6
    <cfe>   DW_AT_prototyped  : 1
    <cfe>   DW_AT_low_pc      : 0x80008b0
    <d02>   DW_AT_high_pc     : 0x8
    <d06>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d08>   DW_AT_call_all_calls: 1
 <1><d08>: Abbrev Number: 2 (DW_TAG_subprogram)
    <d09>   DW_AT_external    : 1
    <d09>   DW_AT_name        : (indirect string, offset: 0xe8d42): NMI_Handler
    <d0d>   DW_AT_decl_file   : 1
    <d0d>   DW_AT_decl_line   : 69
    <d0e>   DW_AT_decl_column : 6
    <d0e>   DW_AT_prototyped  : 1
    <d0e>   DW_AT_low_pc      : 0x80008a8
    <d12>   DW_AT_high_pc     : 0x8
    <d16>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d18>   DW_AT_call_all_calls: 1
 <1><d18>: Abbrev Number: 0
  Compilation Unit @ offset 0xd19:
   Length:        0x5de (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x47f
   Pointer Size:  4
 <0><d25>: Abbrev Number: 14 (DW_TAG_compile_unit)
    <d26>   DW_AT_producer    : (indirect string, offset: 0x3c767): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <d2a>   DW_AT_language    : 29	(C11)
    <d2b>   DW_AT_name        : (indirect string, offset: 0xe8dd4): ../Core/Src/system_stm32l4xx.c
    <d2f>   DW_AT_comp_dir    : (indirect string, offset: 0x7fb10): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <d33>   DW_AT_ranges      : 0xa4
    <d37>   DW_AT_low_pc      : 0
    <d3b>   DW_AT_stmt_list   : 0x1fae
    <d3f>   DW_AT_macros      : 0x253f8
 <1><d43>: Abbrev Number: 2 (DW_TAG_base_type)
    <d44>   DW_AT_byte_size   : 1
    <d45>   DW_AT_encoding    : 6	(signed char)
    <d46>   DW_AT_name        : (indirect string, offset: 0x751ec): signed char
 <1><d4a>: Abbrev Number: 9 (DW_TAG_typedef)
    <d4b>   DW_AT_name        : (indirect string, offset: 0x4354d): __uint8_t
    <d4f>   DW_AT_decl_file   : 2
    <d50>   DW_AT_decl_line   : 43
    <d51>   DW_AT_decl_column : 24
    <d52>   DW_AT_type        : <0xd56>
 <1><d56>: Abbrev Number: 2 (DW_TAG_base_type)
    <d57>   DW_AT_byte_size   : 1
    <d58>   DW_AT_encoding    : 8	(unsigned char)
    <d59>   DW_AT_name        : (indirect string, offset: 0xdfda1): unsigned char
 <1><d5d>: Abbrev Number: 2 (DW_TAG_base_type)
    <d5e>   DW_AT_byte_size   : 2
    <d5f>   DW_AT_encoding    : 5	(signed)
    <d60>   DW_AT_name        : (indirect string, offset: 0xac250): short int
 <1><d64>: Abbrev Number: 2 (DW_TAG_base_type)
    <d65>   DW_AT_byte_size   : 2
    <d66>   DW_AT_encoding    : 7	(unsigned)
    <d67>   DW_AT_name        : (indirect string, offset: 0xde34b): short unsigned int
 <1><d6b>: Abbrev Number: 2 (DW_TAG_base_type)
    <d6c>   DW_AT_byte_size   : 4
    <d6d>   DW_AT_encoding    : 5	(signed)
    <d6e>   DW_AT_name        : (indirect string, offset: 0x135b8): long int
 <1><d72>: Abbrev Number: 9 (DW_TAG_typedef)
    <d73>   DW_AT_name        : (indirect string, offset: 0xe8b56): __uint32_t
    <d77>   DW_AT_decl_file   : 2
    <d78>   DW_AT_decl_line   : 79
    <d79>   DW_AT_decl_column : 25
    <d7a>   DW_AT_type        : <0xd7e>
 <1><d7e>: Abbrev Number: 2 (DW_TAG_base_type)
    <d7f>   DW_AT_byte_size   : 4
    <d80>   DW_AT_encoding    : 7	(unsigned)
    <d81>   DW_AT_name        : (indirect string, offset: 0x58285): long unsigned int
 <1><d85>: Abbrev Number: 2 (DW_TAG_base_type)
    <d86>   DW_AT_byte_size   : 8
    <d87>   DW_AT_encoding    : 5	(signed)
    <d88>   DW_AT_name        : (indirect string, offset: 0x69985): long long int
 <1><d8c>: Abbrev Number: 2 (DW_TAG_base_type)
    <d8d>   DW_AT_byte_size   : 8
    <d8e>   DW_AT_encoding    : 7	(unsigned)
    <d8f>   DW_AT_name        : (indirect string, offset: 0x3004c): long long unsigned int
 <1><d93>: Abbrev Number: 15 (DW_TAG_base_type)
    <d94>   DW_AT_byte_size   : 4
    <d95>   DW_AT_encoding    : 5	(signed)
    <d96>   DW_AT_name        : int
 <1><d9a>: Abbrev Number: 2 (DW_TAG_base_type)
    <d9b>   DW_AT_byte_size   : 4
    <d9c>   DW_AT_encoding    : 7	(unsigned)
    <d9d>   DW_AT_name        : (indirect string, offset: 0x12ac1): unsigned int
 <1><da1>: Abbrev Number: 9 (DW_TAG_typedef)
    <da2>   DW_AT_name        : (indirect string, offset: 0x4354f): uint8_t
    <da6>   DW_AT_decl_file   : 3
    <da7>   DW_AT_decl_line   : 24
    <da8>   DW_AT_decl_column : 19
    <da9>   DW_AT_type        : <0xd4a>
 <1><dad>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <dae>   DW_AT_type        : <0xda1>
 <1><db2>: Abbrev Number: 3 (DW_TAG_const_type)
    <db3>   DW_AT_type        : <0xda1>
 <1><db7>: Abbrev Number: 9 (DW_TAG_typedef)
    <db8>   DW_AT_name        : (indirect string, offset: 0xa82d1): uint32_t
    <dbc>   DW_AT_decl_file   : 3
    <dbd>   DW_AT_decl_line   : 48
    <dbe>   DW_AT_decl_column : 20
    <dbf>   DW_AT_type        : <0xd72>
 <1><dc3>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <dc4>   DW_AT_type        : <0xdb7>
 <1><dc8>: Abbrev Number: 3 (DW_TAG_const_type)
    <dc9>   DW_AT_type        : <0xdc3>
 <1><dcd>: Abbrev Number: 3 (DW_TAG_const_type)
    <dce>   DW_AT_type        : <0xdb7>
 <1><dd2>: Abbrev Number: 12 (DW_TAG_structure_type)
    <dd3>   DW_AT_byte_size   : 140
    <dd4>   DW_AT_decl_file   : 4
    <dd5>   DW_AT_decl_line   : 440
    <dd7>   DW_AT_decl_column : 9
    <dd7>   DW_AT_sibling     : <0xf02>
 <2><ddb>: Abbrev Number: 1 (DW_TAG_member)
    <ddc>   DW_AT_name        : (indirect string, offset: 0xe8e0c): CPUID
    <de0>   DW_AT_decl_file   : 4
    <de1>   DW_AT_decl_line   : 442
    <de3>   DW_AT_decl_column : 18
    <de4>   DW_AT_type        : <0xdc8>
    <de8>   DW_AT_data_member_location: 0
 <2><de9>: Abbrev Number: 1 (DW_TAG_member)
    <dea>   DW_AT_name        : (indirect string, offset: 0xe8e07): ICSR
    <dee>   DW_AT_decl_file   : 4
    <def>   DW_AT_decl_line   : 443
    <df1>   DW_AT_decl_column : 18
    <df2>   DW_AT_type        : <0xdc3>
    <df6>   DW_AT_data_member_location: 4
 <2><df7>: Abbrev Number: 1 (DW_TAG_member)
    <df8>   DW_AT_name        : (indirect string, offset: 0xe8df3): VTOR
    <dfc>   DW_AT_decl_file   : 4
    <dfd>   DW_AT_decl_line   : 444
    <dff>   DW_AT_decl_column : 18
    <e00>   DW_AT_type        : <0xdc3>
    <e04>   DW_AT_data_member_location: 8
 <2><e05>: Abbrev Number: 1 (DW_TAG_member)
    <e06>   DW_AT_name        : (indirect string, offset: 0xe8ec0): AIRCR
    <e0a>   DW_AT_decl_file   : 4
    <e0b>   DW_AT_decl_line   : 445
    <e0d>   DW_AT_decl_column : 18
    <e0e>   DW_AT_type        : <0xdc3>
    <e12>   DW_AT_data_member_location: 12
 <2><e13>: Abbrev Number: 6 (DW_TAG_member)
    <e14>   DW_AT_name        : SCR
    <e18>   DW_AT_decl_file   : 4
    <e19>   DW_AT_decl_line   : 446
    <e1b>   DW_AT_decl_column : 18
    <e1c>   DW_AT_type        : <0xdc3>
    <e20>   DW_AT_data_member_location: 16
 <2><e21>: Abbrev Number: 6 (DW_TAG_member)
    <e22>   DW_AT_name        : CCR
    <e26>   DW_AT_decl_file   : 4
    <e27>   DW_AT_decl_line   : 447
    <e29>   DW_AT_decl_column : 18
    <e2a>   DW_AT_type        : <0xdc3>
    <e2e>   DW_AT_data_member_location: 20
 <2><e2f>: Abbrev Number: 6 (DW_TAG_member)
    <e30>   DW_AT_name        : SHP
    <e34>   DW_AT_decl_file   : 4
    <e35>   DW_AT_decl_line   : 448
    <e37>   DW_AT_decl_column : 18
    <e38>   DW_AT_type        : <0xf12>
    <e3c>   DW_AT_data_member_location: 24
 <2><e3d>: Abbrev Number: 1 (DW_TAG_member)
    <e3e>   DW_AT_name        : (indirect string, offset: 0xe8e3a): SHCSR
    <e42>   DW_AT_decl_file   : 4
    <e43>   DW_AT_decl_line   : 449
    <e45>   DW_AT_decl_column : 18
    <e46>   DW_AT_type        : <0xdc3>
    <e4a>   DW_AT_data_member_location: 36
 <2><e4b>: Abbrev Number: 1 (DW_TAG_member)
    <e4c>   DW_AT_name        : (indirect string, offset: 0xe8e61): CFSR
    <e50>   DW_AT_decl_file   : 4
    <e51>   DW_AT_decl_line   : 450
    <e53>   DW_AT_decl_column : 18
    <e54>   DW_AT_type        : <0xdc3>
    <e58>   DW_AT_data_member_location: 40
 <2><e59>: Abbrev Number: 1 (DW_TAG_member)
    <e5a>   DW_AT_name        : (indirect string, offset: 0xe8e40): HFSR
    <e5e>   DW_AT_decl_file   : 4
    <e5f>   DW_AT_decl_line   : 451
    <e61>   DW_AT_decl_column : 18
    <e62>   DW_AT_type        : <0xdc3>
    <e66>   DW_AT_data_member_location: 44
 <2><e67>: Abbrev Number: 1 (DW_TAG_member)
    <e68>   DW_AT_name        : (indirect string, offset: 0xe8ead): DFSR
    <e6c>   DW_AT_decl_file   : 4
    <e6d>   DW_AT_decl_line   : 452
    <e6f>   DW_AT_decl_column : 18
    <e70>   DW_AT_type        : <0xdc3>
    <e74>   DW_AT_data_member_location: 48
 <2><e75>: Abbrev Number: 1 (DW_TAG_member)
    <e76>   DW_AT_name        : (indirect string, offset: 0xe8e2f): MMFAR
    <e7a>   DW_AT_decl_file   : 4
    <e7b>   DW_AT_decl_line   : 453
    <e7d>   DW_AT_decl_column : 18
    <e7e>   DW_AT_type        : <0xdc3>
    <e82>   DW_AT_data_member_location: 52
 <2><e83>: Abbrev Number: 1 (DW_TAG_member)
    <e84>   DW_AT_name        : (indirect string, offset: 0xe8e2a): BFAR
    <e88>   DW_AT_decl_file   : 4
    <e89>   DW_AT_decl_line   : 454
    <e8b>   DW_AT_decl_column : 18
    <e8c>   DW_AT_type        : <0xdc3>
    <e90>   DW_AT_data_member_location: 56
 <2><e91>: Abbrev Number: 1 (DW_TAG_member)
    <e92>   DW_AT_name        : (indirect string, offset: 0xe8e02): AFSR
    <e96>   DW_AT_decl_file   : 4
    <e97>   DW_AT_decl_line   : 455
    <e99>   DW_AT_decl_column : 18
    <e9a>   DW_AT_type        : <0xdc3>
    <e9e>   DW_AT_data_member_location: 60
 <2><e9f>: Abbrev Number: 6 (DW_TAG_member)
    <ea0>   DW_AT_name        : PFR
    <ea4>   DW_AT_decl_file   : 4
    <ea5>   DW_AT_decl_line   : 456
    <ea7>   DW_AT_decl_column : 18
    <ea8>   DW_AT_type        : <0xf2c>
    <eac>   DW_AT_data_member_location: 64
 <2><ead>: Abbrev Number: 6 (DW_TAG_member)
    <eae>   DW_AT_name        : DFR
    <eb2>   DW_AT_decl_file   : 4
    <eb3>   DW_AT_decl_line   : 457
    <eb5>   DW_AT_decl_column : 18
    <eb6>   DW_AT_type        : <0xdc8>
    <eba>   DW_AT_data_member_location: 72
 <2><ebb>: Abbrev Number: 6 (DW_TAG_member)
    <ebc>   DW_AT_name        : ADR
    <ec0>   DW_AT_decl_file   : 4
    <ec1>   DW_AT_decl_line   : 458
    <ec3>   DW_AT_decl_column : 18
    <ec4>   DW_AT_type        : <0xdc8>
    <ec8>   DW_AT_data_member_location: 76
 <2><ec9>: Abbrev Number: 1 (DW_TAG_member)
    <eca>   DW_AT_name        : (indirect string, offset: 0xe8e25): MMFR
    <ece>   DW_AT_decl_file   : 4
    <ecf>   DW_AT_decl_line   : 459
    <ed1>   DW_AT_decl_column : 18
    <ed2>   DW_AT_type        : <0xf46>
    <ed6>   DW_AT_data_member_location: 80
 <2><ed7>: Abbrev Number: 1 (DW_TAG_member)
    <ed8>   DW_AT_name        : (indirect string, offset: 0xe8e35): ISAR
    <edc>   DW_AT_decl_file   : 4
    <edd>   DW_AT_decl_line   : 460
    <edf>   DW_AT_decl_column : 18
    <ee0>   DW_AT_type        : <0xf60>
    <ee4>   DW_AT_data_member_location: 96
 <2><ee5>: Abbrev Number: 1 (DW_TAG_member)
    <ee6>   DW_AT_name        : (indirect string, offset: 0xe8ca2): RESERVED0
    <eea>   DW_AT_decl_file   : 4
    <eeb>   DW_AT_decl_line   : 461
    <eed>   DW_AT_decl_column : 18
    <eee>   DW_AT_type        : <0xf65>
    <ef2>   DW_AT_data_member_location: 116
 <2><ef3>: Abbrev Number: 1 (DW_TAG_member)
    <ef4>   DW_AT_name        : (indirect string, offset: 0xe8e5b): CPACR
    <ef8>   DW_AT_decl_file   : 4
    <ef9>   DW_AT_decl_line   : 462
    <efb>   DW_AT_decl_column : 18
    <efc>   DW_AT_type        : <0xdc3>
    <f00>   DW_AT_data_member_location: 136
 <2><f01>: Abbrev Number: 0
 <1><f02>: Abbrev Number: 4 (DW_TAG_array_type)
    <f03>   DW_AT_type        : <0xdad>
    <f07>   DW_AT_sibling     : <0xf12>
 <2><f0b>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <f0c>   DW_AT_type        : <0xd9a>
    <f10>   DW_AT_upper_bound : 11
 <2><f11>: Abbrev Number: 0
 <1><f12>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <f13>   DW_AT_type        : <0xf02>
 <1><f17>: Abbrev Number: 4 (DW_TAG_array_type)
    <f18>   DW_AT_type        : <0xdc8>
    <f1c>   DW_AT_sibling     : <0xf27>
 <2><f20>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <f21>   DW_AT_type        : <0xd9a>
    <f25>   DW_AT_upper_bound : 1
 <2><f26>: Abbrev Number: 0
 <1><f27>: Abbrev Number: 3 (DW_TAG_const_type)
    <f28>   DW_AT_type        : <0xf17>
 <1><f2c>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <f2d>   DW_AT_type        : <0xf27>
 <1><f31>: Abbrev Number: 4 (DW_TAG_array_type)
    <f32>   DW_AT_type        : <0xdc8>
    <f36>   DW_AT_sibling     : <0xf41>
 <2><f3a>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <f3b>   DW_AT_type        : <0xd9a>
    <f3f>   DW_AT_upper_bound : 3
 <2><f40>: Abbrev Number: 0
 <1><f41>: Abbrev Number: 3 (DW_TAG_const_type)
    <f42>   DW_AT_type        : <0xf31>
 <1><f46>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <f47>   DW_AT_type        : <0xf41>
 <1><f4b>: Abbrev Number: 4 (DW_TAG_array_type)
    <f4c>   DW_AT_type        : <0xdc8>
    <f50>   DW_AT_sibling     : <0xf5b>
 <2><f54>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <f55>   DW_AT_type        : <0xd9a>
    <f59>   DW_AT_upper_bound : 4
 <2><f5a>: Abbrev Number: 0
 <1><f5b>: Abbrev Number: 3 (DW_TAG_const_type)
    <f5c>   DW_AT_type        : <0xf4b>
 <1><f60>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <f61>   DW_AT_type        : <0xf5b>
 <1><f65>: Abbrev Number: 4 (DW_TAG_array_type)
    <f66>   DW_AT_type        : <0xdb7>
    <f6a>   DW_AT_sibling     : <0xf75>
 <2><f6e>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <f6f>   DW_AT_type        : <0xd9a>
    <f73>   DW_AT_upper_bound : 4
 <2><f74>: Abbrev Number: 0
 <1><f75>: Abbrev Number: 13 (DW_TAG_typedef)
    <f76>   DW_AT_name        : (indirect string, offset: 0xe8e7b): SCB_Type
    <f7a>   DW_AT_decl_file   : 4
    <f7b>   DW_AT_decl_line   : 463
    <f7d>   DW_AT_decl_column : 3
    <f7d>   DW_AT_type        : <0xdd2>
 <1><f81>: Abbrev Number: 10 (DW_TAG_variable)
    <f82>   DW_AT_name        : (indirect string, offset: 0xe8e84): SystemCoreClock
    <f86>   DW_AT_decl_file   : 5
    <f86>   DW_AT_decl_line   : 57
    <f87>   DW_AT_decl_column : 17
    <f88>   DW_AT_type        : <0xdb7>
    <f8c>   DW_AT_external    : 1
    <f8c>   DW_AT_declaration : 1
 <1><f8c>: Abbrev Number: 4 (DW_TAG_array_type)
    <f8d>   DW_AT_type        : <0xdb2>
    <f91>   DW_AT_sibling     : <0xf9c>
 <2><f95>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <f96>   DW_AT_type        : <0xd9a>
    <f9a>   DW_AT_upper_bound : 15
 <2><f9b>: Abbrev Number: 0
 <1><f9c>: Abbrev Number: 3 (DW_TAG_const_type)
    <f9d>   DW_AT_type        : <0xf8c>
 <1><fa1>: Abbrev Number: 10 (DW_TAG_variable)
    <fa2>   DW_AT_name        : (indirect string, offset: 0xe8eb2): AHBPrescTable
    <fa6>   DW_AT_decl_file   : 5
    <fa6>   DW_AT_decl_line   : 59
    <fa7>   DW_AT_decl_column : 23
    <fa8>   DW_AT_type        : <0xf9c>
    <fac>   DW_AT_external    : 1
    <fac>   DW_AT_declaration : 1
 <1><fac>: Abbrev Number: 4 (DW_TAG_array_type)
    <fad>   DW_AT_type        : <0xdb2>
    <fb1>   DW_AT_sibling     : <0xfbc>
 <2><fb5>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <fb6>   DW_AT_type        : <0xd9a>
    <fba>   DW_AT_upper_bound : 7
 <2><fbb>: Abbrev Number: 0
 <1><fbc>: Abbrev Number: 3 (DW_TAG_const_type)
    <fbd>   DW_AT_type        : <0xfac>
 <1><fc1>: Abbrev Number: 10 (DW_TAG_variable)
    <fc2>   DW_AT_name        : (indirect string, offset: 0xe8e66): APBPrescTable
    <fc6>   DW_AT_decl_file   : 5
    <fc6>   DW_AT_decl_line   : 60
    <fc7>   DW_AT_decl_column : 23
    <fc8>   DW_AT_type        : <0xfbc>
    <fcc>   DW_AT_external    : 1
    <fcc>   DW_AT_declaration : 1
 <1><fcc>: Abbrev Number: 4 (DW_TAG_array_type)
    <fcd>   DW_AT_type        : <0xdcd>
    <fd1>   DW_AT_sibling     : <0xfdc>
 <2><fd5>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <fd6>   DW_AT_type        : <0xd9a>
    <fda>   DW_AT_upper_bound : 11
 <2><fdb>: Abbrev Number: 0
 <1><fdc>: Abbrev Number: 3 (DW_TAG_const_type)
    <fdd>   DW_AT_type        : <0xfcc>
 <1><fe1>: Abbrev Number: 10 (DW_TAG_variable)
    <fe2>   DW_AT_name        : (indirect string, offset: 0xe8e9f): MSIRangeTable
    <fe6>   DW_AT_decl_file   : 5
    <fe6>   DW_AT_decl_line   : 61
    <fe7>   DW_AT_decl_column : 23
    <fe8>   DW_AT_type        : <0xfdc>
    <fec>   DW_AT_external    : 1
    <fec>   DW_AT_declaration : 1
 <1><fec>: Abbrev Number: 12 (DW_TAG_structure_type)
    <fed>   DW_AT_byte_size   : 152
    <fee>   DW_AT_decl_file   : 6
    <fef>   DW_AT_decl_line   : 685
    <ff1>   DW_AT_decl_column : 9
    <ff1>   DW_AT_sibling     : <0x1209>
 <2><ff5>: Abbrev Number: 6 (DW_TAG_member)
    <ff6>   DW_AT_name        : CR
    <ff9>   DW_AT_decl_file   : 6
    <ffa>   DW_AT_decl_line   : 687
    <ffc>   DW_AT_decl_column : 17
    <ffd>   DW_AT_type        : <0xdc3>
    <1001>   DW_AT_data_member_location: 0
 <2><1002>: Abbrev Number: 1 (DW_TAG_member)
    <1003>   DW_AT_name        : (indirect string, offset: 0xe8adc): ICSCR
    <1007>   DW_AT_decl_file   : 6
    <1008>   DW_AT_decl_line   : 688
    <100a>   DW_AT_decl_column : 17
    <100b>   DW_AT_type        : <0xdc3>
    <100f>   DW_AT_data_member_location: 4
 <2><1010>: Abbrev Number: 1 (DW_TAG_member)
    <1011>   DW_AT_name        : (indirect string, offset: 0xe8a03): CFGR
    <1015>   DW_AT_decl_file   : 6
    <1016>   DW_AT_decl_line   : 689
    <1018>   DW_AT_decl_column : 17
    <1019>   DW_AT_type        : <0xdc3>
    <101d>   DW_AT_data_member_location: 8
 <2><101e>: Abbrev Number: 1 (DW_TAG_member)
    <101f>   DW_AT_name        : (indirect string, offset: 0xe8bab): PLLCFGR
    <1023>   DW_AT_decl_file   : 6
    <1024>   DW_AT_decl_line   : 690
    <1026>   DW_AT_decl_column : 17
    <1027>   DW_AT_type        : <0xdc3>
    <102b>   DW_AT_data_member_location: 12
 <2><102c>: Abbrev Number: 1 (DW_TAG_member)
    <102d>   DW_AT_name        : (indirect string, offset: 0xe89fc): PLLSAI1CFGR
    <1031>   DW_AT_decl_file   : 6
    <1032>   DW_AT_decl_line   : 691
    <1034>   DW_AT_decl_column : 17
    <1035>   DW_AT_type        : <0xdc3>
    <1039>   DW_AT_data_member_location: 16
 <2><103a>: Abbrev Number: 1 (DW_TAG_member)
    <103b>   DW_AT_name        : (indirect string, offset: 0xe8b6c): PLLSAI2CFGR
    <103f>   DW_AT_decl_file   : 6
    <1040>   DW_AT_decl_line   : 692
    <1042>   DW_AT_decl_column : 17
    <1043>   DW_AT_type        : <0xdc3>
    <1047>   DW_AT_data_member_location: 20
 <2><1048>: Abbrev Number: 1 (DW_TAG_member)
    <1049>   DW_AT_name        : (indirect string, offset: 0xe88cf): CIER
    <104d>   DW_AT_decl_file   : 6
    <104e>   DW_AT_decl_line   : 693
    <1050>   DW_AT_decl_column : 17
    <1051>   DW_AT_type        : <0xdc3>
    <1055>   DW_AT_data_member_location: 24
 <2><1056>: Abbrev Number: 1 (DW_TAG_member)
    <1057>   DW_AT_name        : (indirect string, offset: 0xe88ca): CIFR
    <105b>   DW_AT_decl_file   : 6
    <105c>   DW_AT_decl_line   : 694
    <105e>   DW_AT_decl_column : 17
    <105f>   DW_AT_type        : <0xdc3>
    <1063>   DW_AT_data_member_location: 28
 <2><1064>: Abbrev Number: 1 (DW_TAG_member)
    <1065>   DW_AT_name        : (indirect string, offset: 0xe88c0): CICR
    <1069>   DW_AT_decl_file   : 6
    <106a>   DW_AT_decl_line   : 695
    <106c>   DW_AT_decl_column : 17
    <106d>   DW_AT_type        : <0xdc3>
    <1071>   DW_AT_data_member_location: 32
 <2><1072>: Abbrev Number: 1 (DW_TAG_member)
    <1073>   DW_AT_name        : (indirect string, offset: 0xe8ca2): RESERVED0
    <1077>   DW_AT_decl_file   : 6
    <1078>   DW_AT_decl_line   : 696
    <107a>   DW_AT_decl_column : 17
    <107b>   DW_AT_type        : <0xdb7>
    <107f>   DW_AT_data_member_location: 36
 <2><1080>: Abbrev Number: 1 (DW_TAG_member)
    <1081>   DW_AT_name        : (indirect string, offset: 0xe8bdb): AHB1RSTR
    <1085>   DW_AT_decl_file   : 6
    <1086>   DW_AT_decl_line   : 697
    <1088>   DW_AT_decl_column : 17
    <1089>   DW_AT_type        : <0xdc3>
    <108d>   DW_AT_data_member_location: 40
 <2><108e>: Abbrev Number: 1 (DW_TAG_member)
    <108f>   DW_AT_name        : (indirect string, offset: 0xe8916): AHB2RSTR
    <1093>   DW_AT_decl_file   : 6
    <1094>   DW_AT_decl_line   : 698
    <1096>   DW_AT_decl_column : 17
    <1097>   DW_AT_type        : <0xdc3>
    <109b>   DW_AT_data_member_location: 44
 <2><109c>: Abbrev Number: 1 (DW_TAG_member)
    <109d>   DW_AT_name        : (indirect string, offset: 0xe89f3): AHB3RSTR
    <10a1>   DW_AT_decl_file   : 6
    <10a2>   DW_AT_decl_line   : 699
    <10a4>   DW_AT_decl_column : 17
    <10a5>   DW_AT_type        : <0xdc3>
    <10a9>   DW_AT_data_member_location: 48
 <2><10aa>: Abbrev Number: 1 (DW_TAG_member)
    <10ab>   DW_AT_name        : (indirect string, offset: 0xe8cac): RESERVED1
    <10af>   DW_AT_decl_file   : 6
    <10b0>   DW_AT_decl_line   : 700
    <10b2>   DW_AT_decl_column : 17
    <10b3>   DW_AT_type        : <0xdb7>
    <10b7>   DW_AT_data_member_location: 52
 <2><10b8>: Abbrev Number: 1 (DW_TAG_member)
    <10b9>   DW_AT_name        : (indirect string, offset: 0xe8969): APB1RSTR1
    <10bd>   DW_AT_decl_file   : 6
    <10be>   DW_AT_decl_line   : 701
    <10c0>   DW_AT_decl_column : 17
    <10c1>   DW_AT_type        : <0xdc3>
    <10c5>   DW_AT_data_member_location: 56
 <2><10c6>: Abbrev Number: 1 (DW_TAG_member)
    <10c7>   DW_AT_name        : (indirect string, offset: 0xe8973): APB1RSTR2
    <10cb>   DW_AT_decl_file   : 6
    <10cc>   DW_AT_decl_line   : 702
    <10ce>   DW_AT_decl_column : 17
    <10cf>   DW_AT_type        : <0xdc3>
    <10d3>   DW_AT_data_member_location: 60
 <2><10d4>: Abbrev Number: 1 (DW_TAG_member)
    <10d5>   DW_AT_name        : (indirect string, offset: 0xe8a4b): APB2RSTR
    <10d9>   DW_AT_decl_file   : 6
    <10da>   DW_AT_decl_line   : 703
    <10dc>   DW_AT_decl_column : 17
    <10dd>   DW_AT_type        : <0xdc3>
    <10e1>   DW_AT_data_member_location: 64
 <2><10e2>: Abbrev Number: 1 (DW_TAG_member)
    <10e3>   DW_AT_name        : (indirect string, offset: 0xe8cb6): RESERVED2
    <10e7>   DW_AT_decl_file   : 6
    <10e8>   DW_AT_decl_line   : 704
    <10ea>   DW_AT_decl_column : 17
    <10eb>   DW_AT_type        : <0xdb7>
    <10ef>   DW_AT_data_member_location: 68
 <2><10f0>: Abbrev Number: 1 (DW_TAG_member)
    <10f1>   DW_AT_name        : (indirect string, offset: 0xe8909): AHB1ENR
    <10f5>   DW_AT_decl_file   : 6
    <10f6>   DW_AT_decl_line   : 705
    <10f8>   DW_AT_decl_column : 17
    <10f9>   DW_AT_type        : <0xdc3>
    <10fd>   DW_AT_data_member_location: 72
 <2><10fe>: Abbrev Number: 1 (DW_TAG_member)
    <10ff>   DW_AT_name        : (indirect string, offset: 0xe89a8): AHB2ENR
    <1103>   DW_AT_decl_file   : 6
    <1104>   DW_AT_decl_line   : 706
    <1106>   DW_AT_decl_column : 17
    <1107>   DW_AT_type        : <0xdc3>
    <110b>   DW_AT_data_member_location: 76
 <2><110c>: Abbrev Number: 1 (DW_TAG_member)
    <110d>   DW_AT_name        : (indirect string, offset: 0xe8a6b): AHB3ENR
    <1111>   DW_AT_decl_file   : 6
    <1112>   DW_AT_decl_line   : 707
    <1114>   DW_AT_decl_column : 17
    <1115>   DW_AT_type        : <0xdc3>
    <1119>   DW_AT_data_member_location: 80
 <2><111a>: Abbrev Number: 1 (DW_TAG_member)
    <111b>   DW_AT_name        : (indirect string, offset: 0xe8cc0): RESERVED3
    <111f>   DW_AT_decl_file   : 6
    <1120>   DW_AT_decl_line   : 708
    <1122>   DW_AT_decl_column : 17
    <1123>   DW_AT_type        : <0xdb7>
    <1127>   DW_AT_data_member_location: 84
 <2><1128>: Abbrev Number: 1 (DW_TAG_member)
    <1129>   DW_AT_name        : (indirect string, offset: 0xe88d4): APB1ENR1
    <112d>   DW_AT_decl_file   : 6
    <112e>   DW_AT_decl_line   : 709
    <1130>   DW_AT_decl_column : 17
    <1131>   DW_AT_type        : <0xdc3>
    <1135>   DW_AT_data_member_location: 88
 <2><1136>: Abbrev Number: 1 (DW_TAG_member)
    <1137>   DW_AT_name        : (indirect string, offset: 0xe88dd): APB1ENR2
    <113b>   DW_AT_decl_file   : 6
    <113c>   DW_AT_decl_line   : 710
    <113e>   DW_AT_decl_column : 17
    <113f>   DW_AT_type        : <0xdc3>
    <1143>   DW_AT_data_member_location: 92
 <2><1144>: Abbrev Number: 1 (DW_TAG_member)
    <1145>   DW_AT_name        : (indirect string, offset: 0xe891f): APB2ENR
    <1149>   DW_AT_decl_file   : 6
    <114a>   DW_AT_decl_line   : 711
    <114c>   DW_AT_decl_column : 17
    <114d>   DW_AT_type        : <0xdc3>
    <1151>   DW_AT_data_member_location: 96
 <2><1152>: Abbrev Number: 1 (DW_TAG_member)
    <1153>   DW_AT_name        : (indirect string, offset: 0xe8b01): RESERVED4
    <1157>   DW_AT_decl_file   : 6
    <1158>   DW_AT_decl_line   : 712
    <115a>   DW_AT_decl_column : 17
    <115b>   DW_AT_type        : <0xdb7>
    <115f>   DW_AT_data_member_location: 100
 <2><1160>: Abbrev Number: 1 (DW_TAG_member)
    <1161>   DW_AT_name        : (indirect string, offset: 0xe8a82): AHB1SMENR
    <1165>   DW_AT_decl_file   : 6
    <1166>   DW_AT_decl_line   : 713
    <1168>   DW_AT_decl_column : 17
    <1169>   DW_AT_type        : <0xdc3>
    <116d>   DW_AT_data_member_location: 104
 <2><116e>: Abbrev Number: 1 (DW_TAG_member)
    <116f>   DW_AT_name        : (indirect string, offset: 0xe8c80): AHB2SMENR
    <1173>   DW_AT_decl_file   : 6
    <1174>   DW_AT_decl_line   : 714
    <1176>   DW_AT_decl_column : 17
    <1177>   DW_AT_type        : <0xdc3>
    <117b>   DW_AT_data_member_location: 108
 <2><117c>: Abbrev Number: 1 (DW_TAG_member)
