Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x126 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x3c767): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x54cc2): ../Core/Src/freertos_hooks.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x7fb10): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 7 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 1 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0x12ac1): unsigned int
 <1><38>: Abbrev Number: 1 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x69985): long long int

 <1><191>: Abbrev Number: 5 (DW_TAG_base_type)
    <192>   DW_AT_byte_size   : 2
    <193>   DW_AT_encoding    : 7	(unsigned)
    <194>   DW_AT_name        : (indirect string, offset: 0xde34b): short unsigned int
 <1><198>: Abbrev Number: 5 (DW_TAG_base_type)
    <199>   DW_AT_byte_size   : 4
    <19a>   DW_AT_encoding    : 5	(signed)
    <19b>   DW_AT_name        : (indirect string, offset: 0x135b8): long int
 <1><19f>: Abbrev Number: 3 (DW_TAG_typedef)
    <1a0>   DW_AT_name        : (indirect string, offset: 0xe8b4d): __uint32_t
    <1a4>   DW_AT_decl_file   : 3
    <1a5>   DW_AT_decl_line   : 79
    <1a6>   DW_AT_decl_column : 25
    <1a7>   DW_AT_type        : <0x1ab>
 <1><1ab>: Abbrev Number: 5 (DW_TAG_base_type)
    <1ac>   DW_AT_byte_size   : 4
    <1ad>   DW_AT_encoding    : 7	(unsigned)
    <1ae>   DW_AT_name        : (indirect string, offset: 0x58285): long unsigned int
 <1><1b2>: Abbrev Number: 3 (DW_TAG_typedef)
    <1b3>   DW_AT_name        : (indirect string, offset: 0xe8a73): __uint64_t
    <1b7>   DW_AT_decl_file   : 3
    <1b8>   DW_AT_decl_line   : 105
    <1b9>   DW_AT_decl_column : 25
    <1ba>   DW_AT_type        : <0x1be>
 <1><1be>: Abbrev Number: 5 (DW_TAG_base_type)
    <1bf>   DW_AT_byte_size   : 8
    <1c0>   DW_AT_encoding    : 7	(unsigned)
    <1c1>   DW_AT_name        : (indirect string, offset: 0x3004c): long long unsigned int
 <1><1c5>: Abbrev Number: 3 (DW_TAG_typedef)
    <1c6>   DW_AT_name        : (indirect string, offset: 0x4354f): uint8_t
    <1ca>   DW_AT_decl_file   : 4
    <1cb>   DW_AT_decl_line   : 24
    <1cc>   DW_AT_decl_column : 19
    <1cd>   DW_AT_type        : <0x177>
 <1><1d1>: Abbrev Number: 6 (DW_TAG_const_type)
    <1d2>   DW_AT_type        : <0x1c5>
 <1><1d6>: Abbrev Number: 3 (DW_TAG_typedef)
    <1d7>   DW_AT_name        : (indirect string, offset: 0xa82d1): uint32_t
    <1db>   DW_AT_decl_file   : 4
    <1dc>   DW_AT_decl_line   : 48
    <1dd>   DW_AT_decl_column : 20
    <1de>   DW_AT_type        : <0x19f>
 <1><1e2>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <1e3>   DW_AT_type        : <0x1d6>
 <1><1e7>: Abbrev Number: 3 (DW_TAG_typedef)
    <1e8>   DW_AT_name        : (indirect string, offset: 0xe8a75): uint64_t
    <1ec>   DW_AT_decl_file   : 4
    <1ed>   DW_AT_decl_line   : 60
    <1ee>   DW_AT_decl_column : 20
    <1ef>   DW_AT_type        : <0x1b2>
 <1><1f3>: Abbrev Number: 3 (DW_TAG_typedef)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x6da98): TaskFunction_t
    <1f8>   DW_AT_decl_file   : 5
    <1f9>   DW_AT_decl_line   : 36
    <1fa>   DW_AT_decl_column : 17
    <1fb>   DW_AT_type        : <0x1ff>
 <1><1ff>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <200>   DW_AT_byte_size   : 4
    <200>   DW_AT_type        : <0x204>
 <1><204>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <205>   DW_AT_prototyped  : 1
    <205>   DW_AT_sibling     : <0x20f>
 <2><209>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <20a>   DW_AT_type        : <0x20f>
 <2><20e>: Abbrev Number: 0
 <1><20f>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <210>   DW_AT_byte_size   : 4
 <1><211>: Abbrev Number: 6 (DW_TAG_const_type)
    <212>   DW_AT_type        : <0x20f>
 <1><216>: Abbrev Number: 3 (DW_TAG_typedef)
    <217>   DW_AT_name        : (indirect string, offset: 0xd522e): StackType_t
    <21b>   DW_AT_decl_file   : 6
    <21c>   DW_AT_decl_line   : 58
    <21d>   DW_AT_decl_column : 26
    <21e>   DW_AT_type        : <0x1d6>
 <1><222>: Abbrev Number: 6 (DW_TAG_const_type)
    <223>   DW_AT_type        : <0x216>
 <1><227>: Abbrev Number: 3 (DW_TAG_typedef)
    <228>   DW_AT_name        : (indirect string, offset: 0xe8cb3): BaseType_t
    <22c>   DW_AT_decl_file   : 6
    <22d>   DW_AT_decl_line   : 59
    <22e>   DW_AT_decl_column : 26
    <22f>   DW_AT_type        : <0x198>
 <1><233>: Abbrev Number: 3 (DW_TAG_typedef)
    <234>   DW_AT_name        : (indirect string, offset: 0xe8cb2): UBaseType_t
    <238>   DW_AT_decl_file   : 6
    <239>   DW_AT_decl_line   : 60
    <23a>   DW_AT_decl_column : 26
    <23b>   DW_AT_type        : <0x1ab>
 <1><23f>: Abbrev Number: 3 (DW_TAG_typedef)
    <240>   DW_AT_name        : (indirect string, offset: 0x8004b): TickType_t
    <244>   DW_AT_decl_file   : 6
    <245>   DW_AT_decl_line   : 66
    <246>   DW_AT_decl_column : 26
    <247>   DW_AT_type        : <0x1d6>
 <1><24b>: Abbrev Number: 6 (DW_TAG_const_type)
    <24c>   DW_AT_type        : <0x23f>
 <1><250>: Abbrev Number: 3 (DW_TAG_typedef)
    <251>   DW_AT_name        : (indirect string, offset: 0xc99d6): TaskHandle_t
    <255>   DW_AT_decl_file   : 7
    <256>   DW_AT_decl_line   : 95
    <257>   DW_AT_decl_column : 46
    <258>   DW_AT_type        : <0x25c>
 <1><25c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <25d>   DW_AT_byte_size   : 4
    <25d>   DW_AT_type        : <0x261>
 <1><261>: Abbrev Number: 24 (DW_TAG_structure_type)
    <262>   DW_AT_name        : (indirect string, offset: 0xc511a): tskTaskControlBlock
    <266>   DW_AT_declaration : 1
 <1><266>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <267>   DW_AT_byte_size   : 4
    <267>   DW_AT_type        : <0x277>
 <1><26b>: Abbrev Number: 6 (DW_TAG_const_type)
    <26c>   DW_AT_type        : <0x266>
 <1><270>: Abbrev Number: 5 (DW_TAG_base_type)
    <271>   DW_AT_byte_size   : 1
    <272>   DW_AT_encoding    : 8	(unsigned char)
    <273>   DW_AT_name        : (indirect string, offset: 0x4ad84): char
 <1><277>: Abbrev Number: 6 (DW_TAG_const_type)
    <278>   DW_AT_type        : <0x270>
 <1><27c>: Abbrev Number: 14 (DW_TAG_structure_type)
    <27d>   DW_AT_byte_size   : 48
    <27e>   DW_AT_decl_file   : 8
    <27e>   DW_AT_decl_line   : 531
    <280>   DW_AT_decl_column : 9
    <280>   DW_AT_sibling     : <0x309>
 <2><284>: Abbrev Number: 1 (DW_TAG_member)
    <285>   DW_AT_name        : (indirect string, offset: 0xe88b0): MODER
    <289>   DW_AT_decl_file   : 8
    <289>   DW_AT_decl_line   : 533
    <28b>   DW_AT_decl_column : 17
    <28b>   DW_AT_type        : <0x1e2>
    <28f>   DW_AT_data_member_location: 0
 <2><290>: Abbrev Number: 1 (DW_TAG_member)
    <291>   DW_AT_name        : (indirect string, offset: 0xe8bba): OTYPER
    <295>   DW_AT_decl_file   : 8
    <295>   DW_AT_decl_line   : 534
    <297>   DW_AT_decl_column : 17
    <297>   DW_AT_type        : <0x1e2>
    <29b>   DW_AT_data_member_location: 4
 <2><29c>: Abbrev Number: 1 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0xe8c23): OSPEEDR
    <2a1>   DW_AT_decl_file   : 8
    <2a1>   DW_AT_decl_line   : 535
    <2a3>   DW_AT_decl_column : 17
    <2a3>   DW_AT_type        : <0x1e2>
    <2a7>   DW_AT_data_member_location: 8
 <2><2a8>: Abbrev Number: 1 (DW_TAG_member)
    <2a9>   DW_AT_name        : (indirect string, offset: 0xe8b58): PUPDR
    <2ad>   DW_AT_decl_file   : 8
    <2ad>   DW_AT_decl_line   : 536
    <2af>   DW_AT_decl_column : 17
    <2af>   DW_AT_type        : <0x1e2>
    <2b3>   DW_AT_data_member_location: 12
 <2><2b4>: Abbrev Number: 8 (DW_TAG_member)
    <2b5>   DW_AT_name        : IDR
    <2b9>   DW_AT_decl_file   : 8
    <2b9>   DW_AT_decl_line   : 537
    <2bb>   DW_AT_decl_column : 17
    <2bb>   DW_AT_type        : <0x1e2>
    <2bf>   DW_AT_data_member_location: 16
 <2><2c0>: Abbrev Number: 8 (DW_TAG_member)
    <2c1>   DW_AT_name        : ODR
    <2c5>   DW_AT_decl_file   : 8
    <2c5>   DW_AT_decl_line   : 538
    <2c7>   DW_AT_decl_column : 17
    <2c7>   DW_AT_type        : <0x1e2>
    <2cb>   DW_AT_data_member_location: 20
 <2><2cc>: Abbrev Number: 1 (DW_TAG_member)
    <2cd>   DW_AT_name        : (indirect string, offset: 0xe897b): BSRR
    <2d1>   DW_AT_decl_file   : 8
    <2d1>   DW_AT_decl_line   : 539
    <2d3>   DW_AT_decl_column : 17
    <2d3>   DW_AT_type        : <0x1e2>
    <2d7>   DW_AT_data_member_location: 24
 <2><2d8>: Abbrev Number: 1 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0xe8c0a): LCKR
    <2dd>   DW_AT_decl_file   : 8
    <2dd>   DW_AT_decl_line   : 540
    <2df>   DW_AT_decl_column : 17
    <2df>   DW_AT_type        : <0x1e2>
    <2e3>   DW_AT_data_member_location: 28
 <2><2e4>: Abbrev Number: 8 (DW_TAG_member)
    <2e5>   DW_AT_name        : AFR
    <2e9>   DW_AT_decl_file   : 8
    <2e9>   DW_AT_decl_line   : 541
    <2eb>   DW_AT_decl_column : 17
    <2eb>   DW_AT_type        : <0x319>
    <2ef>   DW_AT_data_member_location: 32
 <2><2f0>: Abbrev Number: 8 (DW_TAG_member)
    <2f1>   DW_AT_name        : BRR
    <2f5>   DW_AT_decl_file   : 8
    <2f5>   DW_AT_decl_line   : 542
    <2f7>   DW_AT_decl_column : 17
    <2f7>   DW_AT_type        : <0x1e2>
    <2fb>   DW_AT_data_member_location: 40
 <2><2fc>: Abbrev Number: 1 (DW_TAG_member)
    <2fd>   DW_AT_name        : (indirect string, offset: 0xe88bb): ASCR
    <301>   DW_AT_decl_file   : 8
    <301>   DW_AT_decl_line   : 543
    <303>   DW_AT_decl_column : 17
    <303>   DW_AT_type        : <0x1e2>
    <307>   DW_AT_data_member_location: 44
 <2><308>: Abbrev Number: 0
 <1><309>: Abbrev Number: 15 (DW_TAG_array_type)
    <30a>   DW_AT_type        : <0x1e2>
    <30e>   DW_AT_sibling     : <0x319>
 <2><312>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <313>   DW_AT_type        : <0x15b>
    <317>   DW_AT_upper_bound : 1
 <2><318>: Abbrev Number: 0
 <1><319>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <31a>   DW_AT_type        : <0x309>
 <1><31e>: Abbrev Number: 17 (DW_TAG_typedef)
    <31f>   DW_AT_name        : (indirect string, offset: 0xe8cbe): GPIO_TypeDef
    <323>   DW_AT_decl_file   : 8
    <323>   DW_AT_decl_line   : 545
    <325>   DW_AT_decl_column : 3
    <325>   DW_AT_type        : <0x27c>
 <1><329>: Abbrev Number: 14 (DW_TAG_structure_type)
    <32a>   DW_AT_byte_size   : 152
    <32b>   DW_AT_decl_file   : 8
    <32b>   DW_AT_decl_line   : 685
    <32d>   DW_AT_decl_column : 9
    <32d>   DW_AT_sibling     : <0x4f9>
 <2><331>: Abbrev Number: 8 (DW_TAG_member)
    <332>   DW_AT_name        : CR
    <335>   DW_AT_decl_file   : 8
    <335>   DW_AT_decl_line   : 687
    <337>   DW_AT_decl_column : 17
    <337>   DW_AT_type        : <0x1e2>
    <33b>   DW_AT_data_member_location: 0
 <2><33c>: Abbrev Number: 1 (DW_TAG_member)
    <33d>   DW_AT_name        : (indirect string, offset: 0xe8ac3): ICSCR
    <341>   DW_AT_decl_file   : 8
    <341>   DW_AT_decl_line   : 688
    <343>   DW_AT_decl_column : 17
    <343>   DW_AT_type        : <0x1e2>
    <347>   DW_AT_data_member_location: 4
 <2><348>: Abbrev Number: 1 (DW_TAG_member)
    <349>   DW_AT_name        : (indirect string, offset: 0xe89ef): CFGR
    <34d>   DW_AT_decl_file   : 8
    <34d>   DW_AT_decl_line   : 689
    <34f>   DW_AT_decl_column : 17
    <34f>   DW_AT_type        : <0x1e2>
    <353>   DW_AT_data_member_location: 8
 <2><354>: Abbrev Number: 1 (DW_TAG_member)
    <355>   DW_AT_name        : (indirect string, offset: 0xe8b9d): PLLCFGR
    <359>   DW_AT_decl_file   : 8
    <359>   DW_AT_decl_line   : 690
    <35b>   DW_AT_decl_column : 17
    <35b>   DW_AT_type        : <0x1e2>
    <35f>   DW_AT_data_member_location: 12
 <2><360>: Abbrev Number: 1 (DW_TAG_member)
    <361>   DW_AT_name        : (indirect string, offset: 0xe89e8): PLLSAI1CFGR
    <365>   DW_AT_decl_file   : 8
    <365>   DW_AT_decl_line   : 691
    <367>   DW_AT_decl_column : 17
    <367>   DW_AT_type        : <0x1e2>
    <36b>   DW_AT_data_member_location: 16
 <2><36c>: Abbrev Number: 1 (DW_TAG_member)
    <36d>   DW_AT_name        : (indirect string, offset: 0xe8b63): PLLSAI2CFGR
    <371>   DW_AT_decl_file   : 8
    <371>   DW_AT_decl_line   : 692
    <373>   DW_AT_decl_column : 17
    <373>   DW_AT_type        : <0x1e2>
    <377>   DW_AT_data_member_location: 20
 <2><378>: Abbrev Number: 1 (DW_TAG_member)
    <379>   DW_AT_name        : (indirect string, offset: 0xe88c5): CIER
    <37d>   DW_AT_decl_file   : 8
    <37d>   DW_AT_decl_line   : 693
    <37f>   DW_AT_decl_column : 17
    <37f>   DW_AT_type        : <0x1e2>
    <383>   DW_AT_data_member_location: 24
 <2><384>: Abbrev Number: 1 (DW_TAG_member)
    <385>   DW_AT_name        : (indirect string, offset: 0xe88c0): CIFR
    <389>   DW_AT_decl_file   : 8
    <389>   DW_AT_decl_line   : 694
    <38b>   DW_AT_decl_column : 17
    <38b>   DW_AT_type        : <0x1e2>
    <38f>   DW_AT_data_member_location: 28
 <2><390>: Abbrev Number: 1 (DW_TAG_member)
    <391>   DW_AT_name        : (indirect string, offset: 0xe88b6): CICR
    <395>   DW_AT_decl_file   : 8
    <395>   DW_AT_decl_line   : 695
    <397>   DW_AT_decl_column : 17
    <397>   DW_AT_type        : <0x1e2>
    <39b>   DW_AT_data_member_location: 32
 <2><39c>: Abbrev Number: 1 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0xe8c64): RESERVED0
    <3a1>   DW_AT_decl_file   : 8
    <3a1>   DW_AT_decl_line   : 696
    <3a3>   DW_AT_decl_column : 17
    <3a3>   DW_AT_type        : <0x1d6>
    <3a7>   DW_AT_data_member_location: 36
 <2><3a8>: Abbrev Number: 1 (DW_TAG_member)
    <3a9>   DW_AT_name        : (indirect string, offset: 0xe8bc1): AHB1RSTR
    <3ad>   DW_AT_decl_file   : 8
    <3ad>   DW_AT_decl_line   : 697
    <3af>   DW_AT_decl_column : 17
    <3af>   DW_AT_type        : <0x1e2>
    <3b3>   DW_AT_data_member_location: 40
 <2><3b4>: Abbrev Number: 1 (DW_TAG_member)
    <3b5>   DW_AT_name        : (indirect string, offset: 0xe890c): AHB2RSTR
    <3b9>   DW_AT_decl_file   : 8
    <3b9>   DW_AT_decl_line   : 698
    <3bb>   DW_AT_decl_column : 17
    <3bb>   DW_AT_type        : <0x1e2>
    <3bf>   DW_AT_data_member_location: 44
 <2><3c0>: Abbrev Number: 1 (DW_TAG_member)
    <3c1>   DW_AT_name        : (indirect string, offset: 0xe89df): AHB3RSTR
    <3c5>   DW_AT_decl_file   : 8
    <3c5>   DW_AT_decl_line   : 699
    <3c7>   DW_AT_decl_column : 17
    <3c7>   DW_AT_type        : <0x1e2>
    <3cb>   DW_AT_data_member_location: 48
 <2><3cc>: Abbrev Number: 1 (DW_TAG_member)
    <3cd>   DW_AT_name        : (indirect string, offset: 0xe8c6e): RESERVED1
    <3d1>   DW_AT_decl_file   : 8
    <3d1>   DW_AT_decl_line   : 700
    <3d3>   DW_AT_decl_column : 17
    <3d3>   DW_AT_type        : <0x1d6>
    <3d7>   DW_AT_data_member_location: 52
 <2><3d8>: Abbrev Number: 1 (DW_TAG_member)
    <3d9>   DW_AT_name        : (indirect string, offset: 0xe8955): APB1RSTR1
    <3dd>   DW_AT_decl_file   : 8
    <3dd>   DW_AT_decl_line   : 701
    <3df>   DW_AT_decl_column : 17
    <3df>   DW_AT_type        : <0x1e2>
    <3e3>   DW_AT_data_member_location: 56
 <2><3e4>: Abbrev Number: 1 (DW_TAG_member)
    <3e5>   DW_AT_name        : (indirect string, offset: 0xe895f): APB1RSTR2
    <3e9>   DW_AT_decl_file   : 8
    <3e9>   DW_AT_decl_line   : 702
    <3eb>   DW_AT_decl_column : 17
    <3eb>   DW_AT_type        : <0x1e2>
    <3ef>   DW_AT_data_member_location: 60
 <2><3f0>: Abbrev Number: 1 (DW_TAG_member)
    <3f1>   DW_AT_name        : (indirect string, offset: 0xe8a32): APB2RSTR
    <3f5>   DW_AT_decl_file   : 8
    <3f5>   DW_AT_decl_line   : 703
    <3f7>   DW_AT_decl_column : 17
    <3f7>   DW_AT_type        : <0x1e2>
    <3fb>   DW_AT_data_member_location: 64
 <2><3fc>: Abbrev Number: 1 (DW_TAG_member)
    <3fd>   DW_AT_name        : (indirect string, offset: 0xe8c78): RESERVED2
    <401>   DW_AT_decl_file   : 8
    <401>   DW_AT_decl_line   : 704
    <403>   DW_AT_decl_column : 17
    <403>   DW_AT_type        : <0x1d6>
    <407>   DW_AT_data_member_location: 68
 <2><408>: Abbrev Number: 1 (DW_TAG_member)
    <409>   DW_AT_name        : (indirect string, offset: 0xe88ff): AHB1ENR
    <40d>   DW_AT_decl_file   : 8
    <40d>   DW_AT_decl_line   : 705
    <40f>   DW_AT_decl_column : 17
    <40f>   DW_AT_type        : <0x1e2>
    <413>   DW_AT_data_member_location: 72
 <2><414>: Abbrev Number: 1 (DW_TAG_member)
    <415>   DW_AT_name        : (indirect string, offset: 0xe8994): AHB2ENR
    <419>   DW_AT_decl_file   : 8
    <419>   DW_AT_decl_line   : 706
    <41b>   DW_AT_decl_column : 17
    <41b>   DW_AT_type        : <0x1e2>
    <41f>   DW_AT_data_member_location: 76
 <2><420>: Abbrev Number: 1 (DW_TAG_member)
    <421>   DW_AT_name        : (indirect string, offset: 0xe8a52): AHB3ENR
    <425>   DW_AT_decl_file   : 8
    <425>   DW_AT_decl_line   : 707
    <427>   DW_AT_decl_column : 17
    <427>   DW_AT_type        : <0x1e2>
    <42b>   DW_AT_data_member_location: 80
 <2><42c>: Abbrev Number: 1 (DW_TAG_member)
    <42d>   DW_AT_name        : (indirect string, offset: 0xe8c82): RESERVED3
    <431>   DW_AT_decl_file   : 8
    <431>   DW_AT_decl_line   : 708
    <433>   DW_AT_decl_column : 17
    <433>   DW_AT_type        : <0x1d6>
    <437>   DW_AT_data_member_location: 84
 <2><438>: Abbrev Number: 1 (DW_TAG_member)
    <439>   DW_AT_name        : (indirect string, offset: 0xe88ca): APB1ENR1
    <43d>   DW_AT_decl_file   : 8
    <43d>   DW_AT_decl_line   : 709
    <43f>   DW_AT_decl_column : 17
    <43f>   DW_AT_type        : <0x1e2>
    <443>   DW_AT_data_member_location: 88
 <2><444>: Abbrev Number: 1 (DW_TAG_member)
    <445>   DW_AT_name        : (indirect string, offset: 0xe88d3): APB1ENR2
    <449>   DW_AT_decl_file   : 8
    <449>   DW_AT_decl_line   : 710
    <44b>   DW_AT_decl_column : 17
    <44b>   DW_AT_type        : <0x1e2>
    <44f>   DW_AT_data_member_location: 92
 <2><450>: Abbrev Number: 1 (DW_TAG_member)
    <451>   DW_AT_name        : (indirect string, offset: 0xe8915): APB2ENR
    <455>   DW_AT_decl_file   : 8
    <455>   DW_AT_decl_line   : 711
    <457>   DW_AT_decl_column : 17
    <457>   DW_AT_type        : <0x1e2>
    <45b>   DW_AT_data_member_location: 96
 <2><45c>: Abbrev Number: 1 (DW_TAG_member)
    <45d>   DW_AT_name        : (indirect string, offset: 0xe8ae8): RESERVED4
    <461>   DW_AT_decl_file   : 8
    <461>   DW_AT_decl_line   : 712
    <463>   DW_AT_decl_column : 17
    <463>   DW_AT_type        : <0x1d6>
    <467>   DW_AT_data_member_location: 100
 <2><468>: Abbrev Number: 1 (DW_TAG_member)
    <469>   DW_AT_name        : (indirect string, offset: 0xe8a69): AHB1SMENR
    <46d>   DW_AT_decl_file   : 8
    <46d>   DW_AT_decl_line   : 713
    <46f>   DW_AT_decl_column : 17
    <46f>   DW_AT_type        : <0x1e2>
    <473>   DW_AT_data_member_location: 104
 <2><474>: Abbrev Number: 1 (DW_TAG_member)
    <475>   DW_AT_name        : (indirect string, offset: 0xe8c51): AHB2SMENR
    <479>   DW_AT_decl_file   : 8
    <479>   DW_AT_decl_line   : 714
    <47b>   DW_AT_decl_column : 17
    <47b>   DW_AT_type        : <0x1e2>
    <47f>   DW_AT_data_member_location: 108
 <2><480>: Abbrev Number: 1 (DW_TAG_member)
    <481>   DW_AT_name        : (indirect string, offset: 0xe8a0d): AHB3SMENR
    <485>   DW_AT_decl_file   : 8
    <485>   DW_AT_decl_line   : 715
    <487>   DW_AT_decl_column : 17
    <487>   DW_AT_type        : <0x1e2>
    <48b>   DW_AT_data_member_location: 112
 <2><48c>: Abbrev Number: 1 (DW_TAG_member)
    <48d>   DW_AT_name        : (indirect string, offset: 0xe8c8c): RESERVED5
    <491>   DW_AT_decl_file   : 8
    <491>   DW_AT_decl_line   : 716
    <493>   DW_AT_decl_column : 17
    <493>   DW_AT_type        : <0x1d6>
    <497>   DW_AT_data_member_location: 116
 <2><498>: Abbrev Number: 1 (DW_TAG_member)
    <499>   DW_AT_name        : (indirect string, offset: 0xe88dc): APB1SMENR1
    <49d>   DW_AT_decl_file   : 8
    <49d>   DW_AT_decl_line   : 717
    <49f>   DW_AT_decl_column : 17
    <49f>   DW_AT_type        : <0x1e2>
    <4a3>   DW_AT_data_member_location: 120
 <2><4a4>: Abbrev Number: 1 (DW_TAG_member)
    <4a5>   DW_AT_name        : (indirect string, offset: 0xe88e7): APB1SMENR2
    <4a9>   DW_AT_decl_file   : 8
    <4a9>   DW_AT_decl_line   : 718
    <4ab>   DW_AT_decl_column : 17
    <4ab>   DW_AT_type        : <0x1e2>
    <4af>   DW_AT_data_member_location: 124
 <2><4b0>: Abbrev Number: 1 (DW_TAG_member)
    <4b1>   DW_AT_name        : (indirect string, offset: 0xe8bb0): APB2SMENR
    <4b5>   DW_AT_decl_file   : 8
    <4b5>   DW_AT_decl_line   : 719
    <4b7>   DW_AT_decl_column : 17
    <4b7>   DW_AT_type        : <0x1e2>
    <4bb>   DW_AT_data_member_location: 128
 <2><4bc>: Abbrev Number: 1 (DW_TAG_member)
    <4bd>   DW_AT_name        : (indirect string, offset: 0xe8af2): RESERVED6
    <4c1>   DW_AT_decl_file   : 8
    <4c1>   DW_AT_decl_line   : 720
    <4c3>   DW_AT_decl_column : 17
    <4c3>   DW_AT_type        : <0x1d6>
    <4c7>   DW_AT_data_member_location: 132
 <2><4c8>: Abbrev Number: 1 (DW_TAG_member)
    <4c9>   DW_AT_name        : (indirect string, offset: 0xe89bc): CCIPR
    <4cd>   DW_AT_decl_file   : 8
    <4cd>   DW_AT_decl_line   : 721
    <4cf>   DW_AT_decl_column : 17
    <4cf>   DW_AT_type        : <0x1e2>
    <4d3>   DW_AT_data_member_location: 136
 <2><4d4>: Abbrev Number: 1 (DW_TAG_member)
    <4d5>   DW_AT_name        : (indirect string, offset: 0xe8c96): RESERVED7
    <4d9>   DW_AT_decl_file   : 8
    <4d9>   DW_AT_decl_line   : 722
    <4db>   DW_AT_decl_column : 17
    <4db>   DW_AT_type        : <0x1d6>
    <4df>   DW_AT_data_member_location: 140
 <2><4e0>: Abbrev Number: 1 (DW_TAG_member)
    <4e1>   DW_AT_name        : (indirect string, offset: 0xe898f): BDCR
    <4e5>   DW_AT_decl_file   : 8
    <4e5>   DW_AT_decl_line   : 723
    <4e7>   DW_AT_decl_column : 17
    <4e7>   DW_AT_type        : <0x1e2>
    <4eb>   DW_AT_data_member_location: 144
 <2><4ec>: Abbrev Number: 8 (DW_TAG_member)
    <4ed>   DW_AT_name        : CSR
    <4f1>   DW_AT_decl_file   : 8
    <4f1>   DW_AT_decl_line   : 724
    <4f3>   DW_AT_decl_column : 17
    <4f3>   DW_AT_type        : <0x1e2>
    <4f7>   DW_AT_data_member_location: 148
 <2><4f8>: Abbrev Number: 0
 <1><4f9>: Abbrev Number: 17 (DW_TAG_typedef)
    <4fa>   DW_AT_name        : (indirect string, offset: 0xe8a7e): RCC_TypeDef
    <4fe>   DW_AT_decl_file   : 8
    <4fe>   DW_AT_decl_line   : 725
    <500>   DW_AT_decl_column : 3
    <500>   DW_AT_type        : <0x329>
 <1><504>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <505>   DW_AT_encoding    : 7	(unsigned)
    <506>   DW_AT_byte_size   : 1
    <507>   DW_AT_type        : <0x183>
    <50b>   DW_AT_decl_file   : 9
    <50c>   DW_AT_decl_line   : 39
    <50d>   DW_AT_decl_column : 1
    <50e>   DW_AT_sibling     : <0x52b>
 <2><512>: Abbrev Number: 10 (DW_TAG_enumerator)
    <513>   DW_AT_name        : (indirect string, offset: 0xe89f4): HAL_OK
    <517>   DW_AT_const_value : 0
 <2><518>: Abbrev Number: 10 (DW_TAG_enumerator)
    <519>   DW_AT_name        : (indirect string, offset: 0xe8b33): HAL_ERROR
    <51d>   DW_AT_const_value : 1
 <2><51e>: Abbrev Number: 10 (DW_TAG_enumerator)
    <51f>   DW_AT_name        : (indirect string, offset: 0xe894c): HAL_BUSY
    <523>   DW_AT_const_value : 2
 <2><524>: Abbrev Number: 10 (DW_TAG_enumerator)
    <525>   DW_AT_name        : (indirect string, offset: 0xe899c): HAL_TIMEOUT
    <529>   DW_AT_const_value : 3
 <2><52a>: Abbrev Number: 0
 <1><52b>: Abbrev Number: 3 (DW_TAG_typedef)
    <52c>   DW_AT_name        : (indirect string, offset: 0xe8ca0): HAL_StatusTypeDef
    <530>   DW_AT_decl_file   : 9
    <531>   DW_AT_decl_line   : 44
    <532>   DW_AT_decl_column : 3
    <533>   DW_AT_type        : <0x504>
 <1><537>: Abbrev Number: 12 (DW_TAG_structure_type)
    <538>   DW_AT_byte_size   : 28
    <539>   DW_AT_decl_file   : 10
    <539>   DW_AT_decl_line   : 45
    <53a>   DW_AT_decl_column : 9
    <53a>   DW_AT_sibling     : <0x58c>
 <2><53e>: Abbrev Number: 2 (DW_TAG_member)
    <53f>   DW_AT_name        : (indirect string, offset: 0xe8b6f): PLLState
    <543>   DW_AT_decl_file   : 10
    <543>   DW_AT_decl_line   : 47
    <544>   DW_AT_decl_column : 12
    <544>   DW_AT_type        : <0x1d6>
    <548>   DW_AT_data_member_location: 0
 <2><549>: Abbrev Number: 2 (DW_TAG_member)
    <54a>   DW_AT_name        : (indirect string, offset: 0xe8b93): PLLSource
    <54e>   DW_AT_decl_file   : 10
    <54e>   DW_AT_decl_line   : 50
    <54f>   DW_AT_decl_column : 12
    <54f>   DW_AT_type        : <0x1d6>
    <553>   DW_AT_data_member_location: 4
 <2><554>: Abbrev Number: 2 (DW_TAG_member)
    <555>   DW_AT_name        : (indirect string, offset: 0xe8b5e): PLLM
    <559>   DW_AT_decl_file   : 10
    <559>   DW_AT_decl_line   : 53
    <55a>   DW_AT_decl_column : 12
    <55a>   DW_AT_type        : <0x1d6>
    <55e>   DW_AT_data_member_location: 8
 <2><55f>: Abbrev Number: 2 (DW_TAG_member)
    <560>   DW_AT_name        : (indirect string, offset: 0xe8be7): PLLN
    <564>   DW_AT_decl_file   : 10
    <564>   DW_AT_decl_line   : 57
    <565>   DW_AT_decl_column : 12
    <565>   DW_AT_type        : <0x1d6>
    <569>   DW_AT_data_member_location: 12
 <2><56a>: Abbrev Number: 2 (DW_TAG_member)
    <56b>   DW_AT_name        : (indirect string, offset: 0xe8bec): PLLP
    <56f>   DW_AT_decl_file   : 10
    <56f>   DW_AT_decl_line   : 61
    <570>   DW_AT_decl_column : 12
    <570>   DW_AT_type        : <0x1d6>
    <574>   DW_AT_data_member_location: 16
 <2><575>: Abbrev Number: 2 (DW_TAG_member)
    <576>   DW_AT_name        : (indirect string, offset: 0xa839d): PLLQ
    <57a>   DW_AT_decl_file   : 10
    <57a>   DW_AT_decl_line   : 65
    <57b>   DW_AT_decl_column : 12
    <57b>   DW_AT_type        : <0x1d6>
    <57f>   DW_AT_data_member_location: 20
 <2><580>: Abbrev Number: 2 (DW_TAG_member)
    <581>   DW_AT_name        : (indirect string, offset: 0xe8bf1): PLLR
    <585>   DW_AT_decl_file   : 10
    <585>   DW_AT_decl_line   : 68
    <586>   DW_AT_decl_column : 12
    <586>   DW_AT_type        : <0x1d6>
    <58a>   DW_AT_data_member_location: 24
 <2><58b>: Abbrev Number: 0
 <1><58c>: Abbrev Number: 3 (DW_TAG_typedef)
    <58d>   DW_AT_name        : (indirect string, offset: 0xe8b20): RCC_PLLInitTypeDef
    <591>   DW_AT_decl_file   : 10
    <592>   DW_AT_decl_line   : 73
    <593>   DW_AT_decl_column : 2
    <594>   DW_AT_type        : <0x537>
 <1><598>: Abbrev Number: 12 (DW_TAG_structure_type)
    <599>   DW_AT_byte_size   : 68
    <59a>   DW_AT_decl_file   : 10
    <59a>   DW_AT_decl_line   : 78
    <59b>   DW_AT_decl_column : 9
    <59b>   DW_AT_sibling     : <0x61b>
 <2><59f>: Abbrev Number: 2 (DW_TAG_member)
    <5a0>   DW_AT_name        : (indirect string, offset: 0xe8bca): OscillatorType
    <5a4>   DW_AT_decl_file   : 10
    <5a4>   DW_AT_decl_line   : 80
    <5a5>   DW_AT_decl_column : 12
    <5a5>   DW_AT_type        : <0x1d6>
    <5a9>   DW_AT_data_member_location: 0
 <2><5aa>: Abbrev Number: 2 (DW_TAG_member)
    <5ab>   DW_AT_name        : (indirect string, offset: 0xe8b78): HSEState
    <5af>   DW_AT_decl_file   : 10
    <5af>   DW_AT_decl_line   : 83
    <5b0>   DW_AT_decl_column : 12
    <5b0>   DW_AT_type        : <0x1d6>
    <5b4>   DW_AT_data_member_location: 4
 <2><5b5>: Abbrev Number: 2 (DW_TAG_member)
    <5b6>   DW_AT_name        : (indirect string, offset: 0xe8a29): LSEState
    <5ba>   DW_AT_decl_file   : 10
    <5ba>   DW_AT_decl_line   : 86
    <5bb>   DW_AT_decl_column : 12
    <5bb>   DW_AT_type        : <0x1d6>
    <5bf>   DW_AT_data_member_location: 8
 <2><5c0>: Abbrev Number: 2 (DW_TAG_member)
    <5c1>   DW_AT_name        : (indirect string, offset: 0xe8a49): HSIState
    <5c5>   DW_AT_decl_file   : 10
    <5c5>   DW_AT_decl_line   : 89
    <5c6>   DW_AT_decl_column : 12
    <5c6>   DW_AT_type        : <0x1d6>
    <5ca>   DW_AT_data_member_location: 12
 <2><5cb>: Abbrev Number: 2 (DW_TAG_member)
    <5cc>   DW_AT_name        : (indirect string, offset: 0xe8c0f): HSICalibrationValue
    <5d0>   DW_AT_decl_file   : 10
    <5d0>   DW_AT_decl_line   : 92
    <5d1>   DW_AT_decl_column : 12
    <5d1>   DW_AT_type        : <0x1d6>
    <5d5>   DW_AT_data_member_location: 16
 <2><5d6>: Abbrev Number: 2 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0xe8a04): LSIState
    <5db>   DW_AT_decl_file   : 10
    <5db>   DW_AT_decl_line   : 98
    <5dc>   DW_AT_decl_column : 12
    <5dc>   DW_AT_type        : <0x1d6>
    <5e0>   DW_AT_data_member_location: 20
 <2><5e1>: Abbrev Number: 2 (DW_TAG_member)
    <5e2>   DW_AT_name        : (indirect string, offset: 0xe89fb): MSIState
    <5e6>   DW_AT_decl_file   : 10
    <5e6>   DW_AT_decl_line   : 106
    <5e7>   DW_AT_decl_column : 12
    <5e7>   DW_AT_type        : <0x1d6>
    <5eb>   DW_AT_data_member_location: 24
 <2><5ec>: Abbrev Number: 2 (DW_TAG_member)
    <5ed>   DW_AT_name        : (indirect string, offset: 0xe89a8): MSICalibrationValue
    <5f1>   DW_AT_decl_file   : 10
    <5f1>   DW_AT_decl_line   : 109
    <5f2>   DW_AT_decl_column : 12
    <5f2>   DW_AT_type        : <0x1d6>
    <5f6>   DW_AT_data_member_location: 28
 <2><5f7>: Abbrev Number: 2 (DW_TAG_member)
    <5f8>   DW_AT_name        : (indirect string, offset: 0xe8a94): MSIClockRange
    <5fc>   DW_AT_decl_file   : 10
    <5fc>   DW_AT_decl_line   : 112
    <5fd>   DW_AT_decl_column : 12
    <5fd>   DW_AT_type        : <0x1d6>
    <601>   DW_AT_data_member_location: 32
 <2><602>: Abbrev Number: 2 (DW_TAG_member)
    <603>   DW_AT_name        : (indirect string, offset: 0xe8ba5): HSI48State
    <607>   DW_AT_decl_file   : 10
    <607>   DW_AT_decl_line   : 115
    <608>   DW_AT_decl_column : 12
    <608>   DW_AT_type        : <0x1d6>
    <60c>   DW_AT_data_member_location: 36
 <2><60d>: Abbrev Number: 26 (DW_TAG_member)
    <60e>   DW_AT_name        : PLL
    <612>   DW_AT_decl_file   : 10
    <613>   DW_AT_decl_line   : 118
    <614>   DW_AT_decl_column : 22
    <615>   DW_AT_type        : <0x58c>
    <619>   DW_AT_data_member_location: 40
 <2><61a>: Abbrev Number: 0
 <1><61b>: Abbrev Number: 3 (DW_TAG_typedef)
    <61c>   DW_AT_name        : (indirect string, offset: 0xe8aa2): RCC_OscInitTypeDef
    <620>   DW_AT_decl_file   : 10
    <621>   DW_AT_decl_line   : 120
    <622>   DW_AT_decl_column : 2
    <623>   DW_AT_type        : <0x598>
 <1><627>: Abbrev Number: 12 (DW_TAG_structure_type)
    <628>   DW_AT_byte_size   : 20
    <629>   DW_AT_decl_file   : 10
    <629>   DW_AT_decl_line   : 125
    <62a>   DW_AT_decl_column : 9
    <62a>   DW_AT_sibling     : <0x666>
 <2><62e>: Abbrev Number: 2 (DW_TAG_member)
    <62f>   DW_AT_name        : (indirect string, offset: 0xe89c2): ClockType
    <633>   DW_AT_decl_file   : 10
    <633>   DW_AT_decl_line   : 127
    <634>   DW_AT_decl_column : 12
    <634>   DW_AT_type        : <0x1d6>
    <638>   DW_AT_data_member_location: 0
 <2><639>: Abbrev Number: 2 (DW_TAG_member)
    <63a>   DW_AT_name        : (indirect string, offset: 0xe8b08): SYSCLKSource
    <63e>   DW_AT_decl_file   : 10
    <63e>   DW_AT_decl_line   : 130
    <63f>   DW_AT_decl_column : 12
    <63f>   DW_AT_type        : <0x1d6>
    <643>   DW_AT_data_member_location: 4
 <2><644>: Abbrev Number: 2 (DW_TAG_member)
    <645>   DW_AT_name        : (indirect string, offset: 0xe8bd9): AHBCLKDivider
    <649>   DW_AT_decl_file   : 10
    <649>   DW_AT_decl_line   : 133
    <64a>   DW_AT_decl_column : 12
    <64a>   DW_AT_type        : <0x1d6>
    <64e>   DW_AT_data_member_location: 8
 <2><64f>: Abbrev Number: 2 (DW_TAG_member)
    <650>   DW_AT_name        : (indirect string, offset: 0xe891d): APB1CLKDivider
    <654>   DW_AT_decl_file   : 10
    <654>   DW_AT_decl_line   : 136
    <655>   DW_AT_decl_column : 12
    <655>   DW_AT_type        : <0x1d6>
    <659>   DW_AT_data_member_location: 12
 <2><65a>: Abbrev Number: 2 (DW_TAG_member)
    <65b>   DW_AT_name        : (indirect string, offset: 0xe8a5a): APB2CLKDivider
    <65f>   DW_AT_decl_file   : 10
    <65f>   DW_AT_decl_line   : 139
    <660>   DW_AT_decl_column : 12
    <660>   DW_AT_type        : <0x1d6>
    <664>   DW_AT_data_member_location: 16
 <2><665>: Abbrev Number: 0
 <1><666>: Abbrev Number: 3 (DW_TAG_typedef)
    <667>   DW_AT_name        : (indirect string, offset: 0xe89cc): RCC_ClkInitTypeDef
    <66b>   DW_AT_decl_file   : 10
    <66c>   DW_AT_decl_line   : 142
    <66d>   DW_AT_decl_column : 2
    <66e>   DW_AT_type        : <0x627>
 <1><672>: Abbrev Number: 6 (DW_TAG_const_type)
    <673>   DW_AT_type        : <0x666>
 <1><677>: Abbrev Number: 15 (DW_TAG_array_type)
    <678>   DW_AT_type        : <0x1d1>
    <67c>   DW_AT_sibling     : <0x687>
 <2><680>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <681>   DW_AT_type        : <0x15b>
    <685>   DW_AT_upper_bound : 6
 <2><686>: Abbrev Number: 0
 <1><687>: Abbrev Number: 6 (DW_TAG_const_type)
    <688>   DW_AT_type        : <0x677>
 <1><68c>: Abbrev Number: 9 (DW_TAG_variable)
    <68d>   DW_AT_name        : (indirect string, offset: 0x2d6ad): CHANNEL_OFFSET_TAB
    <691>   DW_AT_decl_file   : 12
    <692>   DW_AT_decl_line   : 49
    <693>   DW_AT_decl_column : 22
    <694>   DW_AT_type        : <0x687>
    <698>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><69e>: Abbrev Number: 11 (DW_TAG_subprogram)
    <69f>   DW_AT_external    : 1
    <69f>   DW_AT_name        : (indirect string, offset: 0xe8bf6): HAL_RCC_ClockConfig
    <6a3>   DW_AT_decl_file   : 10
    <6a4>   DW_AT_decl_line   : 4837
    <6a6>   DW_AT_decl_column : 19
    <6a7>   DW_AT_prototyped  : 1
    <6a7>   DW_AT_type        : <0x52b>
    <6ab>   DW_AT_declaration : 1
    <6ab>   DW_AT_sibling     : <0x6ba>
 <2><6af>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <6b0>   DW_AT_type        : <0x6ba>
 <2><6b4>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <6b5>   DW_AT_type        : <0x1d6>
 <2><6b9>: Abbrev Number: 0
 <1><6ba>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6bb>   DW_AT_byte_size   : 4
    <6bb>   DW_AT_type        : <0x672>
 <1><6bf>: Abbrev Number: 11 (DW_TAG_subprogram)
    <6c0>   DW_AT_external    : 1
    <6c0>   DW_AT_name        : (indirect string, offset: 0xe8b81): HAL_RCC_OscConfig
    <6c4>   DW_AT_decl_file   : 10
    <6c5>   DW_AT_decl_line   : 4836
    <6c7>   DW_AT_decl_column : 19
    <6c8>   DW_AT_prototyped  : 1
    <6c8>   DW_AT_type        : <0x52b>
    <6cc>   DW_AT_declaration : 1
    <6cc>   DW_AT_sibling     : <0x6d6>
 <2><6d0>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <6d1>   DW_AT_type        : <0x6d6>
 <2><6d5>: Abbrev Number: 0
 <1><6d6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6d7>   DW_AT_byte_size   : 4
    <6d7>   DW_AT_type        : <0x61b>
 <1><6db>: Abbrev Number: 11 (DW_TAG_subprogram)
    <6dc>   DW_AT_external    : 1
    <6dc>   DW_AT_name        : (indirect string, offset: 0xe892c): HAL_PWREx_ControlVoltageScaling
    <6e0>   DW_AT_decl_file   : 11
    <6e1>   DW_AT_decl_line   : 837
    <6e3>   DW_AT_decl_column : 19
    <6e4>   DW_AT_prototyped  : 1
    <6e4>   DW_AT_type        : <0x52b>
    <6e8>   DW_AT_declaration : 1
    <6e8>   DW_AT_sibling     : <0x6f2>
 <2><6ec>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <6ed>   DW_AT_type        : <0x1d6>
 <2><6f1>: Abbrev Number: 0
 <1><6f2>: Abbrev Number: 27 (DW_TAG_subprogram)
    <6f3>   DW_AT_external    : 1
    <6f3>   DW_AT_name        : (indirect string, offset: 0xe8add): vTaskDelay
    <6f7>   DW_AT_decl_file   : 7
    <6f8>   DW_AT_decl_line   : 859
    <6fa>   DW_AT_decl_column : 6
    <6fb>   DW_AT_prototyped  : 1
    <6fb>   DW_AT_declaration : 1
    <6fb>   DW_AT_sibling     : <0x705>
 <2><6ff>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <700>   DW_AT_type        : <0x24b>
 <2><704>: Abbrev Number: 0
 <1><705>: Abbrev Number: 11 (DW_TAG_subprogram)
    <706>   DW_AT_external    : 1
    <706>   DW_AT_name        : (indirect string, offset: 0xe8afc): xTaskCreate
    <70a>   DW_AT_decl_file   : 7
    <70b>   DW_AT_decl_line   : 385
    <70d>   DW_AT_decl_column : 16
    <70e>   DW_AT_prototyped  : 1
    <70e>   DW_AT_type        : <0x227>
    <712>   DW_AT_declaration : 1
    <712>   DW_AT_sibling     : <0x735>
 <2><716>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <717>   DW_AT_type        : <0x1f3>
 <2><71b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <71c>   DW_AT_type        : <0x26b>
 <2><720>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <721>   DW_AT_type        : <0x222>
 <2><725>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <726>   DW_AT_type        : <0x211>
 <2><72a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <72b>   DW_AT_type        : <0x233>
 <2><72f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <730>   DW_AT_type        : <0x73a>
 <2><734>: Abbrev Number: 0
 <1><735>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <736>   DW_AT_byte_size   : 4
    <736>   DW_AT_type        : <0x250>
 <1><73a>: Abbrev Number: 6 (DW_TAG_const_type)
    <73b>   DW_AT_type        : <0x735>
 <1><73f>: Abbrev Number: 18 (DW_TAG_subprogram)
    <740>   DW_AT_external    : 1
    <740>   DW_AT_name        : (indirect string, offset: 0x6454e): vApplicationTickHook
    <744>   DW_AT_decl_file   : 7
    <744>   DW_AT_decl_line   : 1986
    <746>   DW_AT_decl_column : 10
    <747>   DW_AT_prototyped  : 1
    <747>   DW_AT_declaration : 1
 <1><747>: Abbrev Number: 18 (DW_TAG_subprogram)
    <748>   DW_AT_external    : 1
    <748>   DW_AT_name        : (indirect string, offset: 0xe8ac9): vTaskStartScheduler
    <74c>   DW_AT_decl_file   : 7
    <74c>   DW_AT_decl_line   : 1520
    <74e>   DW_AT_decl_column : 6
    <74f>   DW_AT_prototyped  : 1
    <74f>   DW_AT_declaration : 1
 <1><74f>: Abbrev Number: 28 (DW_TAG_subprogram)
    <750>   DW_AT_external    : 1
    <750>   DW_AT_name        : (indirect string, offset: 0xe8c5b): HAL_Init
    <754>   DW_AT_decl_file   : 13
    <755>   DW_AT_decl_line   : 636
    <757>   DW_AT_decl_column : 19
    <758>   DW_AT_prototyped  : 1
    <758>   DW_AT_type        : <0x52b>
    <75c>   DW_AT_declaration : 1
 <1><75c>: Abbrev Number: 29 (DW_TAG_subprogram)
    <75d>   DW_AT_external    : 1
    <75d>   DW_AT_name        : (indirect string, offset: 0xe8a3b): Error_Handler
    <761>   DW_AT_decl_file   : 1
    <762>   DW_AT_decl_line   : 91
    <763>   DW_AT_decl_column : 6
    <764>   DW_AT_prototyped  : 1
    <764>   DW_AT_low_pc      : 0x8000730
    <768>   DW_AT_high_pc     : 0xc
    <76c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <76e>   DW_AT_call_all_calls: 1
    <76e>   DW_AT_sibling     : <0x783>
 <2><772>: Abbrev Number: 30 (DW_TAG_inlined_subroutine)
    <773>   DW_AT_abstract_origin: <0x83e>
    <777>   DW_AT_low_pc      : 0x8000734
    <77b>   DW_AT_high_pc     : 0x4
    <77f>   DW_AT_call_file   : 1
    <780>   DW_AT_call_line   : 93
    <781>   DW_AT_call_column : 3
 <2><782>: Abbrev Number: 0
 <1><783>: Abbrev Number: 19 (DW_TAG_subprogram)
    <784>   DW_AT_external    : 1
    <784>   DW_AT_name        : (indirect string, offset: 0xe8c2b): SystemClock_Config
    <788>   DW_AT_decl_file   : 1
    <788>   DW_AT_decl_line   : 58
    <789>   DW_AT_decl_column : 6
    <789>   DW_AT_prototyped  : 1
    <789>   DW_AT_low_pc      : 0x80006a4
    <78d>   DW_AT_high_pc     : 0x8c
    <791>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <793>   DW_AT_call_all_tail_calls: 1
    <793>   DW_AT_sibling     : <0x7b8>
 <2><797>: Abbrev Number: 9 (DW_TAG_variable)
    <798>   DW_AT_name        : (indirect string, offset: 0xe8969): RCC_OscInitStruct
    <79c>   DW_AT_decl_file   : 1
    <79d>   DW_AT_decl_line   : 60
    <79e>   DW_AT_decl_column : 22
    <79f>   DW_AT_type        : <0x61b>
    <7a3>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><7a7>: Abbrev Number: 9 (DW_TAG_variable)
    <7a8>   DW_AT_name        : (indirect string, offset: 0xe8a17): RCC_ClkInitStruct
    <7ac>   DW_AT_decl_file   : 1
    <7ad>   DW_AT_decl_line   : 61
    <7ae>   DW_AT_decl_column : 22
    <7af>   DW_AT_type        : <0x666>
    <7b3>   DW_AT_location    : 3 byte block: 91 a0 7f 	(DW_OP_fbreg: -96)
 <2><7b7>: Abbrev Number: 0
 <1><7b8>: Abbrev Number: 31 (DW_TAG_subprogram)
    <7b9>   DW_AT_external    : 1
    <7b9>   DW_AT_name        : (indirect string, offset: 0xe8b3d): GPIOPortAConfig
    <7bd>   DW_AT_decl_file   : 1
    <7be>   DW_AT_decl_line   : 45
    <7bf>   DW_AT_decl_column : 6
    <7c0>   DW_AT_prototyped  : 1
    <7c0>   DW_AT_low_pc      : 0x8000664
    <7c4>   DW_AT_high_pc     : 0x40
    <7c8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7ca>   DW_AT_call_all_calls: 1
 <1><7ca>: Abbrev Number: 19 (DW_TAG_subprogram)
    <7cb>   DW_AT_external    : 1
    <7cb>   DW_AT_name        : (indirect string, offset: 0xe8b15): vHeartbeat
    <7cf>   DW_AT_decl_file   : 1
    <7cf>   DW_AT_decl_line   : 34
    <7d0>   DW_AT_decl_column : 6
    <7d0>   DW_AT_prototyped  : 1
    <7d0>   DW_AT_low_pc      : 0x8000520
    <7d4>   DW_AT_high_pc     : 0x142
    <7d8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7da>   DW_AT_call_all_tail_calls: 1
    <7da>   DW_AT_sibling     : <0x7fd>
 <2><7de>: Abbrev Number: 32 (DW_TAG_formal_parameter)
    <7df>   DW_AT_name        : (indirect string, offset: 0xe88f2): pvParameters
    <7e3>   DW_AT_decl_file   : 1
    <7e4>   DW_AT_decl_line   : 34
    <7e5>   DW_AT_decl_column : 23
    <7e6>   DW_AT_type        : <0x20f>
    <7ea>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><7ed>: Abbrev Number: 9 (DW_TAG_variable)
    <7ee>   DW_AT_name        : (indirect string, offset: 0xe8ccb): rate
    <7f2>   DW_AT_decl_file   : 1
    <7f3>   DW_AT_decl_line   : 35
    <7f4>   DW_AT_decl_column : 12
    <7f5>   DW_AT_type        : <0x7fd>
    <7f9>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><7fc>: Abbrev Number: 0
 <1><7fd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <7fe>   DW_AT_byte_size   : 4
    <7fe>   DW_AT_type        : <0x1d6>
 <1><802>: Abbrev Number: 33 (DW_TAG_subprogram)
    <803>   DW_AT_name        : (indirect string, offset: 0xe8980): prvCreateTasks
    <807>   DW_AT_decl_file   : 1
    <808>   DW_AT_decl_line   : 28
    <809>   DW_AT_decl_column : 13
    <80a>   DW_AT_prototyped  : 1
    <80a>   DW_AT_low_pc      : 0x80004f0
    <80e>   DW_AT_high_pc     : 0x30
    <812>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <814>   DW_AT_call_all_tail_calls: 1
    <814>   DW_AT_sibling     : <0x828>
 <2><818>: Abbrev Number: 9 (DW_TAG_variable)
    <819>   DW_AT_name        : (indirect string, offset: 0xe8ccb): rate
    <81d>   DW_AT_decl_file   : 1
    <81e>   DW_AT_decl_line   : 29
    <81f>   DW_AT_decl_column : 11
    <820>   DW_AT_type        : <0x1d6>
    <824>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><827>: Abbrev Number: 0
 <1><828>: Abbrev Number: 34 (DW_TAG_subprogram)
    <829>   DW_AT_external    : 1
    <829>   DW_AT_name        : (indirect string, offset: 0xe8907): main
    <82d>   DW_AT_decl_file   : 1
    <82e>   DW_AT_decl_line   : 13
    <82f>   DW_AT_decl_column : 5
    <830>   DW_AT_prototyped  : 1
    <830>   DW_AT_type        : <0x154>
    <834>   DW_AT_low_pc      : 0x80004d2
    <838>   DW_AT_high_pc     : 0x1e
    <83c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <83e>   DW_AT_call_all_tail_calls: 1
 <1><83e>: Abbrev Number: 35 (DW_TAG_subprogram)
    <83f>   DW_AT_name        : (indirect string, offset: 0xe8ab5): __disable_irq
    <843>   DW_AT_decl_file   : 2
    <844>   DW_AT_decl_line   : 207
    <845>   DW_AT_decl_column : 27
    <846>   DW_AT_prototyped  : 1
    <846>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><847>: Abbrev Number: 0
  Compilation Unit @ offset 0x848:
   Length:        0x2fd (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x30e
   Pointer Size:  4
 <0><854>: Abbrev Number: 7 (DW_TAG_compile_unit)
    <855>   DW_AT_producer    : (indirect string, offset: 0x3c767): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <859>   DW_AT_language    : 29	(C11)
    <85a>   DW_AT_name        : (indirect string, offset: 0xe8ce3): ../Core/Src/stm32l4xx_hal_msp.c
    <85e>   DW_AT_comp_dir    : (indirect string, offset: 0x7fb10): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <862>   DW_AT_ranges      : 0x58
    <866>   DW_AT_low_pc      : 0
    <86a>   DW_AT_stmt_list   : 0x107f
    <86e>   DW_AT_macros      : 0x25088
 <1><872>: Abbrev Number: 2 (DW_TAG_base_type)
    <873>   DW_AT_byte_size   : 1
    <874>   DW_AT_encoding    : 6	(signed char)
    <875>   DW_AT_name        : (indirect string, offset: 0x751ec): signed char
 <1><879>: Abbrev Number: 3 (DW_TAG_typedef)
    <87a>   DW_AT_name        : (indirect string, offset: 0x4354d): __uint8_t
    <87e>   DW_AT_decl_file   : 2
    <87f>   DW_AT_decl_line   : 43
    <880>   DW_AT_decl_column : 24
    <881>   DW_AT_type        : <0x885>
 <1><885>: Abbrev Number: 2 (DW_TAG_base_type)
    <886>   DW_AT_byte_size   : 1
    <887>   DW_AT_encoding    : 8	(unsigned char)
    <888>   DW_AT_name        : (indirect string, offset: 0xdfda1): unsigned char
 <1><88c>: Abbrev Number: 2 (DW_TAG_base_type)
    <88d>   DW_AT_byte_size   : 2
    <88e>   DW_AT_encoding    : 5	(signed)
    <88f>   DW_AT_name        : (indirect string, offset: 0xac250): short int
 <1><893>: Abbrev Number: 2 (DW_TAG_base_type)
    <894>   DW_AT_byte_size   : 2
    <895>   DW_AT_encoding    : 7	(unsigned)
    <896>   DW_AT_name        : (indirect string, offset: 0xde34b): short unsigned int
 <1><89a>: Abbrev Number: 2 (DW_TAG_base_type)
    <89b>   DW_AT_byte_size   : 4
    <89c>   DW_AT_encoding    : 5	(signed)
    <89d>   DW_AT_name        : (indirect string, offset: 0x135b8): long int
 <1><8a1>: Abbrev Number: 3 (DW_TAG_typedef)
    <8a2>   DW_AT_name        : (indirect string, offset: 0xe8b4d): __uint32_t
    <8a6>   DW_AT_decl_file   : 2
    <8a7>   DW_AT_decl_line   : 79
    <8a8>   DW_AT_decl_column : 25
    <8a9>   DW_AT_type        : <0x8ad>
 <1><8ad>: Abbrev Number: 2 (DW_TAG_base_type)
    <8ae>   DW_AT_byte_size   : 4
    <8af>   DW_AT_encoding    : 7	(unsigned)
    <8b0>   DW_AT_name        : (indirect string, offset: 0x58285): long unsigned int
 <1><8b4>: Abbrev Number: 2 (DW_TAG_base_type)
    <8b5>   DW_AT_byte_size   : 8
    <8b6>   DW_AT_encoding    : 5	(signed)
    <8b7>   DW_AT_name        : (indirect string, offset: 0x69985): long long int
 <1><8bb>: Abbrev Number: 2 (DW_TAG_base_type)
    <8bc>   DW_AT_byte_size   : 8
    <8bd>   DW_AT_encoding    : 7	(unsigned)
    <8be>   DW_AT_name        : (indirect string, offset: 0x3004c): long long unsigned int
 <1><8c2>: Abbrev Number: 8 (DW_TAG_base_type)
    <8c3>   DW_AT_byte_size   : 4
    <8c4>   DW_AT_encoding    : 5	(signed)
    <8c5>   DW_AT_name        : int
 <1><8c9>: Abbrev Number: 2 (DW_TAG_base_type)
    <8ca>   DW_AT_byte_size   : 4
    <8cb>   DW_AT_encoding    : 7	(unsigned)
    <8cc>   DW_AT_name        : (indirect string, offset: 0x12ac1): unsigned int
 <1><8d0>: Abbrev Number: 3 (DW_TAG_typedef)
    <8d1>   DW_AT_name        : (indirect string, offset: 0x4354f): uint8_t
    <8d5>   DW_AT_decl_file   : 3
    <8d6>   DW_AT_decl_line   : 24
    <8d7>   DW_AT_decl_column : 19
    <8d8>   DW_AT_type        : <0x879>
 <1><8dc>: Abbrev Number: 5 (DW_TAG_const_type)
    <8dd>   DW_AT_type        : <0x8d0>
 <1><8e1>: Abbrev Number: 3 (DW_TAG_typedef)
    <8e2>   DW_AT_name        : (indirect string, offset: 0xa82d1): uint32_t
    <8e6>   DW_AT_decl_file   : 3
    <8e7>   DW_AT_decl_line   : 48
    <8e8>   DW_AT_decl_column : 20
    <8e9>   DW_AT_type        : <0x8a1>
 <1><8ed>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <8ee>   DW_AT_type        : <0x8e1>
 <1><8f2>: Abbrev Number: 10 (DW_TAG_structure_type)
    <8f3>   DW_AT_byte_size   : 152
    <8f4>   DW_AT_decl_file   : 4
    <8f5>   DW_AT_decl_line   : 685
    <8f7>   DW_AT_decl_column : 9
    <8f8>   DW_AT_sibling     : <0xac4>
 <2><8fc>: Abbrev Number: 6 (DW_TAG_member)
    <8fd>   DW_AT_name        : CR
    <900>   DW_AT_decl_file   : 4
    <900>   DW_AT_decl_line   : 687
    <902>   DW_AT_decl_column : 17
    <902>   DW_AT_type        : <0x8ed>
    <906>   DW_AT_data_member_location: 0
 <2><907>: Abbrev Number: 1 (DW_TAG_member)
    <908>   DW_AT_name        : (indirect string, offset: 0xe8ac3): ICSCR
    <90c>   DW_AT_decl_file   : 4
    <90c>   DW_AT_decl_line   : 688
    <90e>   DW_AT_decl_column : 17
    <90e>   DW_AT_type        : <0x8ed>
    <912>   DW_AT_data_member_location: 4
 <2><913>: Abbrev Number: 1 (DW_TAG_member)
    <914>   DW_AT_name        : (indirect string, offset: 0xe89ef): CFGR
    <918>   DW_AT_decl_file   : 4
    <918>   DW_AT_decl_line   : 689
    <91a>   DW_AT_decl_column : 17
    <91a>   DW_AT_type        : <0x8ed>
    <91e>   DW_AT_data_member_location: 8
 <2><91f>: Abbrev Number: 1 (DW_TAG_member)
    <920>   DW_AT_name        : (indirect string, offset: 0xe8b9d): PLLCFGR
    <924>   DW_AT_decl_file   : 4
    <924>   DW_AT_decl_line   : 690
    <926>   DW_AT_decl_column : 17
    <926>   DW_AT_type        : <0x8ed>
    <92a>   DW_AT_data_member_location: 12
 <2><92b>: Abbrev Number: 1 (DW_TAG_member)
    <92c>   DW_AT_name        : (indirect string, offset: 0xe89e8): PLLSAI1CFGR
    <930>   DW_AT_decl_file   : 4
    <930>   DW_AT_decl_line   : 691
    <932>   DW_AT_decl_column : 17
    <932>   DW_AT_type        : <0x8ed>
    <936>   DW_AT_data_member_location: 16
 <2><937>: Abbrev Number: 1 (DW_TAG_member)
    <938>   DW_AT_name        : (indirect string, offset: 0xe8b63): PLLSAI2CFGR
    <93c>   DW_AT_decl_file   : 4
    <93c>   DW_AT_decl_line   : 692
    <93e>   DW_AT_decl_column : 17
    <93e>   DW_AT_type        : <0x8ed>
    <942>   DW_AT_data_member_location: 20
 <2><943>: Abbrev Number: 1 (DW_TAG_member)
    <944>   DW_AT_name        : (indirect string, offset: 0xe88c5): CIER
    <948>   DW_AT_decl_file   : 4
    <948>   DW_AT_decl_line   : 693
    <94a>   DW_AT_decl_column : 17
    <94a>   DW_AT_type        : <0x8ed>
    <94e>   DW_AT_data_member_location: 24
 <2><94f>: Abbrev Number: 1 (DW_TAG_member)
    <950>   DW_AT_name        : (indirect string, offset: 0xe88c0): CIFR
    <954>   DW_AT_decl_file   : 4
    <954>   DW_AT_decl_line   : 694
    <956>   DW_AT_decl_column : 17
    <956>   DW_AT_type        : <0x8ed>
    <95a>   DW_AT_data_member_location: 28
 <2><95b>: Abbrev Number: 1 (DW_TAG_member)
    <95c>   DW_AT_name        : (indirect string, offset: 0xe88b6): CICR
    <960>   DW_AT_decl_file   : 4
    <960>   DW_AT_decl_line   : 695
    <962>   DW_AT_decl_column : 17
    <962>   DW_AT_type        : <0x8ed>
    <966>   DW_AT_data_member_location: 32
 <2><967>: Abbrev Number: 1 (DW_TAG_member)
    <968>   DW_AT_name        : (indirect string, offset: 0xe8c64): RESERVED0
    <96c>   DW_AT_decl_file   : 4
    <96c>   DW_AT_decl_line   : 696
    <96e>   DW_AT_decl_column : 17
    <96e>   DW_AT_type        : <0x8e1>
    <972>   DW_AT_data_member_location: 36
 <2><973>: Abbrev Number: 1 (DW_TAG_member)
    <974>   DW_AT_name        : (indirect string, offset: 0xe8bc1): AHB1RSTR
    <978>   DW_AT_decl_file   : 4
    <978>   DW_AT_decl_line   : 697
    <97a>   DW_AT_decl_column : 17
    <97a>   DW_AT_type        : <0x8ed>
    <97e>   DW_AT_data_member_location: 40
 <2><97f>: Abbrev Number: 1 (DW_TAG_member)
    <980>   DW_AT_name        : (indirect string, offset: 0xe890c): AHB2RSTR
    <984>   DW_AT_decl_file   : 4
    <984>   DW_AT_decl_line   : 698
    <986>   DW_AT_decl_column : 17
    <986>   DW_AT_type        : <0x8ed>
    <98a>   DW_AT_data_member_location: 44
 <2><98b>: Abbrev Number: 1 (DW_TAG_member)
    <98c>   DW_AT_name        : (indirect string, offset: 0xe89df): AHB3RSTR
    <990>   DW_AT_decl_file   : 4
    <990>   DW_AT_decl_line   : 699
    <992>   DW_AT_decl_column : 17
    <992>   DW_AT_type        : <0x8ed>
    <996>   DW_AT_data_member_location: 48
 <2><997>: Abbrev Number: 1 (DW_TAG_member)
    <998>   DW_AT_name        : (indirect string, offset: 0xe8c6e): RESERVED1
    <99c>   DW_AT_decl_file   : 4
    <99c>   DW_AT_decl_line   : 700
    <99e>   DW_AT_decl_column : 17
    <99e>   DW_AT_type        : <0x8e1>
    <9a2>   DW_AT_data_member_location: 52
 <2><9a3>: Abbrev Number: 1 (DW_TAG_member)
    <9a4>   DW_AT_name        : (indirect string, offset: 0xe8955): APB1RSTR1
    <9a8>   DW_AT_decl_file   : 4
    <9a8>   DW_AT_decl_line   : 701
    <9aa>   DW_AT_decl_column : 17
    <9aa>   DW_AT_type        : <0x8ed>
    <9ae>   DW_AT_data_member_location: 56
 <2><9af>: Abbrev Number: 1 (DW_TAG_member)
    <9b0>   DW_AT_name        : (indirect string, offset: 0xe895f): APB1RSTR2
    <9b4>   DW_AT_decl_file   : 4
    <9b4>   DW_AT_decl_line   : 702
    <9b6>   DW_AT_decl_column : 17
    <9b6>   DW_AT_type        : <0x8ed>
    <9ba>   DW_AT_data_member_location: 60
 <2><9bb>: Abbrev Number: 1 (DW_TAG_member)
    <9bc>   DW_AT_name        : (indirect string, offset: 0xe8a32): APB2RSTR
    <9c0>   DW_AT_decl_file   : 4
    <9c0>   DW_AT_decl_line   : 703
    <9c2>   DW_AT_decl_column : 17
    <9c2>   DW_AT_type        : <0x8ed>
    <9c6>   DW_AT_data_member_location: 64
 <2><9c7>: Abbrev Number: 1 (DW_TAG_member)
    <9c8>   DW_AT_name        : (indirect string, offset: 0xe8c78): RESERVED2
    <9cc>   DW_AT_decl_file   : 4
    <9cc>   DW_AT_decl_line   : 704
    <9ce>   DW_AT_decl_column : 17
    <9ce>   DW_AT_type        : <0x8e1>
    <9d2>   DW_AT_data_member_location: 68
 <2><9d3>: Abbrev Number: 1 (DW_TAG_member)
    <9d4>   DW_AT_name        : (indirect string, offset: 0xe88ff): AHB1ENR
    <9d8>   DW_AT_decl_file   : 4
    <9d8>   DW_AT_decl_line   : 705
    <9da>   DW_AT_decl_column : 17
    <9da>   DW_AT_type        : <0x8ed>
    <9de>   DW_AT_data_member_location: 72
 <2><9df>: Abbrev Number: 1 (DW_TAG_member)
    <9e0>   DW_AT_name        : (indirect string, offset: 0xe8994): AHB2ENR
    <9e4>   DW_AT_decl_file   : 4
    <9e4>   DW_AT_decl_line   : 706
    <9e6>   DW_AT_decl_column : 17
    <9e6>   DW_AT_type        : <0x8ed>
    <9ea>   DW_AT_data_member_location: 76
 <2><9eb>: Abbrev Number: 1 (DW_TAG_member)
    <9ec>   DW_AT_name        : (indirect string, offset: 0xe8a52): AHB3ENR
    <9f0>   DW_AT_decl_file   : 4
    <9f0>   DW_AT_decl_line   : 707
    <9f2>   DW_AT_decl_column : 17
    <9f2>   DW_AT_type        : <0x8ed>
    <9f6>   DW_AT_data_member_location: 80
 <2><9f7>: Abbrev Number: 1 (DW_TAG_member)
    <9f8>   DW_AT_name        : (indirect string, offset: 0xe8c82): RESERVED3
    <9fc>   DW_AT_decl_file   : 4
    <9fc>   DW_AT_decl_line   : 708
    <9fe>   DW_AT_decl_column : 17
    <9fe>   DW_AT_type        : <0x8e1>
    <a02>   DW_AT_data_member_location: 84
 <2><a03>: Abbrev Number: 1 (DW_TAG_member)
    <a04>   DW_AT_name        : (indirect string, offset: 0xe88ca): APB1ENR1
    <a08>   DW_AT_decl_file   : 4
    <a08>   DW_AT_decl_line   : 709
    <a0a>   DW_AT_decl_column : 17
    <a0a>   DW_AT_type        : <0x8ed>
    <a0e>   DW_AT_data_member_location: 88
 <2><a0f>: Abbrev Number: 1 (DW_TAG_member)
    <a10>   DW_AT_name        : (indirect string, offset: 0xe88d3): APB1ENR2
    <a14>   DW_AT_decl_file   : 4
    <a14>   DW_AT_decl_line   : 710
    <a16>   DW_AT_decl_column : 17
    <a16>   DW_AT_type        : <0x8ed>
    <a1a>   DW_AT_data_member_location: 92
 <2><a1b>: Abbrev Number: 1 (DW_TAG_member)
    <a1c>   DW_AT_name        : (indirect string, offset: 0xe8915): APB2ENR
    <a20>   DW_AT_decl_file   : 4
    <a20>   DW_AT_decl_line   : 711
    <a22>   DW_AT_decl_column : 17
    <a22>   DW_AT_type        : <0x8ed>
    <a26>   DW_AT_data_member_location: 96
 <2><a27>: Abbrev Number: 1 (DW_TAG_member)
    <a28>   DW_AT_name        : (indirect string, offset: 0xe8ae8): RESERVED4
    <a2c>   DW_AT_decl_file   : 4
    <a2c>   DW_AT_decl_line   : 712
    <a2e>   DW_AT_decl_column : 17
    <a2e>   DW_AT_type        : <0x8e1>
    <a32>   DW_AT_data_member_location: 100
 <2><a33>: Abbrev Number: 1 (DW_TAG_member)
    <a34>   DW_AT_name        : (indirect string, offset: 0xe8a69): AHB1SMENR
    <a38>   DW_AT_decl_file   : 4
    <a38>   DW_AT_decl_line   : 713
    <a3a>   DW_AT_decl_column : 17
    <a3a>   DW_AT_type        : <0x8ed>
    <a3e>   DW_AT_data_member_location: 104
 <2><a3f>: Abbrev Number: 1 (DW_TAG_member)
    <a40>   DW_AT_name        : (indirect string, offset: 0xe8c51): AHB2SMENR
    <a44>   DW_AT_decl_file   : 4
    <a44>   DW_AT_decl_line   : 714
    <a46>   DW_AT_decl_column : 17
    <a46>   DW_AT_type        : <0x8ed>
    <a4a>   DW_AT_data_member_location: 108
 <2><a4b>: Abbrev Number: 1 (DW_TAG_member)
    <a4c>   DW_AT_name        : (indirect string, offset: 0xe8a0d): AHB3SMENR
    <a50>   DW_AT_decl_file   : 4
    <a50>   DW_AT_decl_line   : 715
    <a52>   DW_AT_decl_column : 17
    <a52>   DW_AT_type        : <0x8ed>
    <a56>   DW_AT_data_member_location: 112
 <2><a57>: Abbrev Number: 1 (DW_TAG_member)
    <a58>   DW_AT_name        : (indirect string, offset: 0xe8c8c): RESERVED5
    <a5c>   DW_AT_decl_file   : 4
    <a5c>   DW_AT_decl_line   : 716
    <a5e>   DW_AT_decl_column : 17
    <a5e>   DW_AT_type        : <0x8e1>
    <a62>   DW_AT_data_member_location: 116
 <2><a63>: Abbrev Number: 1 (DW_TAG_member)
    <a64>   DW_AT_name        : (indirect string, offset: 0xe88dc): APB1SMENR1
    <a68>   DW_AT_decl_file   : 4
    <a68>   DW_AT_decl_line   : 717
    <a6a>   DW_AT_decl_column : 17
    <a6a>   DW_AT_type        : <0x8ed>
    <a6e>   DW_AT_data_member_location: 120
 <2><a6f>: Abbrev Number: 1 (DW_TAG_member)
    <a70>   DW_AT_name        : (indirect string, offset: 0xe88e7): APB1SMENR2
    <a74>   DW_AT_decl_file   : 4
    <a74>   DW_AT_decl_line   : 718
    <a76>   DW_AT_decl_column : 17
    <a76>   DW_AT_type        : <0x8ed>
    <a7a>   DW_AT_data_member_location: 124
 <2><a7b>: Abbrev Number: 1 (DW_TAG_member)
    <a7c>   DW_AT_name        : (indirect string, offset: 0xe8bb0): APB2SMENR
    <a80>   DW_AT_decl_file   : 4
    <a80>   DW_AT_decl_line   : 719
    <a82>   DW_AT_decl_column : 17
    <a82>   DW_AT_type        : <0x8ed>
    <a86>   DW_AT_data_member_location: 128
 <2><a87>: Abbrev Number: 1 (DW_TAG_member)
    <a88>   DW_AT_name        : (indirect string, offset: 0xe8af2): RESERVED6
    <a8c>   DW_AT_decl_file   : 4
    <a8c>   DW_AT_decl_line   : 720
    <a8e>   DW_AT_decl_column : 17
    <a8e>   DW_AT_type        : <0x8e1>
    <a92>   DW_AT_data_member_location: 132
 <2><a93>: Abbrev Number: 1 (DW_TAG_member)
    <a94>   DW_AT_name        : (indirect string, offset: 0xe89bc): CCIPR
    <a98>   DW_AT_decl_file   : 4
    <a98>   DW_AT_decl_line   : 721
    <a9a>   DW_AT_decl_column : 17
    <a9a>   DW_AT_type        : <0x8ed>
    <a9e>   DW_AT_data_member_location: 136
 <2><a9f>: Abbrev Number: 1 (DW_TAG_member)
    <aa0>   DW_AT_name        : (indirect string, offset: 0xe8c96): RESERVED7
    <aa4>   DW_AT_decl_file   : 4
    <aa4>   DW_AT_decl_line   : 722
    <aa6>   DW_AT_decl_column : 17
    <aa6>   DW_AT_type        : <0x8e1>
    <aaa>   DW_AT_data_member_location: 140
 <2><aab>: Abbrev Number: 1 (DW_TAG_member)
    <aac>   DW_AT_name        : (indirect string, offset: 0xe898f): BDCR
    <ab0>   DW_AT_decl_file   : 4
    <ab0>   DW_AT_decl_line   : 723
    <ab2>   DW_AT_decl_column : 17
    <ab2>   DW_AT_type        : <0x8ed>
    <ab6>   DW_AT_data_member_location: 144
 <2><ab7>: Abbrev Number: 6 (DW_TAG_member)
    <ab8>   DW_AT_name        : CSR
    <abc>   DW_AT_decl_file   : 4
    <abc>   DW_AT_decl_line   : 724
    <abe>   DW_AT_decl_column : 17
    <abe>   DW_AT_type        : <0x8ed>
    <ac2>   DW_AT_data_member_location: 148
 <2><ac3>: Abbrev Number: 0
 <1><ac4>: Abbrev Number: 11 (DW_TAG_typedef)
    <ac5>   DW_AT_name        : (indirect string, offset: 0xe8a7e): RCC_TypeDef
    <ac9>   DW_AT_decl_file   : 4
    <aca>   DW_AT_decl_line   : 725
    <acc>   DW_AT_decl_column : 3
    <acd>   DW_AT_type        : <0x8f2>
 <1><ad1>: Abbrev Number: 2 (DW_TAG_base_type)
    <ad2>   DW_AT_byte_size   : 8
    <ad3>   DW_AT_encoding    : 4	(float)
    <ad4>   DW_AT_name        : (indirect string, offset: 0xee3e4): long double
 <1><ad8>: Abbrev Number: 12 (DW_TAG_array_type)
    <ad9>   DW_AT_type        : <0x8dc>
    <add>   DW_AT_sibling     : <0xae8>
 <2><ae1>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <ae2>   DW_AT_type        : <0x8c9>
    <ae6>   DW_AT_upper_bound : 6
 <2><ae7>: Abbrev Number: 0
 <1><ae8>: Abbrev Number: 5 (DW_TAG_const_type)
    <ae9>   DW_AT_type        : <0xad8>
 <1><aed>: Abbrev Number: 4 (DW_TAG_variable)
    <aee>   DW_AT_name        : (indirect string, offset: 0x2d6ad): CHANNEL_OFFSET_TAB
    <af2>   DW_AT_decl_file   : 5
    <af3>   DW_AT_decl_line   : 49
    <af4>   DW_AT_decl_column : 22
    <af5>   DW_AT_type        : <0xae8>
    <af9>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><aff>: Abbrev Number: 14 (DW_TAG_subprogram)
    <b00>   DW_AT_external    : 1
    <b00>   DW_AT_name        : (indirect string, offset: 0xe8cd0): HAL_MspInit
    <b04>   DW_AT_decl_file   : 1
    <b05>   DW_AT_decl_line   : 64
    <b06>   DW_AT_decl_column : 6
    <b07>   DW_AT_prototyped  : 1
    <b07>   DW_AT_low_pc      : 0x800073c
    <b0b>   DW_AT_high_pc     : 0x48
    <b0f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b11>   DW_AT_call_all_calls: 1
 <2><b11>: Abbrev Number: 15 (DW_TAG_lexical_block)
    <b12>   DW_AT_low_pc      : 0x8000742
    <b16>   DW_AT_high_pc     : 0x18
    <b1a>   DW_AT_sibling     : <0xb2e>
 <3><b1e>: Abbrev Number: 4 (DW_TAG_variable)
    <b1f>   DW_AT_name        : (indirect string, offset: 0xe8cdc): tmpreg
    <b23>   DW_AT_decl_file   : 1
    <b24>   DW_AT_decl_line   : 71
    <b25>   DW_AT_decl_column : 3
    <b26>   DW_AT_type        : <0x8ed>
    <b2a>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><b2d>: Abbrev Number: 0
 <2><b2e>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <b2f>   DW_AT_low_pc      : 0x800075a
    <b33>   DW_AT_high_pc     : 0x18
 <3><b37>: Abbrev Number: 4 (DW_TAG_variable)
    <b38>   DW_AT_name        : (indirect string, offset: 0xe8cdc): tmpreg
    <b3c>   DW_AT_decl_file   : 1
    <b3d>   DW_AT_decl_line   : 72
    <b3e>   DW_AT_decl_column : 3
    <b3f>   DW_AT_type        : <0x8ed>
    <b43>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><b46>: Abbrev Number: 0
 <2><b47>: Abbrev Number: 0
 <1><b48>: Abbrev Number: 0
  Compilation Unit @ offset 0xb49:
   Length:        0x118 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x3eb
   Pointer Size:  4
 <0><b55>: Abbrev Number: 5 (DW_TAG_compile_unit)
    <b56>   DW_AT_producer    : (indirect string, offset: 0x3c767): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <b5a>   DW_AT_language    : 29	(C11)
    <b5b>   DW_AT_name        : (indirect string, offset: 0xe8d33): ../Core/Src/stm32l4xx_it.c
    <b5f>   DW_AT_comp_dir    : (indirect string, offset: 0x7fb10): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <b63>   DW_AT_ranges      : 0x6b
    <b67>   DW_AT_low_pc      : 0
    <b6b>   DW_AT_stmt_list   : 0x1781
    <b6f>   DW_AT_macros      : 0x25239
 <1><b73>: Abbrev Number: 1 (DW_TAG_base_type)
    <b74>   DW_AT_byte_size   : 1
    <b75>   DW_AT_encoding    : 6	(signed char)
    <b76>   DW_AT_name        : (indirect string, offset: 0x751ec): signed char
 <1><b7a>: Abbrev Number: 3 (DW_TAG_typedef)
    <b7b>   DW_AT_name        : (indirect string, offset: 0x4354d): __uint8_t
    <b7f>   DW_AT_decl_file   : 2
    <b80>   DW_AT_decl_line   : 43
    <b81>   DW_AT_decl_column : 24
    <b82>   DW_AT_type        : <0xb86>
 <1><b86>: Abbrev Number: 1 (DW_TAG_base_type)
    <b87>   DW_AT_byte_size   : 1
    <b88>   DW_AT_encoding    : 8	(unsigned char)
    <b89>   DW_AT_name        : (indirect string, offset: 0xdfda1): unsigned char
 <1><b8d>: Abbrev Number: 1 (DW_TAG_base_type)
    <b8e>   DW_AT_byte_size   : 2
    <b8f>   DW_AT_encoding    : 5	(signed)
    <b90>   DW_AT_name        : (indirect string, offset: 0xac250): short int
 <1><b94>: Abbrev Number: 1 (DW_TAG_base_type)
    <b95>   DW_AT_byte_size   : 2
    <b96>   DW_AT_encoding    : 7	(unsigned)
    <b97>   DW_AT_name        : (indirect string, offset: 0xde34b): short unsigned int
 <1><b9b>: Abbrev Number: 1 (DW_TAG_base_type)
    <b9c>   DW_AT_byte_size   : 4
    <b9d>   DW_AT_encoding    : 5	(signed)
    <b9e>   DW_AT_name        : (indirect string, offset: 0x135b8): long int
 <1><ba2>: Abbrev Number: 1 (DW_TAG_base_type)
    <ba3>   DW_AT_byte_size   : 4
    <ba4>   DW_AT_encoding    : 7	(unsigned)
    <ba5>   DW_AT_name        : (indirect string, offset: 0x58285): long unsigned int
 <1><ba9>: Abbrev Number: 1 (DW_TAG_base_type)
    <baa>   DW_AT_byte_size   : 8
    <bab>   DW_AT_encoding    : 5	(signed)
    <bac>   DW_AT_name        : (indirect string, offset: 0x69985): long long int
 <1><bb0>: Abbrev Number: 1 (DW_TAG_base_type)
    <bb1>   DW_AT_byte_size   : 8
    <bb2>   DW_AT_encoding    : 7	(unsigned)
    <bb3>   DW_AT_name        : (indirect string, offset: 0x3004c): long long unsigned int
 <1><bb7>: Abbrev Number: 6 (DW_TAG_base_type)
    <bb8>   DW_AT_byte_size   : 4
    <bb9>   DW_AT_encoding    : 5	(signed)
    <bba>   DW_AT_name        : int
 <1><bbe>: Abbrev Number: 1 (DW_TAG_base_type)
    <bbf>   DW_AT_byte_size   : 4
    <bc0>   DW_AT_encoding    : 7	(unsigned)
    <bc1>   DW_AT_name        : (indirect string, offset: 0x12ac1): unsigned int
 <1><bc5>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc6>   DW_AT_name        : (indirect string, offset: 0x4354f): uint8_t
    <bca>   DW_AT_decl_file   : 3
    <bcb>   DW_AT_decl_line   : 24
    <bcc>   DW_AT_decl_column : 19
    <bcd>   DW_AT_type        : <0xb7a>
 <1><bd1>: Abbrev Number: 4 (DW_TAG_const_type)
    <bd2>   DW_AT_type        : <0xbc5>
 <1><bd6>: Abbrev Number: 1 (DW_TAG_base_type)
    <bd7>   DW_AT_byte_size   : 8
    <bd8>   DW_AT_encoding    : 4	(float)
    <bd9>   DW_AT_name        : (indirect string, offset: 0xee3e4): long double
 <1><bdd>: Abbrev Number: 7 (DW_TAG_array_type)
    <bde>   DW_AT_type        : <0xbd1>
    <be2>   DW_AT_sibling     : <0xbed>
 <2><be6>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <be7>   DW_AT_type        : <0xbbe>
    <beb>   DW_AT_upper_bound : 6
 <2><bec>: Abbrev Number: 0
 <1><bed>: Abbrev Number: 4 (DW_TAG_const_type)
    <bee>   DW_AT_type        : <0xbdd>
 <1><bf2>: Abbrev Number: 9 (DW_TAG_variable)
    <bf3>   DW_AT_name        : (indirect string, offset: 0x2d6ad): CHANNEL_OFFSET_TAB
    <bf7>   DW_AT_decl_file   : 4
    <bf8>   DW_AT_decl_line   : 49
    <bf9>   DW_AT_decl_column : 22
    <bfa>   DW_AT_type        : <0xbed>
    <bfe>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><c04>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c05>   DW_AT_external    : 1
    <c05>   DW_AT_name        : (indirect string, offset: 0xe8d22): DebugMon_Handler
    <c09>   DW_AT_decl_file   : 1
    <c09>   DW_AT_decl_line   : 159
    <c0a>   DW_AT_decl_column : 6
    <c0a>   DW_AT_prototyped  : 1
    <c0a>   DW_AT_low_pc      : 0x80007ac
    <c0e>   DW_AT_high_pc     : 0xe
    <c12>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c14>   DW_AT_call_all_calls: 1
 <1><c14>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c15>   DW_AT_external    : 1
    <c15>   DW_AT_name        : (indirect string, offset: 0xe8d0f): UsageFault_Handler
    <c19>   DW_AT_decl_file   : 1
    <c19>   DW_AT_decl_line   : 129
    <c1a>   DW_AT_decl_column : 6
    <c1a>   DW_AT_prototyped  : 1
    <c1a>   DW_AT_low_pc      : 0x80007a4
    <c1e>   DW_AT_high_pc     : 0x8
    <c22>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c24>   DW_AT_call_all_calls: 1
 <1><c24>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c25>   DW_AT_external    : 1
    <c25>   DW_AT_name        : (indirect string, offset: 0xe8d60): BusFault_Handler
    <c29>   DW_AT_decl_file   : 1
    <c29>   DW_AT_decl_line   : 114
    <c2a>   DW_AT_decl_column : 6
    <c2a>   DW_AT_prototyped  : 1
    <c2a>   DW_AT_low_pc      : 0x800079c
    <c2e>   DW_AT_high_pc     : 0x8
    <c32>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c34>   DW_AT_call_all_calls: 1
 <1><c34>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c35>   DW_AT_external    : 1
    <c35>   DW_AT_name        : (indirect string, offset: 0xe8d83): MemManage_Handler
    <c39>   DW_AT_decl_file   : 1
    <c39>   DW_AT_decl_line   : 99
    <c3a>   DW_AT_decl_column : 6
    <c3a>   DW_AT_prototyped  : 1
    <c3a>   DW_AT_low_pc      : 0x8000794
    <c3e>   DW_AT_high_pc     : 0x8
    <c42>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c44>   DW_AT_call_all_calls: 1
 <1><c44>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c45>   DW_AT_external    : 1
    <c45>   DW_AT_name        : (indirect string, offset: 0xe8d4e): HardFault_Handler
    <c49>   DW_AT_decl_file   : 1
    <c49>   DW_AT_decl_line   : 84
    <c4a>   DW_AT_decl_column : 6
    <c4a>   DW_AT_prototyped  : 1
    <c4a>   DW_AT_low_pc      : 0x800078c
    <c4e>   DW_AT_high_pc     : 0x8
    <c52>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c54>   DW_AT_call_all_calls: 1
 <1><c54>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c55>   DW_AT_external    : 1
    <c55>   DW_AT_name        : (indirect string, offset: 0xe8d03): NMI_Handler
    <c59>   DW_AT_decl_file   : 1
    <c59>   DW_AT_decl_line   : 69
    <c5a>   DW_AT_decl_column : 6
    <c5a>   DW_AT_prototyped  : 1
    <c5a>   DW_AT_low_pc      : 0x8000784
    <c5e>   DW_AT_high_pc     : 0x8
    <c62>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c64>   DW_AT_call_all_calls: 1
 <1><c64>: Abbrev Number: 0
  Compilation Unit @ offset 0xc65:
   Length:        0x5de (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x46b
   Pointer Size:  4
 <0><c71>: Abbrev Number: 14 (DW_TAG_compile_unit)
    <c72>   DW_AT_producer    : (indirect string, offset: 0x3c767): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <c76>   DW_AT_language    : 29	(C11)
    <c77>   DW_AT_name        : (indirect string, offset: 0xe8d95): ../Core/Src/system_stm32l4xx.c
    <c7b>   DW_AT_comp_dir    : (indirect string, offset: 0x7fb10): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <c7f>   DW_AT_ranges      : 0x9c
    <c83>   DW_AT_low_pc      : 0
    <c87>   DW_AT_stmt_list   : 0x1f07
    <c8b>   DW_AT_macros      : 0x253f4
 <1><c8f>: Abbrev Number: 2 (DW_TAG_base_type)
    <c90>   DW_AT_byte_size   : 1
    <c91>   DW_AT_encoding    : 6	(signed char)
    <c92>   DW_AT_name        : (indirect string, offset: 0x751ec): signed char
 <1><c96>: Abbrev Number: 9 (DW_TAG_typedef)
    <c97>   DW_AT_name        : (indirect string, offset: 0x4354d): __uint8_t
    <c9b>   DW_AT_decl_file   : 2
    <c9c>   DW_AT_decl_line   : 43
    <c9d>   DW_AT_decl_column : 24
    <c9e>   DW_AT_type        : <0xca2>
 <1><ca2>: Abbrev Number: 2 (DW_TAG_base_type)
    <ca3>   DW_AT_byte_size   : 1
    <ca4>   DW_AT_encoding    : 8	(unsigned char)
    <ca5>   DW_AT_name        : (indirect string, offset: 0xdfda1): unsigned char
 <1><ca9>: Abbrev Number: 2 (DW_TAG_base_type)
    <caa>   DW_AT_byte_size   : 2
    <cab>   DW_AT_encoding    : 5	(signed)
    <cac>   DW_AT_name        : (indirect string, offset: 0xac250): short int
 <1><cb0>: Abbrev Number: 2 (DW_TAG_base_type)
    <cb1>   DW_AT_byte_size   : 2
    <cb2>   DW_AT_encoding    : 7	(unsigned)
    <cb3>   DW_AT_name        : (indirect string, offset: 0xde34b): short unsigned int
 <1><cb7>: Abbrev Number: 2 (DW_TAG_base_type)
    <cb8>   DW_AT_byte_size   : 4
    <cb9>   DW_AT_encoding    : 5	(signed)
    <cba>   DW_AT_name        : (indirect string, offset: 0x135b8): long int
 <1><cbe>: Abbrev Number: 9 (DW_TAG_typedef)
    <cbf>   DW_AT_name        : (indirect string, offset: 0xe8b4d): __uint32_t
    <cc3>   DW_AT_decl_file   : 2
    <cc4>   DW_AT_decl_line   : 79
    <cc5>   DW_AT_decl_column : 25
    <cc6>   DW_AT_type        : <0xcca>
 <1><cca>: Abbrev Number: 2 (DW_TAG_base_type)
    <ccb>   DW_AT_byte_size   : 4
    <ccc>   DW_AT_encoding    : 7	(unsigned)
    <ccd>   DW_AT_name        : (indirect string, offset: 0x58285): long unsigned int
 <1><cd1>: Abbrev Number: 2 (DW_TAG_base_type)
    <cd2>   DW_AT_byte_size   : 8
    <cd3>   DW_AT_encoding    : 5	(signed)
    <cd4>   DW_AT_name        : (indirect string, offset: 0x69985): long long int
 <1><cd8>: Abbrev Number: 2 (DW_TAG_base_type)
    <cd9>   DW_AT_byte_size   : 8
    <cda>   DW_AT_encoding    : 7	(unsigned)
    <cdb>   DW_AT_name        : (indirect string, offset: 0x3004c): long long unsigned int
 <1><cdf>: Abbrev Number: 15 (DW_TAG_base_type)
    <ce0>   DW_AT_byte_size   : 4
    <ce1>   DW_AT_encoding    : 5	(signed)
    <ce2>   DW_AT_name        : int
 <1><ce6>: Abbrev Number: 2 (DW_TAG_base_type)
    <ce7>   DW_AT_byte_size   : 4
    <ce8>   DW_AT_encoding    : 7	(unsigned)
    <ce9>   DW_AT_name        : (indirect string, offset: 0x12ac1): unsigned int
 <1><ced>: Abbrev Number: 9 (DW_TAG_typedef)
    <cee>   DW_AT_name        : (indirect string, offset: 0x4354f): uint8_t
    <cf2>   DW_AT_decl_file   : 3
    <cf3>   DW_AT_decl_line   : 24
    <cf4>   DW_AT_decl_column : 19
    <cf5>   DW_AT_type        : <0xc96>
 <1><cf9>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <cfa>   DW_AT_type        : <0xced>
 <1><cfe>: Abbrev Number: 3 (DW_TAG_const_type)
    <cff>   DW_AT_type        : <0xced>
 <1><d03>: Abbrev Number: 9 (DW_TAG_typedef)
    <d04>   DW_AT_name        : (indirect string, offset: 0xa82d1): uint32_t
    <d08>   DW_AT_decl_file   : 3
    <d09>   DW_AT_decl_line   : 48
    <d0a>   DW_AT_decl_column : 20
    <d0b>   DW_AT_type        : <0xcbe>
 <1><d0f>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <d10>   DW_AT_type        : <0xd03>
 <1><d14>: Abbrev Number: 3 (DW_TAG_const_type)
    <d15>   DW_AT_type        : <0xd0f>
 <1><d19>: Abbrev Number: 3 (DW_TAG_const_type)
    <d1a>   DW_AT_type        : <0xd03>
 <1><d1e>: Abbrev Number: 12 (DW_TAG_structure_type)
    <d1f>   DW_AT_byte_size   : 140
    <d20>   DW_AT_decl_file   : 4
    <d21>   DW_AT_decl_line   : 440
    <d23>   DW_AT_decl_column : 9
    <d23>   DW_AT_sibling     : <0xe4e>
 <2><d27>: Abbrev Number: 1 (DW_TAG_member)
    <d28>   DW_AT_name        : (indirect string, offset: 0xe8dcd): CPUID
    <d2c>   DW_AT_decl_file   : 4
    <d2d>   DW_AT_decl_line   : 442
    <d2f>   DW_AT_decl_column : 18
    <d30>   DW_AT_type        : <0xd14>
    <d34>   DW_AT_data_member_location: 0
 <2><d35>: Abbrev Number: 1 (DW_TAG_member)
    <d36>   DW_AT_name        : (indirect string, offset: 0xe8dc8): ICSR
    <d3a>   DW_AT_decl_file   : 4
    <d3b>   DW_AT_decl_line   : 443
    <d3d>   DW_AT_decl_column : 18
    <d3e>   DW_AT_type        : <0xd0f>
    <d42>   DW_AT_data_member_location: 4
 <2><d43>: Abbrev Number: 1 (DW_TAG_member)
    <d44>   DW_AT_name        : (indirect string, offset: 0xe8db4): VTOR
    <d48>   DW_AT_decl_file   : 4
    <d49>   DW_AT_decl_line   : 444
    <d4b>   DW_AT_decl_column : 18
    <d4c>   DW_AT_type        : <0xd0f>
    <d50>   DW_AT_data_member_location: 8
 <2><d51>: Abbrev Number: 1 (DW_TAG_member)
    <d52>   DW_AT_name        : (indirect string, offset: 0xe8e81): AIRCR
    <d56>   DW_AT_decl_file   : 4
    <d57>   DW_AT_decl_line   : 445
    <d59>   DW_AT_decl_column : 18
    <d5a>   DW_AT_type        : <0xd0f>
    <d5e>   DW_AT_data_member_location: 12
 <2><d5f>: Abbrev Number: 6 (DW_TAG_member)
    <d60>   DW_AT_name        : SCR
    <d64>   DW_AT_decl_file   : 4
    <d65>   DW_AT_decl_line   : 446
    <d67>   DW_AT_decl_column : 18
    <d68>   DW_AT_type        : <0xd0f>
    <d6c>   DW_AT_data_member_location: 16
 <2><d6d>: Abbrev Number: 6 (DW_TAG_member)
    <d6e>   DW_AT_name        : CCR
    <d72>   DW_AT_decl_file   : 4
    <d73>   DW_AT_decl_line   : 447
    <d75>   DW_AT_decl_column : 18
    <d76>   DW_AT_type        : <0xd0f>
    <d7a>   DW_AT_data_member_location: 20
 <2><d7b>: Abbrev Number: 6 (DW_TAG_member)
    <d7c>   DW_AT_name        : SHP
    <d80>   DW_AT_decl_file   : 4
    <d81>   DW_AT_decl_line   : 448
    <d83>   DW_AT_decl_column : 18
    <d84>   DW_AT_type        : <0xe5e>
    <d88>   DW_AT_data_member_location: 24
 <2><d89>: Abbrev Number: 1 (DW_TAG_member)
    <d8a>   DW_AT_name        : (indirect string, offset: 0xe8dfb): SHCSR
    <d8e>   DW_AT_decl_file   : 4
    <d8f>   DW_AT_decl_line   : 449
    <d91>   DW_AT_decl_column : 18
    <d92>   DW_AT_type        : <0xd0f>
    <d96>   DW_AT_data_member_location: 36
 <2><d97>: Abbrev Number: 1 (DW_TAG_member)
    <d98>   DW_AT_name        : (indirect string, offset: 0xe8e22): CFSR
    <d9c>   DW_AT_decl_file   : 4
    <d9d>   DW_AT_decl_line   : 450
    <d9f>   DW_AT_decl_column : 18
    <da0>   DW_AT_type        : <0xd0f>
    <da4>   DW_AT_data_member_location: 40
 <2><da5>: Abbrev Number: 1 (DW_TAG_member)
    <da6>   DW_AT_name        : (indirect string, offset: 0xe8e01): HFSR
    <daa>   DW_AT_decl_file   : 4
    <dab>   DW_AT_decl_line   : 451
    <dad>   DW_AT_decl_column : 18
    <dae>   DW_AT_type        : <0xd0f>
    <db2>   DW_AT_data_member_location: 44
 <2><db3>: Abbrev Number: 1 (DW_TAG_member)
    <db4>   DW_AT_name        : (indirect string, offset: 0xe8e6e): DFSR
    <db8>   DW_AT_decl_file   : 4
    <db9>   DW_AT_decl_line   : 452
    <dbb>   DW_AT_decl_column : 18
    <dbc>   DW_AT_type        : <0xd0f>
    <dc0>   DW_AT_data_member_location: 48
 <2><dc1>: Abbrev Number: 1 (DW_TAG_member)
    <dc2>   DW_AT_name        : (indirect string, offset: 0xe8df0): MMFAR
    <dc6>   DW_AT_decl_file   : 4
    <dc7>   DW_AT_decl_line   : 453
    <dc9>   DW_AT_decl_column : 18
    <dca>   DW_AT_type        : <0xd0f>
    <dce>   DW_AT_data_member_location: 52
 <2><dcf>: Abbrev Number: 1 (DW_TAG_member)
    <dd0>   DW_AT_name        : (indirect string, offset: 0xe8deb): BFAR
    <dd4>   DW_AT_decl_file   : 4
    <dd5>   DW_AT_decl_line   : 454
    <dd7>   DW_AT_decl_column : 18
    <dd8>   DW_AT_type        : <0xd0f>
    <ddc>   DW_AT_data_member_location: 56
 <2><ddd>: Abbrev Number: 1 (DW_TAG_member)
    <dde>   DW_AT_name        : (indirect string, offset: 0xe8dc3): AFSR
    <de2>   DW_AT_decl_file   : 4
    <de3>   DW_AT_decl_line   : 455
    <de5>   DW_AT_decl_column : 18
    <de6>   DW_AT_type        : <0xd0f>
    <dea>   DW_AT_data_member_location: 60
 <2><deb>: Abbrev Number: 6 (DW_TAG_member)
    <dec>   DW_AT_name        : PFR
    <df0>   DW_AT_decl_file   : 4
    <df1>   DW_AT_decl_line   : 456
    <df3>   DW_AT_decl_column : 18
    <df4>   DW_AT_type        : <0xe78>
    <df8>   DW_AT_data_member_location: 64
 <2><df9>: Abbrev Number: 6 (DW_TAG_member)
    <dfa>   DW_AT_name        : DFR
    <dfe>   DW_AT_decl_file   : 4
    <dff>   DW_AT_decl_line   : 457
    <e01>   DW_AT_decl_column : 18
    <e02>   DW_AT_type        : <0xd14>
    <e06>   DW_AT_data_member_location: 72
 <2><e07>: Abbrev Number: 6 (DW_TAG_member)
    <e08>   DW_AT_name        : ADR
    <e0c>   DW_AT_decl_file   : 4
    <e0d>   DW_AT_decl_line   : 458
    <e0f>   DW_AT_decl_column : 18
    <e10>   DW_AT_type        : <0xd14>
    <e14>   DW_AT_data_member_location: 76
 <2><e15>: Abbrev Number: 1 (DW_TAG_member)
    <e16>   DW_AT_name        : (indirect string, offset: 0xe8de6): MMFR
    <e1a>   DW_AT_decl_file   : 4
    <e1b>   DW_AT_decl_line   : 459
    <e1d>   DW_AT_decl_column : 18
    <e1e>   DW_AT_type        : <0xe92>
    <e22>   DW_AT_data_member_location: 80
 <2><e23>: Abbrev Number: 1 (DW_TAG_member)
    <e24>   DW_AT_name        : (indirect string, offset: 0xe8df6): ISAR
    <e28>   DW_AT_decl_file   : 4
    <e29>   DW_AT_decl_line   : 460
    <e2b>   DW_AT_decl_column : 18
    <e2c>   DW_AT_type        : <0xeac>
    <e30>   DW_AT_data_member_location: 96
 <2><e31>: Abbrev Number: 1 (DW_TAG_member)
    <e32>   DW_AT_name        : (indirect string, offset: 0xe8c64): RESERVED0
    <e36>   DW_AT_decl_file   : 4
    <e37>   DW_AT_decl_line   : 461
    <e39>   DW_AT_decl_column : 18
    <e3a>   DW_AT_type        : <0xeb1>
    <e3e>   DW_AT_data_member_location: 116
 <2><e3f>: Abbrev Number: 1 (DW_TAG_member)
    <e40>   DW_AT_name        : (indirect string, offset: 0xe8e1c): CPACR
    <e44>   DW_AT_decl_file   : 4
    <e45>   DW_AT_decl_line   : 462
    <e47>   DW_AT_decl_column : 18
    <e48>   DW_AT_type        : <0xd0f>
    <e4c>   DW_AT_data_member_location: 136
 <2><e4d>: Abbrev Number: 0
 <1><e4e>: Abbrev Number: 4 (DW_TAG_array_type)
    <e4f>   DW_AT_type        : <0xcf9>
    <e53>   DW_AT_sibling     : <0xe5e>
 <2><e57>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <e58>   DW_AT_type        : <0xce6>
    <e5c>   DW_AT_upper_bound : 11
 <2><e5d>: Abbrev Number: 0
 <1><e5e>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <e5f>   DW_AT_type        : <0xe4e>
 <1><e63>: Abbrev Number: 4 (DW_TAG_array_type)
    <e64>   DW_AT_type        : <0xd14>
    <e68>   DW_AT_sibling     : <0xe73>
 <2><e6c>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <e6d>   DW_AT_type        : <0xce6>
    <e71>   DW_AT_upper_bound : 1
 <2><e72>: Abbrev Number: 0
 <1><e73>: Abbrev Number: 3 (DW_TAG_const_type)
    <e74>   DW_AT_type        : <0xe63>
 <1><e78>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <e79>   DW_AT_type        : <0xe73>
 <1><e7d>: Abbrev Number: 4 (DW_TAG_array_type)
    <e7e>   DW_AT_type        : <0xd14>
    <e82>   DW_AT_sibling     : <0xe8d>
 <2><e86>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <e87>   DW_AT_type        : <0xce6>
    <e8b>   DW_AT_upper_bound : 3
 <2><e8c>: Abbrev Number: 0
 <1><e8d>: Abbrev Number: 3 (DW_TAG_const_type)
    <e8e>   DW_AT_type        : <0xe7d>
 <1><e92>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <e93>   DW_AT_type        : <0xe8d>
 <1><e97>: Abbrev Number: 4 (DW_TAG_array_type)
    <e98>   DW_AT_type        : <0xd14>
    <e9c>   DW_AT_sibling     : <0xea7>
 <2><ea0>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <ea1>   DW_AT_type        : <0xce6>
    <ea5>   DW_AT_upper_bound : 4
 <2><ea6>: Abbrev Number: 0
 <1><ea7>: Abbrev Number: 3 (DW_TAG_const_type)
    <ea8>   DW_AT_type        : <0xe97>
 <1><eac>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <ead>   DW_AT_type        : <0xea7>
 <1><eb1>: Abbrev Number: 4 (DW_TAG_array_type)
    <eb2>   DW_AT_type        : <0xd03>
    <eb6>   DW_AT_sibling     : <0xec1>
 <2><eba>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <ebb>   DW_AT_type        : <0xce6>
    <ebf>   DW_AT_upper_bound : 4
 <2><ec0>: Abbrev Number: 0
 <1><ec1>: Abbrev Number: 13 (DW_TAG_typedef)
    <ec2>   DW_AT_name        : (indirect string, offset: 0xe8e3c): SCB_Type
    <ec6>   DW_AT_decl_file   : 4
    <ec7>   DW_AT_decl_line   : 463
    <ec9>   DW_AT_decl_column : 3
    <ec9>   DW_AT_type        : <0xd1e>
 <1><ecd>: Abbrev Number: 10 (DW_TAG_variable)
    <ece>   DW_AT_name        : (indirect string, offset: 0xe8e45): SystemCoreClock
    <ed2>   DW_AT_decl_file   : 5
    <ed2>   DW_AT_decl_line   : 57
    <ed3>   DW_AT_decl_column : 17
    <ed4>   DW_AT_type        : <0xd03>
    <ed8>   DW_AT_external    : 1
    <ed8>   DW_AT_declaration : 1
 <1><ed8>: Abbrev Number: 4 (DW_TAG_array_type)
    <ed9>   DW_AT_type        : <0xcfe>
    <edd>   DW_AT_sibling     : <0xee8>
 <2><ee1>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <ee2>   DW_AT_type        : <0xce6>
    <ee6>   DW_AT_upper_bound : 15
 <2><ee7>: Abbrev Number: 0
 <1><ee8>: Abbrev Number: 3 (DW_TAG_const_type)
    <ee9>   DW_AT_type        : <0xed8>
 <1><eed>: Abbrev Number: 10 (DW_TAG_variable)
    <eee>   DW_AT_name        : (indirect string, offset: 0xe8e73): AHBPrescTable
    <ef2>   DW_AT_decl_file   : 5
    <ef2>   DW_AT_decl_line   : 59
    <ef3>   DW_AT_decl_column : 23
    <ef4>   DW_AT_type        : <0xee8>
    <ef8>   DW_AT_external    : 1
    <ef8>   DW_AT_declaration : 1
 <1><ef8>: Abbrev Number: 4 (DW_TAG_array_type)
    <ef9>   DW_AT_type        : <0xcfe>
    <efd>   DW_AT_sibling     : <0xf08>
 <2><f01>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <f02>   DW_AT_type        : <0xce6>
    <f06>   DW_AT_upper_bound : 7
 <2><f07>: Abbrev Number: 0
 <1><f08>: Abbrev Number: 3 (DW_TAG_const_type)
    <f09>   DW_AT_type        : <0xef8>
 <1><f0d>: Abbrev Number: 10 (DW_TAG_variable)
    <f0e>   DW_AT_name        : (indirect string, offset: 0xe8e27): APBPrescTable
    <f12>   DW_AT_decl_file   : 5
    <f12>   DW_AT_decl_line   : 60
    <f13>   DW_AT_decl_column : 23
    <f14>   DW_AT_type        : <0xf08>
    <f18>   DW_AT_external    : 1
    <f18>   DW_AT_declaration : 1
 <1><f18>: Abbrev Number: 4 (DW_TAG_array_type)
    <f19>   DW_AT_type        : <0xd19>
    <f1d>   DW_AT_sibling     : <0xf28>
 <2><f21>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <f22>   DW_AT_type        : <0xce6>
    <f26>   DW_AT_upper_bound : 11
 <2><f27>: Abbrev Number: 0
 <1><f28>: Abbrev Number: 3 (DW_TAG_const_type)
    <f29>   DW_AT_type        : <0xf18>
 <1><f2d>: Abbrev Number: 10 (DW_TAG_variable)
    <f2e>   DW_AT_name        : (indirect string, offset: 0xe8e60): MSIRangeTable
    <f32>   DW_AT_decl_file   : 5
    <f32>   DW_AT_decl_line   : 61
    <f33>   DW_AT_decl_column : 23
    <f34>   DW_AT_type        : <0xf28>
    <f38>   DW_AT_external    : 1
    <f38>   DW_AT_declaration : 1
 <1><f38>: Abbrev Number: 12 (DW_TAG_structure_type)
    <f39>   DW_AT_byte_size   : 152
    <f3a>   DW_AT_decl_file   : 6
    <f3b>   DW_AT_decl_line   : 685
    <f3d>   DW_AT_decl_column : 9
    <f3d>   DW_AT_sibling     : <0x1155>
 <2><f41>: Abbrev Number: 6 (DW_TAG_member)
    <f42>   DW_AT_name        : CR
    <f45>   DW_AT_decl_file   : 6
    <f46>   DW_AT_decl_line   : 687
    <f48>   DW_AT_decl_column : 17
    <f49>   DW_AT_type        : <0xd0f>
    <f4d>   DW_AT_data_member_location: 0
 <2><f4e>: Abbrev Number: 1 (DW_TAG_member)
    <f4f>   DW_AT_name        : (indirect string, offset: 0xe8ac3): ICSCR
    <f53>   DW_AT_decl_file   : 6
    <f54>   DW_AT_decl_line   : 688
    <f56>   DW_AT_decl_column : 17
    <f57>   DW_AT_type        : <0xd0f>
    <f5b>   DW_AT_data_member_location: 4
 <2><f5c>: Abbrev Number: 1 (DW_TAG_member)
    <f5d>   DW_AT_name        : (indirect string, offset: 0xe89ef): CFGR
    <f61>   DW_AT_decl_file   : 6
    <f62>   DW_AT_decl_line   : 689
    <f64>   DW_AT_decl_column : 17
    <f65>   DW_AT_type        : <0xd0f>
    <f69>   DW_AT_data_member_location: 8
 <2><f6a>: Abbrev Number: 1 (DW_TAG_member)
    <f6b>   DW_AT_name        : (indirect string, offset: 0xe8b9d): PLLCFGR
    <f6f>   DW_AT_decl_file   : 6
    <f70>   DW_AT_decl_line   : 690
    <f72>   DW_AT_decl_column : 17
    <f73>   DW_AT_type        : <0xd0f>
    <f77>   DW_AT_data_member_location: 12
 <2><f78>: Abbrev Number: 1 (DW_TAG_member)
    <f79>   DW_AT_name        : (indirect string, offset: 0xe89e8): PLLSAI1CFGR
    <f7d>   DW_AT_decl_file   : 6
    <f7e>   DW_AT_decl_line   : 691
    <f80>   DW_AT_decl_column : 17
    <f81>   DW_AT_type        : <0xd0f>
    <f85>   DW_AT_data_member_location: 16
 <2><f86>: Abbrev Number: 1 (DW_TAG_member)
    <f87>   DW_AT_name        : (indirect string, offset: 0xe8b63): PLLSAI2CFGR
    <f8b>   DW_AT_decl_file   : 6
    <f8c>   DW_AT_decl_line   : 692
    <f8e>   DW_AT_decl_column : 17
    <f8f>   DW_AT_type        : <0xd0f>
    <f93>   DW_AT_data_member_location: 20
 <2><f94>: Abbrev Number: 1 (DW_TAG_member)
    <f95>   DW_AT_name        : (indirect string, offset: 0xe88c5): CIER
    <f99>   DW_AT_decl_file   : 6
    <f9a>   DW_AT_decl_line   : 693
    <f9c>   DW_AT_decl_column : 17
    <f9d>   DW_AT_type        : <0xd0f>
    <fa1>   DW_AT_data_member_location: 24
 <2><fa2>: Abbrev Number: 1 (DW_TAG_member)
    <fa3>   DW_AT_name        : (indirect string, offset: 0xe88c0): CIFR
    <fa7>   DW_AT_decl_file   : 6
    <fa8>   DW_AT_decl_line   : 694
    <faa>   DW_AT_decl_column : 17
    <fab>   DW_AT_type        : <0xd0f>
    <faf>   DW_AT_data_member_location: 28
 <2><fb0>: Abbrev Number: 1 (DW_TAG_member)
    <fb1>   DW_AT_name        : (indirect string, offset: 0xe88b6): CICR
    <fb5>   DW_AT_decl_file   : 6
    <fb6>   DW_AT_decl_line   : 695
    <fb8>   DW_AT_decl_column : 17
    <fb9>   DW_AT_type        : <0xd0f>
    <fbd>   DW_AT_data_member_location: 32
 <2><fbe>: Abbrev Number: 1 (DW_TAG_member)
    <fbf>   DW_AT_name        : (indirect string, offset: 0xe8c64): RESERVED0
    <fc3>   DW_AT_decl_file   : 6
    <fc4>   DW_AT_decl_line   : 696
    <fc6>   DW_AT_decl_column : 17
    <fc7>   DW_AT_type        : <0xd03>
    <fcb>   DW_AT_data_member_location: 36
 <2><fcc>: Abbrev Number: 1 (DW_TAG_member)
    <fcd>   DW_AT_name        : (indirect string, offset: 0xe8bc1): AHB1RSTR
    <fd1>   DW_AT_decl_file   : 6
    <fd2>   DW_AT_decl_line   : 697
    <fd4>   DW_AT_decl_column : 17
    <fd5>   DW_AT_type        : <0xd0f>
    <fd9>   DW_AT_data_member_location: 40
 <2><fda>: Abbrev Number: 1 (DW_TAG_member)
    <fdb>   DW_AT_name        : (indirect string, offset: 0xe890c): AHB2RSTR
    <fdf>   DW_AT_decl_file   : 6
    <fe0>   DW_AT_decl_line   : 698
    <fe2>   DW_AT_decl_column : 17
    <fe3>   DW_AT_type        : <0xd0f>
    <fe7>   DW_AT_data_member_location: 44
 <2><fe8>: Abbrev Number: 1 (DW_TAG_member)
    <fe9>   DW_AT_name        : (indirect string, offset: 0xe89df): AHB3RSTR
    <fed>   DW_AT_decl_file   : 6
    <fee>   DW_AT_decl_line   : 699
    <ff0>   DW_AT_decl_column : 17
    <ff1>   DW_AT_type        : <0xd0f>
    <ff5>   DW_AT_data_member_location: 48
 <2><ff6>: Abbrev Number: 1 (DW_TAG_member)
    <ff7>   DW_AT_name        : (indirect string, offset: 0xe8c6e): RESERVED1
    <ffb>   DW_AT_decl_file   : 6
    <ffc>   DW_AT_decl_line   : 700
    <ffe>   DW_AT_decl_column : 17
    <fff>   DW_AT_type        : <0xd03>
    <1003>   DW_AT_data_member_location: 52
 <2><1004>: Abbrev Number: 1 (DW_TAG_member)
    <1005>   DW_AT_name        : (indirect string, offset: 0xe8955): APB1RSTR1
    <1009>   DW_AT_decl_file   : 6
    <100a>   DW_AT_decl_line   : 701
    <100c>   DW_AT_decl_column : 17
    <100d>   DW_AT_type        : <0xd0f>
    <1011>   DW_AT_data_member_location: 56
 <2><1012>: Abbrev Number: 1 (DW_TAG_member)
    <1013>   DW_AT_name        : (indirect string, offset: 0xe895f): APB1RSTR2
    <1017>   DW_AT_decl_file   : 6
    <1018>   DW_AT_decl_line   : 702
    <101a>   DW_AT_decl_column : 17
    <101b>   DW_AT_type        : <0xd0f>
    <101f>   DW_AT_data_member_location: 60
 <2><1020>: Abbrev Number: 1 (DW_TAG_member)
    <1021>   DW_AT_name        : (indirect string, offset: 0xe8a32): APB2RSTR
    <1025>   DW_AT_decl_file   : 6
    <1026>   DW_AT_decl_line   : 703
    <1028>   DW_AT_decl_column : 17
    <1029>   DW_AT_type        : <0xd0f>
    <102d>   DW_AT_data_member_location: 64
 <2><102e>: Abbrev Number: 1 (DW_TAG_member)
    <102f>   DW_AT_name        : (indirect string, offset: 0xe8c78): RESERVED2
    <1033>   DW_AT_decl_file   : 6
    <1034>   DW_AT_decl_line   : 704
    <1036>   DW_AT_decl_column : 17
    <1037>   DW_AT_type        : <0xd03>
    <103b>   DW_AT_data_member_location: 68
 <2><103c>: Abbrev Number: 1 (DW_TAG_member)
    <103d>   DW_AT_name        : (indirect string, offset: 0xe88ff): AHB1ENR
    <1041>   DW_AT_decl_file   : 6
    <1042>   DW_AT_decl_line   : 705
    <1044>   DW_AT_decl_column : 17
    <1045>   DW_AT_type        : <0xd0f>
    <1049>   DW_AT_data_member_location: 72
 <2><104a>: Abbrev Number: 1 (DW_TAG_member)
    <104b>   DW_AT_name        : (indirect string, offset: 0xe8994): AHB2ENR
    <104f>   DW_AT_decl_file   : 6
    <1050>   DW_AT_decl_line   : 706
    <1052>   DW_AT_decl_column : 17
    <1053>   DW_AT_type        : <0xd0f>
    <1057>   DW_AT_data_member_location: 76
 <2><1058>: Abbrev Number: 1 (DW_TAG_member)
    <1059>   DW_AT_name        : (indirect string, offset: 0xe8a52): AHB3ENR
    <105d>   DW_AT_decl_file   : 6
    <105e>   DW_AT_decl_line   : 707
    <1060>   DW_AT_decl_column : 17
    <1061>   DW_AT_type        : <0xd0f>
    <1065>   DW_AT_data_member_location: 80
 <2><1066>: Abbrev Number: 1 (DW_TAG_member)
    <1067>   DW_AT_name        : (indirect string, offset: 0xe8c82): RESERVED3
    <106b>   DW_AT_decl_file   : 6
    <106c>   DW_AT_decl_line   : 708
    <106e>   DW_AT_decl_column : 17
    <106f>   DW_AT_type        : <0xd03>
    <1073>   DW_AT_data_member_location: 84
 <2><1074>: Abbrev Number: 1 (DW_TAG_member)
    <1075>   DW_AT_name        : (indirect string, offset: 0xe88ca): APB1ENR1
    <1079>   DW_AT_decl_file   : 6
    <107a>   DW_AT_decl_line   : 709
    <107c>   DW_AT_decl_column : 17
    <107d>   DW_AT_type        : <0xd0f>
    <1081>   DW_AT_data_member_location: 88
 <2><1082>: Abbrev Number: 1 (DW_TAG_member)
    <1083>   DW_AT_name        : (indirect string, offset: 0xe88d3): APB1ENR2
    <1087>   DW_AT_decl_file   : 6
    <1088>   DW_AT_decl_line   : 710
    <108a>   DW_AT_decl_column : 17
    <108b>   DW_AT_type        : <0xd0f>
    <108f>   DW_AT_data_member_location: 92
 <2><1090>: Abbrev Number: 1 (DW_TAG_member)
    <1091>   DW_AT_name        : (indirect string, offset: 0xe8915): APB2ENR
    <1095>   DW_AT_decl_file   : 6
    <1096>   DW_AT_decl_line   : 711
    <1098>   DW_AT_decl_column : 17
    <1099>   DW_AT_type        : <0xd0f>
    <109d>   DW_AT_data_member_location: 96
 <2><109e>: Abbrev Number: 1 (DW_TAG_member)
    <109f>   DW_AT_name        : (indirect string, offset: 0xe8ae8): RESERVED4
    <10a3>   DW_AT_decl_file   : 6
    <10a4>   DW_AT_decl_line   : 712
    <10a6>   DW_AT_decl_column : 17
    <10a7>   DW_AT_type        : <0xd03>
    <10ab>   DW_AT_data_member_location: 100
 <2><10ac>: Abbrev Number: 1 (DW_TAG_member)
    <10ad>   DW_AT_name        : (indirect string, offset: 0xe8a69): AHB1SMENR
    <10b1>   DW_AT_decl_file   : 6
    <10b2>   DW_AT_decl_line   : 713
    <10b4>   DW_AT_decl_column : 17
    <10b5>   DW_AT_type        : <0xd0f>
    <10b9>   DW_AT_data_member_location: 104
 <2><10ba>: Abbrev Number: 1 (DW_TAG_member)
    <10bb>   DW_AT_name        : (indirect string, offset: 0xe8c51): AHB2SMENR
    <10bf>   DW_AT_decl_file   : 6
    <10c0>   DW_AT_decl_line   : 714
    <10c2>   DW_AT_decl_column : 17
    <10c3>   DW_AT_type        : <0xd0f>
    <10c7>   DW_AT_data_member_location: 108
 <2><10c8>: Abbrev Number: 1 (DW_TAG_member)
    <10c9>   DW_AT_name        : (indirect string, offset: 0xe8a0d): AHB3SMENR
    <10cd>   DW_AT_decl_file   : 6
    <10ce>   DW_AT_decl_line   : 715
    <10d0>   DW_AT_decl_column : 17
    <10d1>   DW_AT_type        : <0xd0f>
    <10d5>   DW_AT_data_member_location: 112
 <2><10d6>: Abbrev Number: 1 (DW_TAG_member)
    <10d7>   DW_AT_name        : (indirect string, offset: 0xe8c8c): RESERVED5
    <10db>   DW_AT_decl_file   : 6
    <10dc>   DW_AT_decl_line   : 716
    <10de>   DW_AT_decl_column : 17
    <10df>   DW_AT_type        : <0xd03>
    <10e3>   DW_AT_data_member_location: 116
 <2><10e4>: Abbrev Number: 1 (DW_TAG_member)
    <10e5>   DW_AT_name        : (indirect string, offset: 0xe88dc): APB1SMENR1
    <10e9>   DW_AT_decl_file   : 6
    <10ea>   DW_AT_decl_line   : 717
    <10ec>   DW_AT_decl_column : 17
    <10ed>   DW_AT_type        : <0xd0f>
    <10f1>   DW_AT_data_member_location: 120
 <2><10f2>: Abbrev Number: 1 (DW_TAG_member)
    <10f3>   DW_AT_name        : (indirect string, offset: 0xe88e7): APB1SMENR2
    <10f7>   DW_AT_decl_file   : 6
    <10f8>   DW_AT_decl_line   : 718
    <10fa>   DW_AT_decl_column : 17
    <10fb>   DW_AT_type        : <0xd0f>
    <10ff>   DW_AT_data_member_location: 124
 <2><1100>: Abbrev Number: 1 (DW_TAG_member)
    <1101>   DW_AT_name        : (indirect string, offset: 0xe8bb0): APB2SMENR
    <1105>   DW_AT_decl_file   : 6
    <1106>   DW_AT_decl_line   : 719
    <1108>   DW_AT_decl_column : 17
    <1109>   DW_AT_type        : <0xd0f>
    <110d>   DW_AT_data_member_location: 128
 <2><110e>: Abbrev Number: 1 (DW_TAG_member)
    <110f>   DW_AT_name        : (indirect string, offset: 0xe8af2): RESERVED6
    <1113>   DW_AT_decl_file   : 6
    <1114>   DW_AT_decl_line   : 720
    <1116>   DW_AT_decl_column : 17
    <1117>   DW_AT_type        : <0xd03>
    <111b>   DW_AT_data_member_location: 132
 <2><111c>: Abbrev Number: 1 (DW_TAG_member)
    <111d>   DW_AT_name        : (indirect string, offset: 0xe89bc): CCIPR
    <1121>   DW_AT_decl_file   : 6
    <1122>   DW_AT_decl_line   : 721
    <1124>   DW_AT_decl_column : 17
    <1125>   DW_AT_type        : <0xd0f>
    <1129>   DW_AT_data_member_location: 136
 <2><112a>: Abbrev Number: 1 (DW_TAG_member)
    <112b>   DW_AT_name        : (indirect string, offset: 0xe8c96): RESERVED7
    <112f>   DW_AT_decl_file   : 6
    <1130>   DW_AT_decl_line   : 722
    <1132>   DW_AT_decl_column : 17
    <1133>   DW_AT_type        : <0xd03>
    <1137>   DW_AT_data_member_location: 140
 <2><1138>: Abbrev Number: 1 (DW_TAG_member)
    <1139>   DW_AT_name        : (indirect string, offset: 0xe898f): BDCR
    <113d>   DW_AT_decl_file   : 6
    <113e>   DW_AT_decl_line   : 723
    <1140>   DW_AT_decl_column : 17
    <1141>   DW_AT_type        : <0xd0f>
    <1145>   DW_AT_data_member_location: 144
 <2><1146>: Abbrev Number: 6 (DW_TAG_member)
    <1147>   DW_AT_name        : CSR
    <114b>   DW_AT_decl_file   : 6
    <114c>   DW_AT_decl_line   : 724
    <114e>   DW_AT_decl_column : 17
    <114f>   DW_AT_type        : <0xd0f>
    <1153>   DW_AT_data_member_location: 148
 <2><1154>: Abbrev Number: 0
 <1><1155>: Abbrev Number: 13 (DW_TAG_typedef)
    <1156>   DW_AT_name        : (indirect string, offset: 0xe8a7e): RCC_TypeDef
    <115a>   DW_AT_decl_file   : 6
    <115b>   DW_AT_decl_line   : 725
    <115d>   DW_AT_decl_column : 3
    <115d>   DW_AT_type        : <0xf38>
 <1><1161>: Abbrev Number: 2 (DW_TAG_base_type)
    <1162>   DW_AT_byte_size   : 8
    <1163>   DW_AT_encoding    : 4	(float)
    <1164>   DW_AT_name        : (indirect string, offset: 0xee3e4): long double
 <1><1168>: Abbrev Number: 4 (DW_TAG_array_type)
    <1169>   DW_AT_type        : <0xcfe>
    <116d>   DW_AT_sibling     : <0x1178>
 <2><1171>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <1172>   DW_AT_type        : <0xce6>
    <1176>   DW_AT_upper_bound : 6
 <2><1177>: Abbrev Number: 0
 <1><1178>: Abbrev Number: 3 (DW_TAG_const_type)
    <1179>   DW_AT_type        : <0x1168>
 <1><117d>: Abbrev Number: 8 (DW_TAG_variable)
    <117e>   DW_AT_name        : (indirect string, offset: 0x2d6ad): CHANNEL_OFFSET_TAB
    <1182>   DW_AT_decl_file   : 7
    <1183>   DW_AT_decl_line   : 49
    <1184>   DW_AT_decl_column : 22
    <1185>   DW_AT_type        : <0x1178>
    <1189>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><118f>: Abbrev Number: 11 (DW_TAG_variable)
    <1190>   DW_AT_specification: <0xecd>
