Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x4e0 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 12 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x299f7): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x97530): ../Core/Src/Drivers/I2C.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x5752b): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 3 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x4fcee): signed char
 <1><31>: Abbrev Number: 5 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x2e557): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 3 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0x98270): unsigned char
 <1><44>: Abbrev Number: 3 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x75845): short int
 <1><4b>: Abbrev Number: 3 (DW_TAG_base_type)
    <4c>   DW_AT_byte_size   : 2
    <4d>   DW_AT_encoding    : 7	(unsigned)
    <4e>   DW_AT_name        : (indirect string, offset: 0x970ad): short unsigned int
 <1><52>: Abbrev Number: 3 (DW_TAG_base_type)
    <53>   DW_AT_byte_size   : 4
    <54>   DW_AT_encoding    : 5	(signed)
    <55>   DW_AT_name        : (indirect string, offset: 0xcd62): long int
 <1><59>: Abbrev Number: 5 (DW_TAG_typedef)
    <5a>   DW_AT_name        : (indirect string, offset: 0x652e1): __uint32_t
    <5e>   DW_AT_decl_file   : 2
    <5f>   DW_AT_decl_line   : 79
    <60>   DW_AT_decl_column : 25
    <61>   DW_AT_type        : <0x65>
 <1><65>: Abbrev Number: 3 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 4
    <67>   DW_AT_encoding    : 7	(unsigned)
    <68>   DW_AT_name        : (indirect string, offset: 0x3ccba): long unsigned int
 <1><6c>: Abbrev Number: 3 (DW_TAG_base_type)
    <6d>   DW_AT_byte_size   : 8
    <6e>   DW_AT_encoding    : 5	(signed)
    <6f>   DW_AT_name        : (indirect string, offset: 0x4895f): long long int
 <1><73>: Abbrev Number: 3 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 8
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0x20f4b): long long unsigned int
 <1><7a>: Abbrev Number: 13 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : int
 <1><81>: Abbrev Number: 3 (DW_TAG_base_type)
    <82>   DW_AT_byte_size   : 4
    <83>   DW_AT_encoding    : 7	(unsigned)
    <84>   DW_AT_name        : (indirect string, offset: 0xc599): unsigned int
 <1><88>: Abbrev Number: 5 (DW_TAG_typedef)
    <89>   DW_AT_name        : (indirect string, offset: 0x2e559): uint8_t
    <8d>   DW_AT_decl_file   : 3
    <8e>   DW_AT_decl_line   : 24
    <8f>   DW_AT_decl_column : 19
    <90>   DW_AT_type        : <0x31>
 <1><94>: Abbrev Number: 5 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0xd3ca8): uint32_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 48
    <9b>   DW_AT_decl_column : 20
    <9c>   DW_AT_type        : <0x59>
 <1><a0>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 6 (DW_TAG_structure_type)
    <a6>   DW_AT_byte_size   : 48
    <a7>   DW_AT_decl_file   : 4
    <a7>   DW_AT_decl_line   : 531
    <a9>   DW_AT_decl_column : 9
    <a9>   DW_AT_sibling     : <0x132>
 <2><ad>: Abbrev Number: 1 (DW_TAG_member)
    <ae>   DW_AT_name        : (indirect string, offset: 0x10f4): MODER
    <b2>   DW_AT_decl_file   : 4
    <b2>   DW_AT_decl_line   : 533
    <b4>   DW_AT_decl_column : 17
    <b4>   DW_AT_type        : <0xa0>
    <b8>   DW_AT_data_member_location: 0
 <2><b9>: Abbrev Number: 1 (DW_TAG_member)
    <ba>   DW_AT_name        : (indirect string, offset: 0x7a553): OTYPER
    <be>   DW_AT_decl_file   : 4
    <be>   DW_AT_decl_line   : 534
    <c0>   DW_AT_decl_column : 17
    <c0>   DW_AT_type        : <0xa0>
    <c4>   DW_AT_data_member_location: 4
 <2><c5>: Abbrev Number: 1 (DW_TAG_member)
    <c6>   DW_AT_name        : (indirect string, offset: 0x8943c): OSPEEDR
    <ca>   DW_AT_decl_file   : 4
    <ca>   DW_AT_decl_line   : 535
    <cc>   DW_AT_decl_column : 17
    <cc>   DW_AT_type        : <0xa0>
    <d0>   DW_AT_data_member_location: 8
 <2><d1>: Abbrev Number: 1 (DW_TAG_member)
    <d2>   DW_AT_name        : (indirect string, offset: 0x66acb): PUPDR
    <d6>   DW_AT_decl_file   : 4
    <d6>   DW_AT_decl_line   : 536
    <d8>   DW_AT_decl_column : 17
    <d8>   DW_AT_type        : <0xa0>
    <dc>   DW_AT_data_member_location: 12
 <2><dd>: Abbrev Number: 2 (DW_TAG_member)
    <de>   DW_AT_name        : IDR
    <e2>   DW_AT_decl_file   : 4
    <e2>   DW_AT_decl_line   : 537
    <e4>   DW_AT_decl_column : 17
    <e4>   DW_AT_type        : <0xa0>
    <e8>   DW_AT_data_member_location: 16
 <2><e9>: Abbrev Number: 2 (DW_TAG_member)
    <ea>   DW_AT_name        : ODR
    <ee>   DW_AT_decl_file   : 4
    <ee>   DW_AT_decl_line   : 538
    <f0>   DW_AT_decl_column : 17
    <f0>   DW_AT_type        : <0xa0>
    <f4>   DW_AT_data_member_location: 20
 <2><f5>: Abbrev Number: 1 (DW_TAG_member)
    <f6>   DW_AT_name        : (indirect string, offset: 0x239ce): BSRR
    <fa>   DW_AT_decl_file   : 4
    <fa>   DW_AT_decl_line   : 539
    <fc>   DW_AT_decl_column : 17
    <fc>   DW_AT_type        : <0xa0>
    <100>   DW_AT_data_member_location: 24
 <2><101>: Abbrev Number: 1 (DW_TAG_member)
    <102>   DW_AT_name        : (indirect string, offset: 0x877cc): LCKR
    <106>   DW_AT_decl_file   : 4
    <106>   DW_AT_decl_line   : 540
    <108>   DW_AT_decl_column : 17
    <108>   DW_AT_type        : <0xa0>
    <10c>   DW_AT_data_member_location: 28
 <2><10d>: Abbrev Number: 2 (DW_TAG_member)
    <10e>   DW_AT_name        : AFR
    <112>   DW_AT_decl_file   : 4
    <112>   DW_AT_decl_line   : 541
    <114>   DW_AT_decl_column : 17
    <114>   DW_AT_type        : <0x142>
    <118>   DW_AT_data_member_location: 32
 <2><119>: Abbrev Number: 2 (DW_TAG_member)
    <11a>   DW_AT_name        : BRR
    <11e>   DW_AT_decl_file   : 4
    <11e>   DW_AT_decl_line   : 542
    <120>   DW_AT_decl_column : 17
    <120>   DW_AT_type        : <0xa0>
    <124>   DW_AT_data_member_location: 40
 <2><125>: Abbrev Number: 1 (DW_TAG_member)
    <126>   DW_AT_name        : (indirect string, offset: 0x1b92): ASCR
    <12a>   DW_AT_decl_file   : 4
    <12a>   DW_AT_decl_line   : 543
    <12c>   DW_AT_decl_column : 17
    <12c>   DW_AT_type        : <0xa0>
    <130>   DW_AT_data_member_location: 44
 <2><131>: Abbrev Number: 0
 <1><132>: Abbrev Number: 14 (DW_TAG_array_type)
    <133>   DW_AT_type        : <0xa0>
    <137>   DW_AT_sibling     : <0x142>
 <2><13b>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <13c>   DW_AT_type        : <0x81>
    <140>   DW_AT_upper_bound : 1
 <2><141>: Abbrev Number: 0
 <1><142>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <143>   DW_AT_type        : <0x132>
 <1><147>: Abbrev Number: 7 (DW_TAG_typedef)
    <148>   DW_AT_name        : (indirect string, offset: 0x991be): GPIO_TypeDef
    <14c>   DW_AT_decl_file   : 4
    <14c>   DW_AT_decl_line   : 545
    <14e>   DW_AT_decl_column : 3
    <14e>   DW_AT_type        : <0xa5>
 <1><152>: Abbrev Number: 6 (DW_TAG_structure_type)
    <153>   DW_AT_byte_size   : 44
    <154>   DW_AT_decl_file   : 4
    <154>   DW_AT_decl_line   : 552
    <156>   DW_AT_decl_column : 9
    <156>   DW_AT_sibling     : <0x1df>
 <2><15a>: Abbrev Number: 2 (DW_TAG_member)
    <15b>   DW_AT_name        : CR1
    <15f>   DW_AT_decl_file   : 4
    <15f>   DW_AT_decl_line   : 554
    <161>   DW_AT_decl_column : 17
    <161>   DW_AT_type        : <0xa0>
    <165>   DW_AT_data_member_location: 0
 <2><166>: Abbrev Number: 2 (DW_TAG_member)
    <167>   DW_AT_name        : CR2
    <16b>   DW_AT_decl_file   : 4
    <16b>   DW_AT_decl_line   : 555
    <16d>   DW_AT_decl_column : 17
    <16d>   DW_AT_type        : <0xa0>
    <171>   DW_AT_data_member_location: 4
 <2><172>: Abbrev Number: 1 (DW_TAG_member)
    <173>   DW_AT_name        : (indirect string, offset: 0x173c1): OAR1
    <177>   DW_AT_decl_file   : 4
    <177>   DW_AT_decl_line   : 556
    <179>   DW_AT_decl_column : 17
    <179>   DW_AT_type        : <0xa0>
    <17d>   DW_AT_data_member_location: 8
 <2><17e>: Abbrev Number: 1 (DW_TAG_member)
    <17f>   DW_AT_name        : (indirect string, offset: 0x434f3): OAR2
    <183>   DW_AT_decl_file   : 4
    <183>   DW_AT_decl_line   : 557
    <185>   DW_AT_decl_column : 17
    <185>   DW_AT_type        : <0xa0>
    <189>   DW_AT_data_member_location: 12
 <2><18a>: Abbrev Number: 1 (DW_TAG_member)
    <18b>   DW_AT_name        : (indirect string, offset: 0x5d953): TIMINGR
    <18f>   DW_AT_decl_file   : 4
    <18f>   DW_AT_decl_line   : 558
    <191>   DW_AT_decl_column : 17
    <191>   DW_AT_type        : <0xa0>
    <195>   DW_AT_data_member_location: 16
 <2><196>: Abbrev Number: 1 (DW_TAG_member)
    <197>   DW_AT_name        : (indirect string, offset: 0x80bfa): TIMEOUTR
    <19b>   DW_AT_decl_file   : 4
    <19b>   DW_AT_decl_line   : 559
    <19d>   DW_AT_decl_column : 17
    <19d>   DW_AT_type        : <0xa0>
    <1a1>   DW_AT_data_member_location: 20
 <2><1a2>: Abbrev Number: 2 (DW_TAG_member)
    <1a3>   DW_AT_name        : ISR
    <1a7>   DW_AT_decl_file   : 4
    <1a7>   DW_AT_decl_line   : 560
    <1a9>   DW_AT_decl_column : 17
    <1a9>   DW_AT_type        : <0xa0>
    <1ad>   DW_AT_data_member_location: 24
 <2><1ae>: Abbrev Number: 2 (DW_TAG_member)
    <1af>   DW_AT_name        : ICR
    <1b3>   DW_AT_decl_file   : 4
    <1b3>   DW_AT_decl_line   : 561
    <1b5>   DW_AT_decl_column : 17
    <1b5>   DW_AT_type        : <0xa0>
    <1b9>   DW_AT_data_member_location: 28
 <2><1ba>: Abbrev Number: 1 (DW_TAG_member)
    <1bb>   DW_AT_name        : (indirect string, offset: 0x6d8f7): PECR
    <1bf>   DW_AT_decl_file   : 4
    <1bf>   DW_AT_decl_line   : 562
    <1c1>   DW_AT_decl_column : 17
    <1c1>   DW_AT_type        : <0xa0>
    <1c5>   DW_AT_data_member_location: 32
 <2><1c6>: Abbrev Number: 1 (DW_TAG_member)
    <1c7>   DW_AT_name        : (indirect string, offset: 0x827da): RXDR
    <1cb>   DW_AT_decl_file   : 4
    <1cb>   DW_AT_decl_line   : 563
    <1cd>   DW_AT_decl_column : 17
    <1cd>   DW_AT_type        : <0xa0>
    <1d1>   DW_AT_data_member_location: 36
 <2><1d2>: Abbrev Number: 1 (DW_TAG_member)
    <1d3>   DW_AT_name        : (indirect string, offset: 0x1e74e): TXDR
    <1d7>   DW_AT_decl_file   : 4
    <1d7>   DW_AT_decl_line   : 564
    <1d9>   DW_AT_decl_column : 17
    <1d9>   DW_AT_type        : <0xa0>
    <1dd>   DW_AT_data_member_location: 40
 <2><1de>: Abbrev Number: 0
 <1><1df>: Abbrev Number: 7 (DW_TAG_typedef)
    <1e0>   DW_AT_name        : (indirect string, offset: 0x7c6fc): I2C_TypeDef
    <1e4>   DW_AT_decl_file   : 4
    <1e4>   DW_AT_decl_line   : 565
    <1e6>   DW_AT_decl_column : 3
    <1e6>   DW_AT_type        : <0x152>
 <1><1ea>: Abbrev Number: 6 (DW_TAG_structure_type)
    <1eb>   DW_AT_byte_size   : 152
    <1ec>   DW_AT_decl_file   : 4
    <1ec>   DW_AT_decl_line   : 685
    <1ee>   DW_AT_decl_column : 9
    <1ee>   DW_AT_sibling     : <0x3ba>
 <2><1f2>: Abbrev Number: 2 (DW_TAG_member)
    <1f3>   DW_AT_name        : CR
    <1f6>   DW_AT_decl_file   : 4
    <1f6>   DW_AT_decl_line   : 687
    <1f8>   DW_AT_decl_column : 17
    <1f8>   DW_AT_type        : <0xa0>
    <1fc>   DW_AT_data_member_location: 0
 <2><1fd>: Abbrev Number: 1 (DW_TAG_member)
    <1fe>   DW_AT_name        : (indirect string, offset: 0x6af09): ICSCR
    <202>   DW_AT_decl_file   : 4
    <202>   DW_AT_decl_line   : 688
    <204>   DW_AT_decl_column : 17
    <204>   DW_AT_type        : <0xa0>
    <208>   DW_AT_data_member_location: 4
 <2><209>: Abbrev Number: 1 (DW_TAG_member)
    <20a>   DW_AT_name        : (indirect string, offset: 0x3467c): CFGR
    <20e>   DW_AT_decl_file   : 4
    <20e>   DW_AT_decl_line   : 689
    <210>   DW_AT_decl_column : 17
    <210>   DW_AT_type        : <0xa0>
    <214>   DW_AT_data_member_location: 8
 <2><215>: Abbrev Number: 1 (DW_TAG_member)
    <216>   DW_AT_name        : (indirect string, offset: 0x6f09b): PLLCFGR
    <21a>   DW_AT_decl_file   : 4
    <21a>   DW_AT_decl_line   : 690
    <21c>   DW_AT_decl_column : 17
    <21c>   DW_AT_type        : <0xa0>
    <220>   DW_AT_data_member_location: 12
 <2><221>: Abbrev Number: 1 (DW_TAG_member)
    <222>   DW_AT_name        : (indirect string, offset: 0x34675): PLLSAI1CFGR
    <226>   DW_AT_decl_file   : 4
    <226>   DW_AT_decl_line   : 691
    <228>   DW_AT_decl_column : 17
    <228>   DW_AT_type        : <0xa0>
    <22c>   DW_AT_data_member_location: 16
 <2><22d>: Abbrev Number: 1 (DW_TAG_member)
    <22e>   DW_AT_name        : (indirect string, offset: 0x67514): PLLSAI2CFGR
    <232>   DW_AT_decl_file   : 4
    <232>   DW_AT_decl_line   : 692
    <234>   DW_AT_decl_column : 17
    <234>   DW_AT_type        : <0xa0>
    <238>   DW_AT_data_member_location: 20
 <2><239>: Abbrev Number: 1 (DW_TAG_member)
    <23a>   DW_AT_name        : (indirect string, offset: 0x1e2c): CIER
    <23e>   DW_AT_decl_file   : 4
    <23e>   DW_AT_decl_line   : 693
    <240>   DW_AT_decl_column : 17
    <240>   DW_AT_type        : <0xa0>
    <244>   DW_AT_data_member_location: 24
 <2><245>: Abbrev Number: 1 (DW_TAG_member)
    <246>   DW_AT_name        : (indirect string, offset: 0x21bc): CIFR
    <24a>   DW_AT_decl_file   : 4
    <24a>   DW_AT_decl_line   : 694
    <24c>   DW_AT_decl_column : 17
    <24c>   DW_AT_type        : <0xa0>
    <250>   DW_AT_data_member_location: 28
 <2><251>: Abbrev Number: 1 (DW_TAG_member)
    <252>   DW_AT_name        : (indirect string, offset: 0x14c7): CICR
    <256>   DW_AT_decl_file   : 4
    <256>   DW_AT_decl_line   : 695
    <258>   DW_AT_decl_column : 17
    <258>   DW_AT_type        : <0xa0>
    <25c>   DW_AT_data_member_location: 32
 <2><25d>: Abbrev Number: 1 (DW_TAG_member)
    <25e>   DW_AT_name        : (indirect string, offset: 0x9493c): RESERVED0
    <262>   DW_AT_decl_file   : 4
    <262>   DW_AT_decl_line   : 696
    <264>   DW_AT_decl_column : 17
    <264>   DW_AT_type        : <0x94>
    <268>   DW_AT_data_member_location: 36
 <2><269>: Abbrev Number: 1 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0x7df26): AHB1RSTR
    <26e>   DW_AT_decl_file   : 4
    <26e>   DW_AT_decl_line   : 697
    <270>   DW_AT_decl_column : 17
    <270>   DW_AT_type        : <0xa0>
    <274>   DW_AT_data_member_location: 40
 <2><275>: Abbrev Number: 1 (DW_TAG_member)
    <276>   DW_AT_name        : (indirect string, offset: 0x1d1e6): AHB2RSTR
    <27a>   DW_AT_decl_file   : 4
    <27a>   DW_AT_decl_line   : 698
    <27c>   DW_AT_decl_column : 17
    <27c>   DW_AT_type        : <0xa0>
    <280>   DW_AT_data_member_location: 44
 <2><281>: Abbrev Number: 1 (DW_TAG_member)
    <282>   DW_AT_name        : (indirect string, offset: 0x342fc): AHB3RSTR
    <286>   DW_AT_decl_file   : 4
    <286>   DW_AT_decl_line   : 699
    <288>   DW_AT_decl_column : 17
    <288>   DW_AT_type        : <0xa0>
    <28c>   DW_AT_data_member_location: 48
 <2><28d>: Abbrev Number: 1 (DW_TAG_member)
    <28e>   DW_AT_name        : (indirect string, offset: 0x94946): RESERVED1
    <292>   DW_AT_decl_file   : 4
    <292>   DW_AT_decl_line   : 700
    <294>   DW_AT_decl_column : 17
    <294>   DW_AT_type        : <0x94>
    <298>   DW_AT_data_member_location: 52
 <2><299>: Abbrev Number: 1 (DW_TAG_member)
    <29a>   DW_AT_name        : (indirect string, offset: 0x20267): APB1RSTR1
    <29e>   DW_AT_decl_file   : 4
    <29e>   DW_AT_decl_line   : 701
    <2a0>   DW_AT_decl_column : 17
    <2a0>   DW_AT_type        : <0xa0>
    <2a4>   DW_AT_data_member_location: 56
 <2><2a5>: Abbrev Number: 1 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x20271): APB1RSTR2
    <2aa>   DW_AT_decl_file   : 4
    <2aa>   DW_AT_decl_line   : 702
    <2ac>   DW_AT_decl_column : 17
    <2ac>   DW_AT_type        : <0xa0>
    <2b0>   DW_AT_data_member_location: 60
 <2><2b1>: Abbrev Number: 1 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0x452dd): APB2RSTR
    <2b6>   DW_AT_decl_file   : 4
    <2b6>   DW_AT_decl_line   : 703
    <2b8>   DW_AT_decl_column : 17
    <2b8>   DW_AT_type        : <0xa0>
    <2bc>   DW_AT_data_member_location: 64
 <2><2bd>: Abbrev Number: 1 (DW_TAG_member)
    <2be>   DW_AT_name        : (indirect string, offset: 0x94950): RESERVED2
    <2c2>   DW_AT_decl_file   : 4
    <2c2>   DW_AT_decl_line   : 704
    <2c4>   DW_AT_decl_column : 17
    <2c4>   DW_AT_type        : <0x94>
    <2c8>   DW_AT_data_member_location: 68
 <2><2c9>: Abbrev Number: 1 (DW_TAG_member)
    <2ca>   DW_AT_name        : (indirect string, offset: 0xc55f): AHB1ENR
    <2ce>   DW_AT_decl_file   : 4
    <2ce>   DW_AT_decl_line   : 705
    <2d0>   DW_AT_decl_column : 17
    <2d0>   DW_AT_type        : <0xa0>
    <2d4>   DW_AT_data_member_location: 72
 <2><2d5>: Abbrev Number: 1 (DW_TAG_member)
    <2d6>   DW_AT_name        : (indirect string, offset: 0x2a2c6): AHB2ENR
    <2da>   DW_AT_decl_file   : 4
    <2da>   DW_AT_decl_line   : 706
    <2dc>   DW_AT_decl_column : 17
    <2dc>   DW_AT_type        : <0xa0>
    <2e0>   DW_AT_data_member_location: 76
 <2><2e1>: Abbrev Number: 1 (DW_TAG_member)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x477c6): AHB3ENR
    <2e6>   DW_AT_decl_file   : 4
    <2e6>   DW_AT_decl_line   : 707
    <2e8>   DW_AT_decl_column : 17
    <2e8>   DW_AT_type        : <0xa0>
    <2ec>   DW_AT_data_member_location: 80
 <2><2ed>: Abbrev Number: 1 (DW_TAG_member)
    <2ee>   DW_AT_name        : (indirect string, offset: 0x9495a): RESERVED3
    <2f2>   DW_AT_decl_file   : 4
    <2f2>   DW_AT_decl_line   : 708
    <2f4>   DW_AT_decl_column : 17
    <2f4>   DW_AT_type        : <0x94>
    <2f8>   DW_AT_data_member_location: 84
 <2><2f9>: Abbrev Number: 1 (DW_TAG_member)
    <2fa>   DW_AT_name        : (indirect string, offset: 0x5150): APB1ENR1
    <2fe>   DW_AT_decl_file   : 4
    <2fe>   DW_AT_decl_line   : 709
    <300>   DW_AT_decl_column : 17
    <300>   DW_AT_type        : <0xa0>
    <304>   DW_AT_data_member_location: 88
 <2><305>: Abbrev Number: 1 (DW_TAG_member)
    <306>   DW_AT_name        : (indirect string, offset: 0x5159): APB1ENR2
    <30a>   DW_AT_decl_file   : 4
    <30a>   DW_AT_decl_line   : 710
    <30c>   DW_AT_decl_column : 17
    <30c>   DW_AT_type        : <0xa0>
    <310>   DW_AT_data_member_location: 92
 <2><311>: Abbrev Number: 1 (DW_TAG_member)
    <312>   DW_AT_name        : (indirect string, offset: 0x12841): APB2ENR
    <316>   DW_AT_decl_file   : 4
    <316>   DW_AT_decl_line   : 711
    <318>   DW_AT_decl_column : 17
    <318>   DW_AT_type        : <0xa0>
    <31c>   DW_AT_data_member_location: 96
 <2><31d>: Abbrev Number: 1 (DW_TAG_member)
    <31e>   DW_AT_name        : (indirect string, offset: 0x5871a): RESERVED4
    <322>   DW_AT_decl_file   : 4
    <322>   DW_AT_decl_line   : 712
    <324>   DW_AT_decl_column : 17
    <324>   DW_AT_type        : <0x94>
    <328>   DW_AT_data_member_location: 100
 <2><329>: Abbrev Number: 1 (DW_TAG_member)
    <32a>   DW_AT_name        : (indirect string, offset: 0x49225): AHB1SMENR
    <32e>   DW_AT_decl_file   : 4
    <32e>   DW_AT_decl_line   : 713
    <330>   DW_AT_decl_column : 17
    <330>   DW_AT_type        : <0xa0>
    <334>   DW_AT_data_member_location: 104
 <2><335>: Abbrev Number: 1 (DW_TAG_member)
    <336>   DW_AT_name        : (indirect string, offset: 0x908e2): AHB2SMENR
    <33a>   DW_AT_decl_file   : 4
    <33a>   DW_AT_decl_line   : 714
    <33c>   DW_AT_decl_column : 17
    <33c>   DW_AT_type        : <0xa0>
    <340>   DW_AT_data_member_location: 108
 <2><341>: Abbrev Number: 1 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0x3a54b): AHB3SMENR
    <346>   DW_AT_decl_file   : 4
    <346>   DW_AT_decl_line   : 715
    <348>   DW_AT_decl_column : 17
    <348>   DW_AT_type        : <0xa0>
    <34c>   DW_AT_data_member_location: 112
 <2><34d>: Abbrev Number: 1 (DW_TAG_member)
    <34e>   DW_AT_name        : (indirect string, offset: 0x94988): RESERVED5
    <352>   DW_AT_decl_file   : 4
    <352>   DW_AT_decl_line   : 716
    <354>   DW_AT_decl_column : 17
    <354>   DW_AT_type        : <0x94>
    <358>   DW_AT_data_member_location: 116
 <2><359>: Abbrev Number: 1 (DW_TAG_member)
    <35a>   DW_AT_name        : (indirect string, offset: 0x59e2): APB1SMENR1
    <35e>   DW_AT_decl_file   : 4
    <35e>   DW_AT_decl_line   : 717
    <360>   DW_AT_decl_column : 17
    <360>   DW_AT_type        : <0xa0>
    <364>   DW_AT_data_member_location: 120
 <2><365>: Abbrev Number: 1 (DW_TAG_member)
    <366>   DW_AT_name        : (indirect string, offset: 0x59ed): APB1SMENR2
    <36a>   DW_AT_decl_file   : 4
    <36a>   DW_AT_decl_line   : 718
    <36c>   DW_AT_decl_column : 17
    <36c>   DW_AT_type        : <0xa0>
    <370>   DW_AT_data_member_location: 124
 <2><371>: Abbrev Number: 1 (DW_TAG_member)
    <372>   DW_AT_name        : (indirect string, offset: 0x7f712): APB2SMENR
    <376>   DW_AT_decl_file   : 4
    <376>   DW_AT_decl_line   : 719
    <378>   DW_AT_decl_column : 17
    <378>   DW_AT_type        : <0xa0>
    <37c>   DW_AT_data_member_location: 128
 <2><37d>: Abbrev Number: 1 (DW_TAG_member)
    <37e>   DW_AT_name        : (indirect string, offset: 0x94992): RESERVED6
    <382>   DW_AT_decl_file   : 4
    <382>   DW_AT_decl_line   : 720
    <384>   DW_AT_decl_column : 17
    <384>   DW_AT_type        : <0x94>
    <388>   DW_AT_data_member_location: 132
 <2><389>: Abbrev Number: 1 (DW_TAG_member)
    <38a>   DW_AT_name        : (indirect string, offset: 0x30a18): CCIPR
    <38e>   DW_AT_decl_file   : 4
    <38e>   DW_AT_decl_line   : 721
    <390>   DW_AT_decl_column : 17
    <390>   DW_AT_type        : <0xa0>
    <394>   DW_AT_data_member_location: 136
 <2><395>: Abbrev Number: 1 (DW_TAG_member)
    <396>   DW_AT_name        : (indirect string, offset: 0x9499c): RESERVED7
    <39a>   DW_AT_decl_file   : 4
    <39a>   DW_AT_decl_line   : 722
    <39c>   DW_AT_decl_column : 17
    <39c>   DW_AT_type        : <0x94>
    <3a0>   DW_AT_data_member_location: 140
 <2><3a1>: Abbrev Number: 1 (DW_TAG_member)
    <3a2>   DW_AT_name        : (indirect string, offset: 0x29516): BDCR
    <3a6>   DW_AT_decl_file   : 4
    <3a6>   DW_AT_decl_line   : 723
    <3a8>   DW_AT_decl_column : 17
    <3a8>   DW_AT_type        : <0xa0>
    <3ac>   DW_AT_data_member_location: 144
 <2><3ad>: Abbrev Number: 2 (DW_TAG_member)
    <3ae>   DW_AT_name        : CSR
    <3b2>   DW_AT_decl_file   : 4
    <3b2>   DW_AT_decl_line   : 724
    <3b4>   DW_AT_decl_column : 17
    <3b4>   DW_AT_type        : <0xa0>
    <3b8>   DW_AT_data_member_location: 148
 <2><3b9>: Abbrev Number: 0
 <1><3ba>: Abbrev Number: 7 (DW_TAG_typedef)
    <3bb>   DW_AT_name        : (indirect string, offset: 0x49a83): RCC_TypeDef
    <3bf>   DW_AT_decl_file   : 4
    <3bf>   DW_AT_decl_line   : 725
    <3c1>   DW_AT_decl_column : 3
    <3c1>   DW_AT_type        : <0x1ea>
 <1><3c5>: Abbrev Number: 16 (DW_TAG_variable)
    <3c6>   DW_AT_name        : (indirect string, offset: 0x82942): tmpreg
    <3ca>   DW_AT_decl_file   : 1
    <3cb>   DW_AT_decl_line   : 4
    <3cc>   DW_AT_decl_column : 19
    <3cd>   DW_AT_type        : <0xa0>
    <3d1>   DW_AT_external    : 1
    <3d1>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><3d7>: Abbrev Number: 17 (DW_TAG_subprogram)
    <3d8>   DW_AT_external    : 1
    <3d8>   DW_AT_name        : (indirect string, offset: 0x293b5): I2C1_Config
    <3dc>   DW_AT_decl_file   : 1
    <3dd>   DW_AT_decl_line   : 110
    <3de>   DW_AT_decl_column : 6
    <3df>   DW_AT_prototyped  : 1
    <3df>   DW_AT_low_pc      : 0x8000774
    <3e3>   DW_AT_high_pc     : 0x118
    <3e7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3e9>   DW_AT_call_all_calls: 1
 <1><3e9>: Abbrev Number: 9 (DW_TAG_subprogram)
    <3ea>   DW_AT_external    : 1
    <3ea>   DW_AT_name        : (indirect string, offset: 0x6dcf): I2C1_Write
    <3ee>   DW_AT_decl_file   : 1
    <3ee>   DW_AT_decl_line   : 87
    <3ef>   DW_AT_decl_column : 6
    <3ef>   DW_AT_prototyped  : 1
    <3ef>   DW_AT_low_pc      : 0x80006ec
    <3f3>   DW_AT_high_pc     : 0x88
    <3f7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3f9>   DW_AT_call_all_calls: 1
    <3f9>   DW_AT_sibling     : <0x428>
 <2><3fd>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <3fe>   DW_AT_name        : (indirect string, offset: 0x2dac8): devAddr
    <402>   DW_AT_decl_file   : 1
    <402>   DW_AT_decl_line   : 87
    <403>   DW_AT_decl_column : 25
    <404>   DW_AT_type        : <0x88>
    <408>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><40b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <40c>   DW_AT_name        : (indirect string, offset: 0x59d93): regAddr
    <410>   DW_AT_decl_file   : 1
    <410>   DW_AT_decl_line   : 87
    <411>   DW_AT_decl_column : 42
    <412>   DW_AT_type        : <0x88>
    <416>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><419>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <41a>   DW_AT_name        : (indirect string, offset: 0x4a1e8): data
    <41e>   DW_AT_decl_file   : 1
    <41e>   DW_AT_decl_line   : 87
    <41f>   DW_AT_decl_column : 59
    <420>   DW_AT_type        : <0x88>
    <424>   DW_AT_location    : 2 byte block: 91 75 	(DW_OP_fbreg: -11)
 <2><427>: Abbrev Number: 0
 <1><428>: Abbrev Number: 18 (DW_TAG_subprogram)
    <429>   DW_AT_external    : 1
    <429>   DW_AT_name        : (indirect string, offset: 0x6dded): I2C1_Read
    <42d>   DW_AT_decl_file   : 1
    <42e>   DW_AT_decl_line   : 39
    <42f>   DW_AT_decl_column : 9
    <430>   DW_AT_prototyped  : 1
    <430>   DW_AT_type        : <0x88>
    <434>   DW_AT_low_pc      : 0x8000634
    <438>   DW_AT_high_pc     : 0xb8
    <43c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <43e>   DW_AT_call_all_calls: 1
    <43e>   DW_AT_sibling     : <0x47b>
 <2><442>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <443>   DW_AT_name        : (indirect string, offset: 0x2dac8): devAddr
    <447>   DW_AT_decl_file   : 1
    <447>   DW_AT_decl_line   : 39
    <448>   DW_AT_decl_column : 27
    <449>   DW_AT_type        : <0x88>
    <44d>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><450>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <451>   DW_AT_name        : (indirect string, offset: 0x59d93): regAddr
    <455>   DW_AT_decl_file   : 1
    <455>   DW_AT_decl_line   : 39
    <456>   DW_AT_decl_column : 44
    <457>   DW_AT_type        : <0x88>
    <45b>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><45e>: Abbrev Number: 10 (DW_TAG_variable)
    <45f>   DW_AT_name        : (indirect string, offset: 0x4a1e8): data
    <463>   DW_AT_decl_file   : 1
    <463>   DW_AT_decl_line   : 40
    <464>   DW_AT_decl_column : 10
    <465>   DW_AT_type        : <0x88>
    <469>   DW_AT_location    : 2 byte block: 91 73 	(DW_OP_fbreg: -13)
 <2><46c>: Abbrev Number: 10 (DW_TAG_variable)
    <46d>   DW_AT_name        : (indirect string, offset: 0x28e5): timeout
    <471>   DW_AT_decl_file   : 1
    <471>   DW_AT_decl_line   : 50
    <472>   DW_AT_decl_column : 11
    <473>   DW_AT_type        : <0x94>
    <477>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><47a>: Abbrev Number: 0
 <1><47b>: Abbrev Number: 9 (DW_TAG_subprogram)
    <47c>   DW_AT_external    : 1
    <47c>   DW_AT_name        : (indirect string, offset: 0x3bfb2): I2C1_MultiRead
    <480>   DW_AT_decl_file   : 1
    <480>   DW_AT_decl_line   : 7
    <481>   DW_AT_decl_column : 6
    <481>   DW_AT_prototyped  : 1
    <481>   DW_AT_low_pc      : 0x8000560
    <485>   DW_AT_high_pc     : 0xd4
    <489>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <48b>   DW_AT_call_all_calls: 1
    <48b>   DW_AT_sibling     : <0x4dd>
 <2><48f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <490>   DW_AT_name        : (indirect string, offset: 0x2dac8): devAddr
    <494>   DW_AT_decl_file   : 1
    <494>   DW_AT_decl_line   : 7
    <495>   DW_AT_decl_column : 29
    <496>   DW_AT_type        : <0x88>
    <49a>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><49d>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <49e>   DW_AT_name        : (indirect string, offset: 0x59d93): regAddr
    <4a2>   DW_AT_decl_file   : 1
    <4a2>   DW_AT_decl_line   : 7
    <4a3>   DW_AT_decl_column : 46
    <4a4>   DW_AT_type        : <0x88>
    <4a8>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><4ab>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <4ac>   DW_AT_name        : buf
    <4b0>   DW_AT_decl_file   : 1
    <4b0>   DW_AT_decl_line   : 7
    <4b0>   DW_AT_decl_column : 64
    <4b1>   DW_AT_type        : <0x4dd>
    <4b5>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><4b8>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <4b9>   DW_AT_name        : len
    <4bd>   DW_AT_decl_file   : 1
    <4bd>   DW_AT_decl_line   : 7
    <4bd>   DW_AT_decl_column : 77
    <4be>   DW_AT_type        : <0x88>
    <4c2>   DW_AT_location    : 2 byte block: 91 6d 	(DW_OP_fbreg: -19)
 <2><4c5>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <4c6>   DW_AT_low_pc      : 0x80005e0
    <4ca>   DW_AT_high_pc     : 0x30
 <3><4ce>: Abbrev Number: 20 (DW_TAG_variable)
    <4cf>   DW_AT_name        : i
    <4d1>   DW_AT_decl_file   : 1
    <4d2>   DW_AT_decl_line   : 29
    <4d3>   DW_AT_decl_column : 17
    <4d4>   DW_AT_type        : <0x88>
    <4d8>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <3><4db>: Abbrev Number: 0
 <2><4dc>: Abbrev Number: 0
 <1><4dd>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <4de>   DW_AT_byte_size   : 4
    <4df>   DW_AT_type        : <0x88>
 <1><4e3>: Abbrev Number: 0
  Compilation Unit @ offset 0x4e4:
   Length:        0x1d6 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x15c
   Pointer Size:  4
 <0><4f0>: Abbrev Number: 7 (DW_TAG_compile_unit)
    <4f1>   DW_AT_producer    : (indirect string, offset: 0x299f7): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <4f5>   DW_AT_language    : 29	(C11)
    <4f6>   DW_AT_name        : (indirect string, offset: 0x9e39e): ../Core/Src/Drivers/LSM6DS3.c
    <4fa>   DW_AT_comp_dir    : (indirect string, offset: 0x5752b): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <4fe>   DW_AT_ranges      : 0x35
    <502>   DW_AT_low_pc      : 0
    <506>   DW_AT_stmt_list   : 0x7c3
    <50a>   DW_AT_macros      : 0x1c3fc
 <1><50e>: Abbrev Number: 1 (DW_TAG_base_type)
    <50f>   DW_AT_byte_size   : 1
    <510>   DW_AT_encoding    : 6	(signed char)
    <511>   DW_AT_name        : (indirect string, offset: 0x4fcee): signed char
 <1><515>: Abbrev Number: 3 (DW_TAG_typedef)
    <516>   DW_AT_name        : (indirect string, offset: 0x2e557): __uint8_t
    <51a>   DW_AT_decl_file   : 2
    <51b>   DW_AT_decl_line   : 43
    <51c>   DW_AT_decl_column : 24
    <51d>   DW_AT_type        : <0x521>
 <1><521>: Abbrev Number: 1 (DW_TAG_base_type)
    <522>   DW_AT_byte_size   : 1
    <523>   DW_AT_encoding    : 8	(unsigned char)
    <524>   DW_AT_name        : (indirect string, offset: 0x98270): unsigned char
 <1><528>: Abbrev Number: 3 (DW_TAG_typedef)
    <529>   DW_AT_name        : (indirect string, offset: 0x9e2fb): __int16_t
    <52d>   DW_AT_decl_file   : 2
    <52e>   DW_AT_decl_line   : 55
    <52f>   DW_AT_decl_column : 24
    <530>   DW_AT_type        : <0x534>
 <1><534>: Abbrev Number: 1 (DW_TAG_base_type)
    <535>   DW_AT_byte_size   : 2
    <536>   DW_AT_encoding    : 5	(signed)
    <537>   DW_AT_name        : (indirect string, offset: 0x75845): short int
 <1><53b>: Abbrev Number: 3 (DW_TAG_typedef)
    <53c>   DW_AT_name        : (indirect string, offset: 0x9e442): __uint16_t
    <540>   DW_AT_decl_file   : 2
    <541>   DW_AT_decl_line   : 57
    <542>   DW_AT_decl_column : 25
    <543>   DW_AT_type        : <0x547>
 <1><547>: Abbrev Number: 1 (DW_TAG_base_type)
    <548>   DW_AT_byte_size   : 2
    <549>   DW_AT_encoding    : 7	(unsigned)
    <54a>   DW_AT_name        : (indirect string, offset: 0x970ad): short unsigned int
 <1><54e>: Abbrev Number: 1 (DW_TAG_base_type)
    <54f>   DW_AT_byte_size   : 4
    <550>   DW_AT_encoding    : 5	(signed)
    <551>   DW_AT_name        : (indirect string, offset: 0xcd62): long int
 <1><555>: Abbrev Number: 1 (DW_TAG_base_type)
    <556>   DW_AT_byte_size   : 4
    <557>   DW_AT_encoding    : 7	(unsigned)
    <558>   DW_AT_name        : (indirect string, offset: 0x3ccba): long unsigned int
 <1><55c>: Abbrev Number: 1 (DW_TAG_base_type)
    <55d>   DW_AT_byte_size   : 8
    <55e>   DW_AT_encoding    : 5	(signed)
    <55f>   DW_AT_name        : (indirect string, offset: 0x4895f): long long int
 <1><563>: Abbrev Number: 1 (DW_TAG_base_type)
    <564>   DW_AT_byte_size   : 8
    <565>   DW_AT_encoding    : 7	(unsigned)
    <566>   DW_AT_name        : (indirect string, offset: 0x20f4b): long long unsigned int
 <1><56a>: Abbrev Number: 8 (DW_TAG_base_type)
    <56b>   DW_AT_byte_size   : 4
    <56c>   DW_AT_encoding    : 5	(signed)
    <56d>   DW_AT_name        : int
 <1><571>: Abbrev Number: 1 (DW_TAG_base_type)
    <572>   DW_AT_byte_size   : 4
    <573>   DW_AT_encoding    : 7	(unsigned)
    <574>   DW_AT_name        : (indirect string, offset: 0xc599): unsigned int
 <1><578>: Abbrev Number: 3 (DW_TAG_typedef)
    <579>   DW_AT_name        : (indirect string, offset: 0x2e559): uint8_t
    <57d>   DW_AT_decl_file   : 3
    <57e>   DW_AT_decl_line   : 24
    <57f>   DW_AT_decl_column : 19
    <580>   DW_AT_type        : <0x515>
 <1><584>: Abbrev Number: 3 (DW_TAG_typedef)
    <585>   DW_AT_name        : (indirect string, offset: 0x9e2fd): int16_t
    <589>   DW_AT_decl_file   : 3
    <58a>   DW_AT_decl_line   : 32
    <58b>   DW_AT_decl_column : 19
    <58c>   DW_AT_type        : <0x528>
 <1><590>: Abbrev Number: 3 (DW_TAG_typedef)
    <591>   DW_AT_name        : (indirect string, offset: 0x9e444): uint16_t
    <595>   DW_AT_decl_file   : 3
    <596>   DW_AT_decl_line   : 36
    <597>   DW_AT_decl_column : 20
    <598>   DW_AT_type        : <0x53b>
 <1><59c>: Abbrev Number: 9 (DW_TAG_structure_type)
    <59d>   DW_AT_byte_size   : 12
    <59e>   DW_AT_decl_file   : 4
    <59f>   DW_AT_decl_line   : 34
    <5a0>   DW_AT_decl_column : 9
    <5a1>   DW_AT_sibling     : <0x5e8>
 <2><5a5>: Abbrev Number: 4 (DW_TAG_member)
    <5a6>   DW_AT_name        : gx
    <5a9>   DW_AT_decl_file   : 4
    <5a9>   DW_AT_decl_line   : 35
    <5aa>   DW_AT_decl_column : 10
    <5ab>   DW_AT_type        : <0x584>
    <5af>   DW_AT_data_member_location: 0
 <2><5b0>: Abbrev Number: 4 (DW_TAG_member)
    <5b1>   DW_AT_name        : gy
    <5b4>   DW_AT_decl_file   : 4
    <5b4>   DW_AT_decl_line   : 35
    <5b5>   DW_AT_decl_column : 14
    <5b6>   DW_AT_type        : <0x584>
    <5ba>   DW_AT_data_member_location: 2
 <2><5bb>: Abbrev Number: 4 (DW_TAG_member)
    <5bc>   DW_AT_name        : gz
    <5bf>   DW_AT_decl_file   : 4
    <5bf>   DW_AT_decl_line   : 35
    <5c0>   DW_AT_decl_column : 18
    <5c1>   DW_AT_type        : <0x584>
    <5c5>   DW_AT_data_member_location: 4
 <2><5c6>: Abbrev Number: 4 (DW_TAG_member)
    <5c7>   DW_AT_name        : ax
    <5ca>   DW_AT_decl_file   : 4
    <5ca>   DW_AT_decl_line   : 36
    <5cb>   DW_AT_decl_column : 10
    <5cc>   DW_AT_type        : <0x584>
    <5d0>   DW_AT_data_member_location: 6
 <2><5d1>: Abbrev Number: 4 (DW_TAG_member)
    <5d2>   DW_AT_name        : ay
    <5d5>   DW_AT_decl_file   : 4
    <5d5>   DW_AT_decl_line   : 36
    <5d6>   DW_AT_decl_column : 14
    <5d7>   DW_AT_type        : <0x584>
    <5db>   DW_AT_data_member_location: 8
 <2><5dc>: Abbrev Number: 4 (DW_TAG_member)
    <5dd>   DW_AT_name        : az
    <5e0>   DW_AT_decl_file   : 4
    <5e0>   DW_AT_decl_line   : 36
    <5e1>   DW_AT_decl_column : 18
    <5e2>   DW_AT_type        : <0x584>
    <5e6>   DW_AT_data_member_location: 10
 <2><5e7>: Abbrev Number: 0
 <1><5e8>: Abbrev Number: 3 (DW_TAG_typedef)
    <5e9>   DW_AT_name        : (indirect string, offset: 0x9e3f8): LSM6DS3_Sample
    <5ed>   DW_AT_decl_file   : 4
    <5ee>   DW_AT_decl_line   : 37
    <5ef>   DW_AT_decl_column : 2
    <5f0>   DW_AT_type        : <0x59c>
 <1><5f4>: Abbrev Number: 5 (DW_TAG_subprogram)
    <5f5>   DW_AT_external    : 1
    <5f5>   DW_AT_name        : (indirect string, offset: 0x3bfb2): I2C1_MultiRead
    <5f9>   DW_AT_decl_file   : 5
    <5f9>   DW_AT_decl_line   : 10
    <5fa>   DW_AT_decl_column : 6
    <5fa>   DW_AT_prototyped  : 1
    <5fa>   DW_AT_declaration : 1
    <5fa>   DW_AT_sibling     : <0x613>
 <2><5fe>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <5ff>   DW_AT_type        : <0x578>
 <2><603>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <604>   DW_AT_type        : <0x578>
 <2><608>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <609>   DW_AT_type        : <0x613>
 <2><60d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <60e>   DW_AT_type        : <0x578>
 <2><612>: Abbrev Number: 0
 <1><613>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <614>   DW_AT_byte_size   : 4
    <614>   DW_AT_type        : <0x578>
 <1><618>: Abbrev Number: 5 (DW_TAG_subprogram)
    <619>   DW_AT_external    : 1
    <619>   DW_AT_name        : (indirect string, offset: 0x6dcf): I2C1_Write
    <61d>   DW_AT_decl_file   : 5
    <61d>   DW_AT_decl_line   : 12
    <61e>   DW_AT_decl_column : 6
    <61e>   DW_AT_prototyped  : 1
    <61e>   DW_AT_declaration : 1
    <61e>   DW_AT_sibling     : <0x632>
 <2><622>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <623>   DW_AT_type        : <0x578>
 <2><627>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <628>   DW_AT_type        : <0x578>
 <2><62c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <62d>   DW_AT_type        : <0x578>
 <2><631>: Abbrev Number: 0
 <1><632>: Abbrev Number: 10 (DW_TAG_subprogram)
    <633>   DW_AT_external    : 1
    <633>   DW_AT_name        : (indirect string, offset: 0x6dded): I2C1_Read
    <637>   DW_AT_decl_file   : 5
    <638>   DW_AT_decl_line   : 11
    <639>   DW_AT_decl_column : 9
    <63a>   DW_AT_prototyped  : 1
    <63a>   DW_AT_type        : <0x578>
    <63e>   DW_AT_declaration : 1
    <63e>   DW_AT_sibling     : <0x64d>
 <2><642>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <643>   DW_AT_type        : <0x578>
 <2><647>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <648>   DW_AT_type        : <0x578>
 <2><64c>: Abbrev Number: 0
 <1><64d>: Abbrev Number: 11 (DW_TAG_subprogram)
    <64e>   DW_AT_external    : 1
    <64e>   DW_AT_name        : (indirect string, offset: 0x9e328): LSM6DS3_GyroAccelRead
    <652>   DW_AT_decl_file   : 1
    <653>   DW_AT_decl_line   : 20
    <654>   DW_AT_decl_column : 6
    <655>   DW_AT_prototyped  : 1
    <655>   DW_AT_low_pc      : 0x80008d0
    <659>   DW_AT_high_pc     : 0x8a
    <65d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <65f>   DW_AT_call_all_tail_calls: 1
    <65f>   DW_AT_sibling     : <0x682>
 <2><663>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <664>   DW_AT_name        : (indirect string, offset: 0x4a1e8): data
    <668>   DW_AT_decl_file   : 1
    <669>   DW_AT_decl_line   : 20
    <66a>   DW_AT_decl_column : 44
    <66b>   DW_AT_type        : <0x682>
    <66f>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><672>: Abbrev Number: 13 (DW_TAG_variable)
    <673>   DW_AT_name        : buf
    <677>   DW_AT_decl_file   : 1
    <678>   DW_AT_decl_line   : 21
    <679>   DW_AT_decl_column : 10
    <67a>   DW_AT_type        : <0x687>
    <67e>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><681>: Abbrev Number: 0
 <1><682>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <683>   DW_AT_byte_size   : 4
    <683>   DW_AT_type        : <0x5e8>
 <1><687>: Abbrev Number: 14 (DW_TAG_array_type)
    <688>   DW_AT_type        : <0x578>
    <68c>   DW_AT_sibling     : <0x697>
 <2><690>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <691>   DW_AT_type        : <0x571>
    <695>   DW_AT_upper_bound : 11
 <2><696>: Abbrev Number: 0
 <1><697>: Abbrev Number: 16 (DW_TAG_subprogram)
    <698>   DW_AT_external    : 1
    <698>   DW_AT_name        : (indirect string, offset: 0x9e33e): LSM6DS3_Init
    <69c>   DW_AT_decl_file   : 1
    <69d>   DW_AT_decl_line   : 6
    <69e>   DW_AT_decl_column : 9
    <69f>   DW_AT_prototyped  : 1
    <69f>   DW_AT_type        : <0x578>
    <6a3>   DW_AT_low_pc      : 0x800088c
    <6a7>   DW_AT_high_pc     : 0x44
    <6ab>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6ad>   DW_AT_call_all_tail_calls: 1
 <2><6ad>: Abbrev Number: 17 (DW_TAG_variable)
    <6ae>   DW_AT_name        : (indirect string, offset: 0x9e3bc): result
    <6b2>   DW_AT_decl_file   : 1
    <6b3>   DW_AT_decl_line   : 7
    <6b4>   DW_AT_decl_column : 10
    <6b5>   DW_AT_type        : <0x578>
    <6b9>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><6bc>: Abbrev Number: 0
 <1><6bd>: Abbrev Number: 0
  Compilation Unit @ offset 0x6be:
   Length:        0x126 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x272
   Pointer Size:  4
 <0><6ca>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <6cb>   DW_AT_producer    : (indirect string, offset: 0x299f7): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <6cf>   DW_AT_language    : 29	(C11)
    <6d0>   DW_AT_name        : (indirect string, offset: 0xb8ea1): ../Core/Src/freertos_hooks.c
    <6d4>   DW_AT_comp_dir    : (indirect string, offset: 0x5752b): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <6d8>   DW_AT_ranges      : 0x4f
    <6dc>   DW_AT_low_pc      : 0
    <6e0>   DW_AT_stmt_list   : 0xd58
    <6e4>   DW_AT_macros      : 0x1c543
 <1><6e8>: Abbrev Number: 7 (DW_TAG_base_type)
    <6e9>   DW_AT_byte_size   : 4
    <6ea>   DW_AT_encoding    : 5	(signed)
    <6eb>   DW_AT_name        : int
 <1><6ef>: Abbrev Number: 1 (DW_TAG_base_type)
    <6f0>   DW_AT_byte_size   : 4
    <6f1>   DW_AT_encoding    : 7	(unsigned)
    <6f2>   DW_AT_name        : (indirect string, offset: 0xc599): unsigned int
 <1><6f6>: Abbrev Number: 1 (DW_TAG_base_type)
    <6f7>   DW_AT_byte_size   : 8
    <6f8>   DW_AT_encoding    : 5	(signed)
    <6f9>   DW_AT_name        : (indirect string, offset: 0x4895f): long long int
 <1><6fd>: Abbrev Number: 1 (DW_TAG_base_type)
    <6fe>   DW_AT_byte_size   : 8
    <6ff>   DW_AT_encoding    : 4	(float)
    <700>   DW_AT_name        : (indirect string, offset: 0xe90f9): long double
 <1><704>: Abbrev Number: 1 (DW_TAG_base_type)
    <705>   DW_AT_byte_size   : 1
    <706>   DW_AT_encoding    : 6	(signed char)
    <707>   DW_AT_name        : (indirect string, offset: 0x4fcee): signed char
 <1><70b>: Abbrev Number: 2 (DW_TAG_typedef)
    <70c>   DW_AT_name        : (indirect string, offset: 0x2e557): __uint8_t
    <710>   DW_AT_decl_file   : 2
    <711>   DW_AT_decl_line   : 43
    <712>   DW_AT_decl_column : 24
    <713>   DW_AT_type        : <0x717>
 <1><717>: Abbrev Number: 1 (DW_TAG_base_type)
    <718>   DW_AT_byte_size   : 1
    <719>   DW_AT_encoding    : 8	(unsigned char)
    <71a>   DW_AT_name        : (indirect string, offset: 0x98270): unsigned char
 <1><71e>: Abbrev Number: 1 (DW_TAG_base_type)
    <71f>   DW_AT_byte_size   : 2
    <720>   DW_AT_encoding    : 5	(signed)
    <721>   DW_AT_name        : (indirect string, offset: 0x75845): short int
 <1><725>: Abbrev Number: 1 (DW_TAG_base_type)
    <726>   DW_AT_byte_size   : 2
    <727>   DW_AT_encoding    : 7	(unsigned)
    <728>   DW_AT_name        : (indirect string, offset: 0x970ad): short unsigned int
 <1><72c>: Abbrev Number: 1 (DW_TAG_base_type)
    <72d>   DW_AT_byte_size   : 4
    <72e>   DW_AT_encoding    : 5	(signed)
    <72f>   DW_AT_name        : (indirect string, offset: 0xcd62): long int
 <1><733>: Abbrev Number: 1 (DW_TAG_base_type)
    <734>   DW_AT_byte_size   : 4
    <735>   DW_AT_encoding    : 7	(unsigned)
    <736>   DW_AT_name        : (indirect string, offset: 0x3ccba): long unsigned int
 <1><73a>: Abbrev Number: 1 (DW_TAG_base_type)
    <73b>   DW_AT_byte_size   : 8
    <73c>   DW_AT_encoding    : 7	(unsigned)
    <73d>   DW_AT_name        : (indirect string, offset: 0x20f4b): long long unsigned int
 <1><741>: Abbrev Number: 2 (DW_TAG_typedef)
    <742>   DW_AT_name        : (indirect string, offset: 0x2e559): uint8_t
    <746>   DW_AT_decl_file   : 3
    <747>   DW_AT_decl_line   : 24
    <748>   DW_AT_decl_column : 19
    <749>   DW_AT_type        : <0x70b>
 <1><74d>: Abbrev Number: 3 (DW_TAG_const_type)
    <74e>   DW_AT_type        : <0x741>
 <1><752>: Abbrev Number: 2 (DW_TAG_typedef)
    <753>   DW_AT_name        : (indirect string, offset: 0xdec83): TaskHandle_t
    <757>   DW_AT_decl_file   : 4
    <758>   DW_AT_decl_line   : 95
    <759>   DW_AT_decl_column : 46
    <75a>   DW_AT_type        : <0x75e>
 <1><75e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <75f>   DW_AT_byte_size   : 4
    <75f>   DW_AT_type        : <0x763>
 <1><763>: Abbrev Number: 8 (DW_TAG_structure_type)
    <764>   DW_AT_name        : (indirect string, offset: 0xdd0b5): tskTaskControlBlock
    <768>   DW_AT_declaration : 1
 <1><768>: Abbrev Number: 1 (DW_TAG_base_type)
    <769>   DW_AT_byte_size   : 1
    <76a>   DW_AT_encoding    : 8	(unsigned char)
    <76b>   DW_AT_name        : (indirect string, offset: 0xb5d41): char
 <1><76f>: Abbrev Number: 9 (DW_TAG_array_type)
    <770>   DW_AT_type        : <0x74d>
    <774>   DW_AT_sibling     : <0x77f>
 <2><778>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <779>   DW_AT_type        : <0x6ef>
    <77d>   DW_AT_upper_bound : 6
 <2><77e>: Abbrev Number: 0
 <1><77f>: Abbrev Number: 3 (DW_TAG_const_type)
    <780>   DW_AT_type        : <0x76f>
 <1><784>: Abbrev Number: 11 (DW_TAG_variable)
    <785>   DW_AT_name        : (indirect string, offset: 0xace0f): CHANNEL_OFFSET_TAB
    <789>   DW_AT_decl_file   : 5
    <78a>   DW_AT_decl_line   : 49
    <78b>   DW_AT_decl_column : 22
    <78c>   DW_AT_type        : <0x77f>
    <790>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><796>: Abbrev Number: 12 (DW_TAG_subprogram)
    <797>   DW_AT_external    : 1
    <797>   DW_AT_name        : (indirect string, offset: 0xb6d4d): HAL_IncTick
    <79b>   DW_AT_decl_file   : 6
    <79c>   DW_AT_decl_line   : 651
    <79e>   DW_AT_decl_column : 20
    <79f>   DW_AT_prototyped  : 1
    <79f>   DW_AT_declaration : 1
 <1><79f>: Abbrev Number: 13 (DW_TAG_subprogram)
    <7a0>   DW_AT_external    : 1
    <7a0>   DW_AT_name        : (indirect string, offset: 0xbdf8d): vApplicationTickHook
    <7a4>   DW_AT_decl_file   : 1
    <7a5>   DW_AT_decl_line   : 11
    <7a6>   DW_AT_decl_column : 6
    <7a7>   DW_AT_prototyped  : 1
    <7a7>   DW_AT_low_pc      : 0x8000968
    <7ab>   DW_AT_high_pc     : 0xc
    <7af>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7b1>   DW_AT_call_all_tail_calls: 1
 <1><7b1>: Abbrev Number: 14 (DW_TAG_subprogram)
    <7b2>   DW_AT_external    : 1
    <7b2>   DW_AT_name        : (indirect string, offset: 0xb8992): vApplicationStackOverflowHook
    <7b6>   DW_AT_decl_file   : 1
    <7b7>   DW_AT_decl_line   : 5
    <7b8>   DW_AT_decl_column : 6
    <7b9>   DW_AT_prototyped  : 1
    <7b9>   DW_AT_low_pc      : 0x800095a
    <7bd>   DW_AT_high_pc     : 0xe
    <7c1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7c3>   DW_AT_call_all_calls: 1
    <7c3>   DW_AT_sibling     : <0x7e2>
 <2><7c7>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7c8>   DW_AT_name        : (indirect string, offset: 0xd3753): xTask
    <7cc>   DW_AT_decl_file   : 1
    <7cc>   DW_AT_decl_line   : 5
    <7cc>   DW_AT_decl_column : 49
    <7cd>   DW_AT_type        : <0x752>
    <7d1>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><7d4>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7d5>   DW_AT_name        : (indirect string, offset: 0xb73aa): pcTaskName
    <7d9>   DW_AT_decl_file   : 1
    <7d9>   DW_AT_decl_line   : 5
    <7d9>   DW_AT_decl_column : 62
    <7da>   DW_AT_type        : <0x7e2>
    <7de>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><7e1>: Abbrev Number: 0
 <1><7e2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7e3>   DW_AT_byte_size   : 4
    <7e3>   DW_AT_type        : <0x768>
 <1><7e7>: Abbrev Number: 0
  Compilation Unit @ offset 0x7e8:
   Length:        0x804 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x344
   Pointer Size:  4
 <0><7f4>: Abbrev Number: 21 (DW_TAG_compile_unit)
    <7f5>   DW_AT_producer    : (indirect string, offset: 0x299f7): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <7f9>   DW_AT_language    : 29	(C11)
    <7fa>   DW_AT_name        : (indirect string, offset: 0xebf6d): ../Core/Src/main.c
    <7fe>   DW_AT_comp_dir    : (indirect string, offset: 0x5752b): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <802>   DW_AT_ranges      : 0x68
    <806>   DW_AT_low_pc      : 0
    <80a>   DW_AT_stmt_list   : 0x1519
    <80e>   DW_AT_macros      : 0x2507f
 <1><812>: Abbrev Number: 5 (DW_TAG_base_type)
    <813>   DW_AT_byte_size   : 1
    <814>   DW_AT_encoding    : 6	(signed char)
    <815>   DW_AT_name        : (indirect string, offset: 0x4fcee): signed char
 <1><819>: Abbrev Number: 3 (DW_TAG_typedef)
    <81a>   DW_AT_name        : (indirect string, offset: 0x2e557): __uint8_t
    <81e>   DW_AT_decl_file   : 3
    <81f>   DW_AT_decl_line   : 43
    <820>   DW_AT_decl_column : 24
    <821>   DW_AT_type        : <0x825>
 <1><825>: Abbrev Number: 5 (DW_TAG_base_type)
    <826>   DW_AT_byte_size   : 1
    <827>   DW_AT_encoding    : 8	(unsigned char)
    <828>   DW_AT_name        : (indirect string, offset: 0x98270): unsigned char
 <1><82c>: Abbrev Number: 3 (DW_TAG_typedef)
    <82d>   DW_AT_name        : (indirect string, offset: 0x9e2fb): __int16_t
    <831>   DW_AT_decl_file   : 3
    <832>   DW_AT_decl_line   : 55
    <833>   DW_AT_decl_column : 24
    <834>   DW_AT_type        : <0x838>
 <1><838>: Abbrev Number: 5 (DW_TAG_base_type)
    <839>   DW_AT_byte_size   : 2
    <83a>   DW_AT_encoding    : 5	(signed)
    <83b>   DW_AT_name        : (indirect string, offset: 0x75845): short int
 <1><83f>: Abbrev Number: 5 (DW_TAG_base_type)
    <840>   DW_AT_byte_size   : 2
    <841>   DW_AT_encoding    : 7	(unsigned)
    <842>   DW_AT_name        : (indirect string, offset: 0x970ad): short unsigned int
 <1><846>: Abbrev Number: 5 (DW_TAG_base_type)
    <847>   DW_AT_byte_size   : 4
    <848>   DW_AT_encoding    : 5	(signed)
    <849>   DW_AT_name        : (indirect string, offset: 0xcd62): long int
 <1><84d>: Abbrev Number: 3 (DW_TAG_typedef)
    <84e>   DW_AT_name        : (indirect string, offset: 0x652e1): __uint32_t
    <852>   DW_AT_decl_file   : 3
    <853>   DW_AT_decl_line   : 79
    <854>   DW_AT_decl_column : 25
    <855>   DW_AT_type        : <0x859>
 <1><859>: Abbrev Number: 5 (DW_TAG_base_type)
    <85a>   DW_AT_byte_size   : 4
    <85b>   DW_AT_encoding    : 7	(unsigned)
    <85c>   DW_AT_name        : (indirect string, offset: 0x3ccba): long unsigned int
 <1><860>: Abbrev Number: 5 (DW_TAG_base_type)
    <861>   DW_AT_byte_size   : 8
    <862>   DW_AT_encoding    : 5	(signed)
    <863>   DW_AT_name        : (indirect string, offset: 0x4895f): long long int
 <1><867>: Abbrev Number: 3 (DW_TAG_typedef)
    <868>   DW_AT_name        : (indirect string, offset: 0xea7d8): __uint64_t
    <86c>   DW_AT_decl_file   : 3
    <86d>   DW_AT_decl_line   : 105
    <86e>   DW_AT_decl_column : 25
    <86f>   DW_AT_type        : <0x873>
 <1><873>: Abbrev Number: 5 (DW_TAG_base_type)
    <874>   DW_AT_byte_size   : 8
    <875>   DW_AT_encoding    : 7	(unsigned)
    <876>   DW_AT_name        : (indirect string, offset: 0x20f4b): long long unsigned int
 <1><87a>: Abbrev Number: 22 (DW_TAG_base_type)
    <87b>   DW_AT_byte_size   : 4
    <87c>   DW_AT_encoding    : 5	(signed)
    <87d>   DW_AT_name        : int
 <1><881>: Abbrev Number: 5 (DW_TAG_base_type)
    <882>   DW_AT_byte_size   : 4
    <883>   DW_AT_encoding    : 7	(unsigned)
    <884>   DW_AT_name        : (indirect string, offset: 0xc599): unsigned int
 <1><888>: Abbrev Number: 5 (DW_TAG_base_type)
    <889>   DW_AT_byte_size   : 8
    <88a>   DW_AT_encoding    : 4	(float)
    <88b>   DW_AT_name        : (indirect string, offset: 0xe90f9): long double
 <1><88f>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <890>   DW_AT_byte_size   : 4
 <1><891>: Abbrev Number: 6 (DW_TAG_const_type)
    <892>   DW_AT_type        : <0x88f>
 <1><896>: Abbrev Number: 5 (DW_TAG_base_type)
    <897>   DW_AT_byte_size   : 1
    <898>   DW_AT_encoding    : 8	(unsigned char)
    <899>   DW_AT_name        : (indirect string, offset: 0xb5d41): char
 <1><89d>: Abbrev Number: 6 (DW_TAG_const_type)
    <89e>   DW_AT_type        : <0x896>
 <1><8a2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <8a3>   DW_AT_byte_size   : 4
    <8a3>   DW_AT_type        : <0x89d>
 <1><8a7>: Abbrev Number: 6 (DW_TAG_const_type)
    <8a8>   DW_AT_type        : <0x8a2>
 <1><8ac>: Abbrev Number: 3 (DW_TAG_typedef)
    <8ad>   DW_AT_name        : (indirect string, offset: 0x2e559): uint8_t
    <8b1>   DW_AT_decl_file   : 4
    <8b2>   DW_AT_decl_line   : 24
    <8b3>   DW_AT_decl_column : 19
    <8b4>   DW_AT_type        : <0x819>
 <1><8b8>: Abbrev Number: 6 (DW_TAG_const_type)
    <8b9>   DW_AT_type        : <0x8ac>
 <1><8bd>: Abbrev Number: 3 (DW_TAG_typedef)
    <8be>   DW_AT_name        : (indirect string, offset: 0x9e2fd): int16_t
    <8c2>   DW_AT_decl_file   : 4
    <8c3>   DW_AT_decl_line   : 32
    <8c4>   DW_AT_decl_column : 19
    <8c5>   DW_AT_type        : <0x82c>
 <1><8c9>: Abbrev Number: 3 (DW_TAG_typedef)
    <8ca>   DW_AT_name        : (indirect string, offset: 0xd3ca8): uint32_t
    <8ce>   DW_AT_decl_file   : 4
    <8cf>   DW_AT_decl_line   : 48
    <8d0>   DW_AT_decl_column : 20
    <8d1>   DW_AT_type        : <0x84d>
 <1><8d5>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <8d6>   DW_AT_type        : <0x8c9>
 <1><8da>: Abbrev Number: 3 (DW_TAG_typedef)
    <8db>   DW_AT_name        : (indirect string, offset: 0xea7da): uint64_t
    <8df>   DW_AT_decl_file   : 4
    <8e0>   DW_AT_decl_line   : 60
    <8e1>   DW_AT_decl_column : 20
    <8e2>   DW_AT_type        : <0x867>
 <1><8e6>: Abbrev Number: 16 (DW_TAG_structure_type)
    <8e7>   DW_AT_byte_size   : 48
    <8e8>   DW_AT_decl_file   : 5
    <8e8>   DW_AT_decl_line   : 531
    <8ea>   DW_AT_decl_column : 9
    <8ea>   DW_AT_sibling     : <0x973>
 <2><8ee>: Abbrev Number: 1 (DW_TAG_member)
    <8ef>   DW_AT_name        : (indirect string, offset: 0x10f4): MODER
    <8f3>   DW_AT_decl_file   : 5
    <8f3>   DW_AT_decl_line   : 533
    <8f5>   DW_AT_decl_column : 17
    <8f5>   DW_AT_type        : <0x8d5>
    <8f9>   DW_AT_data_member_location: 0
 <2><8fa>: Abbrev Number: 1 (DW_TAG_member)
    <8fb>   DW_AT_name        : (indirect string, offset: 0x7a553): OTYPER
    <8ff>   DW_AT_decl_file   : 5
    <8ff>   DW_AT_decl_line   : 534
    <901>   DW_AT_decl_column : 17
    <901>   DW_AT_type        : <0x8d5>
    <905>   DW_AT_data_member_location: 4
 <2><906>: Abbrev Number: 1 (DW_TAG_member)
    <907>   DW_AT_name        : (indirect string, offset: 0x8943c): OSPEEDR
    <90b>   DW_AT_decl_file   : 5
    <90b>   DW_AT_decl_line   : 535
    <90d>   DW_AT_decl_column : 17
    <90d>   DW_AT_type        : <0x8d5>
    <911>   DW_AT_data_member_location: 8
 <2><912>: Abbrev Number: 1 (DW_TAG_member)
    <913>   DW_AT_name        : (indirect string, offset: 0x66acb): PUPDR
    <917>   DW_AT_decl_file   : 5
    <917>   DW_AT_decl_line   : 536
    <919>   DW_AT_decl_column : 17
    <919>   DW_AT_type        : <0x8d5>
    <91d>   DW_AT_data_member_location: 12
 <2><91e>: Abbrev Number: 10 (DW_TAG_member)
    <91f>   DW_AT_name        : IDR
    <923>   DW_AT_decl_file   : 5
    <923>   DW_AT_decl_line   : 537
    <925>   DW_AT_decl_column : 17
    <925>   DW_AT_type        : <0x8d5>
    <929>   DW_AT_data_member_location: 16
 <2><92a>: Abbrev Number: 10 (DW_TAG_member)
    <92b>   DW_AT_name        : ODR
    <92f>   DW_AT_decl_file   : 5
    <92f>   DW_AT_decl_line   : 538
    <931>   DW_AT_decl_column : 17
    <931>   DW_AT_type        : <0x8d5>
    <935>   DW_AT_data_member_location: 20
 <2><936>: Abbrev Number: 1 (DW_TAG_member)
    <937>   DW_AT_name        : (indirect string, offset: 0x239ce): BSRR
    <93b>   DW_AT_decl_file   : 5
    <93b>   DW_AT_decl_line   : 539
    <93d>   DW_AT_decl_column : 17
    <93d>   DW_AT_type        : <0x8d5>
    <941>   DW_AT_data_member_location: 24
 <2><942>: Abbrev Number: 1 (DW_TAG_member)
    <943>   DW_AT_name        : (indirect string, offset: 0x877cc): LCKR
    <947>   DW_AT_decl_file   : 5
    <947>   DW_AT_decl_line   : 540
    <949>   DW_AT_decl_column : 17
    <949>   DW_AT_type        : <0x8d5>
    <94d>   DW_AT_data_member_location: 28
 <2><94e>: Abbrev Number: 10 (DW_TAG_member)
    <94f>   DW_AT_name        : AFR
    <953>   DW_AT_decl_file   : 5
    <953>   DW_AT_decl_line   : 541
    <955>   DW_AT_decl_column : 17
    <955>   DW_AT_type        : <0x983>
    <959>   DW_AT_data_member_location: 32
 <2><95a>: Abbrev Number: 10 (DW_TAG_member)
    <95b>   DW_AT_name        : BRR
    <95f>   DW_AT_decl_file   : 5
    <95f>   DW_AT_decl_line   : 542
    <961>   DW_AT_decl_column : 17
    <961>   DW_AT_type        : <0x8d5>
    <965>   DW_AT_data_member_location: 40
 <2><966>: Abbrev Number: 1 (DW_TAG_member)
    <967>   DW_AT_name        : (indirect string, offset: 0x1b92): ASCR
    <96b>   DW_AT_decl_file   : 5
    <96b>   DW_AT_decl_line   : 543
    <96d>   DW_AT_decl_column : 17
    <96d>   DW_AT_type        : <0x8d5>
    <971>   DW_AT_data_member_location: 44
 <2><972>: Abbrev Number: 0
 <1><973>: Abbrev Number: 17 (DW_TAG_array_type)
    <974>   DW_AT_type        : <0x8d5>
    <978>   DW_AT_sibling     : <0x983>
 <2><97c>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <97d>   DW_AT_type        : <0x881>
    <981>   DW_AT_upper_bound : 1
 <2><982>: Abbrev Number: 0
 <1><983>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <984>   DW_AT_type        : <0x973>
 <1><988>: Abbrev Number: 19 (DW_TAG_typedef)
    <989>   DW_AT_name        : (indirect string, offset: 0x991be): GPIO_TypeDef
    <98d>   DW_AT_decl_file   : 5
    <98d>   DW_AT_decl_line   : 545
    <98f>   DW_AT_decl_column : 3
    <98f>   DW_AT_type        : <0x8e6>
 <1><993>: Abbrev Number: 16 (DW_TAG_structure_type)
    <994>   DW_AT_byte_size   : 152
    <995>   DW_AT_decl_file   : 5
    <995>   DW_AT_decl_line   : 685
    <997>   DW_AT_decl_column : 9
    <997>   DW_AT_sibling     : <0xb63>
 <2><99b>: Abbrev Number: 10 (DW_TAG_member)
    <99c>   DW_AT_name        : CR
    <99f>   DW_AT_decl_file   : 5
    <99f>   DW_AT_decl_line   : 687
    <9a1>   DW_AT_decl_column : 17
    <9a1>   DW_AT_type        : <0x8d5>
    <9a5>   DW_AT_data_member_location: 0
 <2><9a6>: Abbrev Number: 1 (DW_TAG_member)
    <9a7>   DW_AT_name        : (indirect string, offset: 0x6af09): ICSCR
    <9ab>   DW_AT_decl_file   : 5
    <9ab>   DW_AT_decl_line   : 688
    <9ad>   DW_AT_decl_column : 17
    <9ad>   DW_AT_type        : <0x8d5>
    <9b1>   DW_AT_data_member_location: 4
 <2><9b2>: Abbrev Number: 1 (DW_TAG_member)
    <9b3>   DW_AT_name        : (indirect string, offset: 0x3467c): CFGR
    <9b7>   DW_AT_decl_file   : 5
    <9b7>   DW_AT_decl_line   : 689
    <9b9>   DW_AT_decl_column : 17
    <9b9>   DW_AT_type        : <0x8d5>
    <9bd>   DW_AT_data_member_location: 8
 <2><9be>: Abbrev Number: 1 (DW_TAG_member)
    <9bf>   DW_AT_name        : (indirect string, offset: 0x6f09b): PLLCFGR
    <9c3>   DW_AT_decl_file   : 5
    <9c3>   DW_AT_decl_line   : 690
    <9c5>   DW_AT_decl_column : 17
    <9c5>   DW_AT_type        : <0x8d5>
    <9c9>   DW_AT_data_member_location: 12
 <2><9ca>: Abbrev Number: 1 (DW_TAG_member)
    <9cb>   DW_AT_name        : (indirect string, offset: 0x34675): PLLSAI1CFGR
    <9cf>   DW_AT_decl_file   : 5
    <9cf>   DW_AT_decl_line   : 691
    <9d1>   DW_AT_decl_column : 17
    <9d1>   DW_AT_type        : <0x8d5>
    <9d5>   DW_AT_data_member_location: 16
 <2><9d6>: Abbrev Number: 1 (DW_TAG_member)
    <9d7>   DW_AT_name        : (indirect string, offset: 0x67514): PLLSAI2CFGR
    <9db>   DW_AT_decl_file   : 5
    <9db>   DW_AT_decl_line   : 692
    <9dd>   DW_AT_decl_column : 17
    <9dd>   DW_AT_type        : <0x8d5>
    <9e1>   DW_AT_data_member_location: 20
 <2><9e2>: Abbrev Number: 1 (DW_TAG_member)
    <9e3>   DW_AT_name        : (indirect string, offset: 0x1e2c): CIER
    <9e7>   DW_AT_decl_file   : 5
    <9e7>   DW_AT_decl_line   : 693
    <9e9>   DW_AT_decl_column : 17
    <9e9>   DW_AT_type        : <0x8d5>
    <9ed>   DW_AT_data_member_location: 24
 <2><9ee>: Abbrev Number: 1 (DW_TAG_member)
    <9ef>   DW_AT_name        : (indirect string, offset: 0x21bc): CIFR
    <9f3>   DW_AT_decl_file   : 5
    <9f3>   DW_AT_decl_line   : 694
    <9f5>   DW_AT_decl_column : 17
    <9f5>   DW_AT_type        : <0x8d5>
    <9f9>   DW_AT_data_member_location: 28
 <2><9fa>: Abbrev Number: 1 (DW_TAG_member)
    <9fb>   DW_AT_name        : (indirect string, offset: 0x14c7): CICR
    <9ff>   DW_AT_decl_file   : 5
    <9ff>   DW_AT_decl_line   : 695
    <a01>   DW_AT_decl_column : 17
    <a01>   DW_AT_type        : <0x8d5>
    <a05>   DW_AT_data_member_location: 32
 <2><a06>: Abbrev Number: 1 (DW_TAG_member)
    <a07>   DW_AT_name        : (indirect string, offset: 0x9493c): RESERVED0
    <a0b>   DW_AT_decl_file   : 5
    <a0b>   DW_AT_decl_line   : 696
    <a0d>   DW_AT_decl_column : 17
    <a0d>   DW_AT_type        : <0x8c9>
    <a11>   DW_AT_data_member_location: 36
 <2><a12>: Abbrev Number: 1 (DW_TAG_member)
    <a13>   DW_AT_name        : (indirect string, offset: 0x7df26): AHB1RSTR
    <a17>   DW_AT_decl_file   : 5
    <a17>   DW_AT_decl_line   : 697
    <a19>   DW_AT_decl_column : 17
    <a19>   DW_AT_type        : <0x8d5>
    <a1d>   DW_AT_data_member_location: 40
 <2><a1e>: Abbrev Number: 1 (DW_TAG_member)
    <a1f>   DW_AT_name        : (indirect string, offset: 0x1d1e6): AHB2RSTR
    <a23>   DW_AT_decl_file   : 5
    <a23>   DW_AT_decl_line   : 698
    <a25>   DW_AT_decl_column : 17
    <a25>   DW_AT_type        : <0x8d5>
    <a29>   DW_AT_data_member_location: 44
 <2><a2a>: Abbrev Number: 1 (DW_TAG_member)
    <a2b>   DW_AT_name        : (indirect string, offset: 0x342fc): AHB3RSTR
    <a2f>   DW_AT_decl_file   : 5
    <a2f>   DW_AT_decl_line   : 699
    <a31>   DW_AT_decl_column : 17
    <a31>   DW_AT_type        : <0x8d5>
    <a35>   DW_AT_data_member_location: 48
 <2><a36>: Abbrev Number: 1 (DW_TAG_member)
    <a37>   DW_AT_name        : (indirect string, offset: 0x94946): RESERVED1
    <a3b>   DW_AT_decl_file   : 5
    <a3b>   DW_AT_decl_line   : 700
    <a3d>   DW_AT_decl_column : 17
    <a3d>   DW_AT_type        : <0x8c9>
    <a41>   DW_AT_data_member_location: 52
 <2><a42>: Abbrev Number: 1 (DW_TAG_member)
    <a43>   DW_AT_name        : (indirect string, offset: 0x20267): APB1RSTR1
    <a47>   DW_AT_decl_file   : 5
    <a47>   DW_AT_decl_line   : 701
    <a49>   DW_AT_decl_column : 17
    <a49>   DW_AT_type        : <0x8d5>
    <a4d>   DW_AT_data_member_location: 56
 <2><a4e>: Abbrev Number: 1 (DW_TAG_member)
    <a4f>   DW_AT_name        : (indirect string, offset: 0x20271): APB1RSTR2
    <a53>   DW_AT_decl_file   : 5
    <a53>   DW_AT_decl_line   : 702
    <a55>   DW_AT_decl_column : 17
    <a55>   DW_AT_type        : <0x8d5>
    <a59>   DW_AT_data_member_location: 60
 <2><a5a>: Abbrev Number: 1 (DW_TAG_member)
    <a5b>   DW_AT_name        : (indirect string, offset: 0x452dd): APB2RSTR
    <a5f>   DW_AT_decl_file   : 5
    <a5f>   DW_AT_decl_line   : 703
    <a61>   DW_AT_decl_column : 17
    <a61>   DW_AT_type        : <0x8d5>
    <a65>   DW_AT_data_member_location: 64
 <2><a66>: Abbrev Number: 1 (DW_TAG_member)
    <a67>   DW_AT_name        : (indirect string, offset: 0x94950): RESERVED2
    <a6b>   DW_AT_decl_file   : 5
    <a6b>   DW_AT_decl_line   : 704
    <a6d>   DW_AT_decl_column : 17
    <a6d>   DW_AT_type        : <0x8c9>
    <a71>   DW_AT_data_member_location: 68
 <2><a72>: Abbrev Number: 1 (DW_TAG_member)
    <a73>   DW_AT_name        : (indirect string, offset: 0xc55f): AHB1ENR
    <a77>   DW_AT_decl_file   : 5
    <a77>   DW_AT_decl_line   : 705
    <a79>   DW_AT_decl_column : 17
    <a79>   DW_AT_type        : <0x8d5>
    <a7d>   DW_AT_data_member_location: 72
 <2><a7e>: Abbrev Number: 1 (DW_TAG_member)
    <a7f>   DW_AT_name        : (indirect string, offset: 0x2a2c6): AHB2ENR
    <a83>   DW_AT_decl_file   : 5
    <a83>   DW_AT_decl_line   : 706
    <a85>   DW_AT_decl_column : 17
    <a85>   DW_AT_type        : <0x8d5>
    <a89>   DW_AT_data_member_location: 76
 <2><a8a>: Abbrev Number: 1 (DW_TAG_member)
    <a8b>   DW_AT_name        : (indirect string, offset: 0x477c6): AHB3ENR
    <a8f>   DW_AT_decl_file   : 5
    <a8f>   DW_AT_decl_line   : 707
    <a91>   DW_AT_decl_column : 17
    <a91>   DW_AT_type        : <0x8d5>
    <a95>   DW_AT_data_member_location: 80
 <2><a96>: Abbrev Number: 1 (DW_TAG_member)
    <a97>   DW_AT_name        : (indirect string, offset: 0x9495a): RESERVED3
    <a9b>   DW_AT_decl_file   : 5
    <a9b>   DW_AT_decl_line   : 708
    <a9d>   DW_AT_decl_column : 17
    <a9d>   DW_AT_type        : <0x8c9>
    <aa1>   DW_AT_data_member_location: 84
 <2><aa2>: Abbrev Number: 1 (DW_TAG_member)
    <aa3>   DW_AT_name        : (indirect string, offset: 0x5150): APB1ENR1
    <aa7>   DW_AT_decl_file   : 5
    <aa7>   DW_AT_decl_line   : 709
    <aa9>   DW_AT_decl_column : 17
    <aa9>   DW_AT_type        : <0x8d5>
    <aad>   DW_AT_data_member_location: 88
 <2><aae>: Abbrev Number: 1 (DW_TAG_member)
    <aaf>   DW_AT_name        : (indirect string, offset: 0x5159): APB1ENR2
    <ab3>   DW_AT_decl_file   : 5
    <ab3>   DW_AT_decl_line   : 710
    <ab5>   DW_AT_decl_column : 17
    <ab5>   DW_AT_type        : <0x8d5>
    <ab9>   DW_AT_data_member_location: 92
 <2><aba>: Abbrev Number: 1 (DW_TAG_member)
    <abb>   DW_AT_name        : (indirect string, offset: 0x12841): APB2ENR
    <abf>   DW_AT_decl_file   : 5
    <abf>   DW_AT_decl_line   : 711
    <ac1>   DW_AT_decl_column : 17
    <ac1>   DW_AT_type        : <0x8d5>
    <ac5>   DW_AT_data_member_location: 96
 <2><ac6>: Abbrev Number: 1 (DW_TAG_member)
    <ac7>   DW_AT_name        : (indirect string, offset: 0x5871a): RESERVED4
    <acb>   DW_AT_decl_file   : 5
    <acb>   DW_AT_decl_line   : 712
    <acd>   DW_AT_decl_column : 17
    <acd>   DW_AT_type        : <0x8c9>
    <ad1>   DW_AT_data_member_location: 100
 <2><ad2>: Abbrev Number: 1 (DW_TAG_member)
    <ad3>   DW_AT_name        : (indirect string, offset: 0x49225): AHB1SMENR
    <ad7>   DW_AT_decl_file   : 5
    <ad7>   DW_AT_decl_line   : 713
    <ad9>   DW_AT_decl_column : 17
    <ad9>   DW_AT_type        : <0x8d5>
    <add>   DW_AT_data_member_location: 104
 <2><ade>: Abbrev Number: 1 (DW_TAG_member)
    <adf>   DW_AT_name        : (indirect string, offset: 0x908e2): AHB2SMENR
    <ae3>   DW_AT_decl_file   : 5
    <ae3>   DW_AT_decl_line   : 714
    <ae5>   DW_AT_decl_column : 17
    <ae5>   DW_AT_type        : <0x8d5>
    <ae9>   DW_AT_data_member_location: 108
 <2><aea>: Abbrev Number: 1 (DW_TAG_member)
    <aeb>   DW_AT_name        : (indirect string, offset: 0x3a54b): AHB3SMENR
    <aef>   DW_AT_decl_file   : 5
    <aef>   DW_AT_decl_line   : 715
    <af1>   DW_AT_decl_column : 17
    <af1>   DW_AT_type        : <0x8d5>
    <af5>   DW_AT_data_member_location: 112
 <2><af6>: Abbrev Number: 1 (DW_TAG_member)
    <af7>   DW_AT_name        : (indirect string, offset: 0x94988): RESERVED5
    <afb>   DW_AT_decl_file   : 5
    <afb>   DW_AT_decl_line   : 716
    <afd>   DW_AT_decl_column : 17
    <afd>   DW_AT_type        : <0x8c9>
    <b01>   DW_AT_data_member_location: 116
 <2><b02>: Abbrev Number: 1 (DW_TAG_member)
    <b03>   DW_AT_name        : (indirect string, offset: 0x59e2): APB1SMENR1
    <b07>   DW_AT_decl_file   : 5
    <b07>   DW_AT_decl_line   : 717
    <b09>   DW_AT_decl_column : 17
    <b09>   DW_AT_type        : <0x8d5>
    <b0d>   DW_AT_data_member_location: 120
 <2><b0e>: Abbrev Number: 1 (DW_TAG_member)
    <b0f>   DW_AT_name        : (indirect string, offset: 0x59ed): APB1SMENR2
    <b13>   DW_AT_decl_file   : 5
    <b13>   DW_AT_decl_line   : 718
    <b15>   DW_AT_decl_column : 17
    <b15>   DW_AT_type        : <0x8d5>
    <b19>   DW_AT_data_member_location: 124
 <2><b1a>: Abbrev Number: 1 (DW_TAG_member)
    <b1b>   DW_AT_name        : (indirect string, offset: 0x7f712): APB2SMENR
    <b1f>   DW_AT_decl_file   : 5
    <b1f>   DW_AT_decl_line   : 719
    <b21>   DW_AT_decl_column : 17
    <b21>   DW_AT_type        : <0x8d5>
    <b25>   DW_AT_data_member_location: 128
 <2><b26>: Abbrev Number: 1 (DW_TAG_member)
    <b27>   DW_AT_name        : (indirect string, offset: 0x94992): RESERVED6
    <b2b>   DW_AT_decl_file   : 5
    <b2b>   DW_AT_decl_line   : 720
    <b2d>   DW_AT_decl_column : 17
    <b2d>   DW_AT_type        : <0x8c9>
    <b31>   DW_AT_data_member_location: 132
 <2><b32>: Abbrev Number: 1 (DW_TAG_member)
    <b33>   DW_AT_name        : (indirect string, offset: 0x30a18): CCIPR
    <b37>   DW_AT_decl_file   : 5
    <b37>   DW_AT_decl_line   : 721
    <b39>   DW_AT_decl_column : 17
    <b39>   DW_AT_type        : <0x8d5>
    <b3d>   DW_AT_data_member_location: 136
 <2><b3e>: Abbrev Number: 1 (DW_TAG_member)
    <b3f>   DW_AT_name        : (indirect string, offset: 0x9499c): RESERVED7
    <b43>   DW_AT_decl_file   : 5
    <b43>   DW_AT_decl_line   : 722
    <b45>   DW_AT_decl_column : 17
    <b45>   DW_AT_type        : <0x8c9>
    <b49>   DW_AT_data_member_location: 140
 <2><b4a>: Abbrev Number: 1 (DW_TAG_member)
    <b4b>   DW_AT_name        : (indirect string, offset: 0x29516): BDCR
    <b4f>   DW_AT_decl_file   : 5
    <b4f>   DW_AT_decl_line   : 723
    <b51>   DW_AT_decl_column : 17
    <b51>   DW_AT_type        : <0x8d5>
    <b55>   DW_AT_data_member_location: 144
 <2><b56>: Abbrev Number: 10 (DW_TAG_member)
    <b57>   DW_AT_name        : CSR
    <b5b>   DW_AT_decl_file   : 5
    <b5b>   DW_AT_decl_line   : 724
    <b5d>   DW_AT_decl_column : 17
    <b5d>   DW_AT_type        : <0x8d5>
    <b61>   DW_AT_data_member_location: 148
 <2><b62>: Abbrev Number: 0
 <1><b63>: Abbrev Number: 19 (DW_TAG_typedef)
    <b64>   DW_AT_name        : (indirect string, offset: 0x49a83): RCC_TypeDef
    <b68>   DW_AT_decl_file   : 5
    <b68>   DW_AT_decl_line   : 725
    <b6a>   DW_AT_decl_column : 3
    <b6a>   DW_AT_type        : <0x993>
 <1><b6e>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6f>   DW_AT_name        : (indirect string, offset: 0xc130f): TaskFunction_t
    <b73>   DW_AT_decl_file   : 6
    <b74>   DW_AT_decl_line   : 36
    <b75>   DW_AT_decl_column : 17
    <b76>   DW_AT_type        : <0xb7a>
 <1><b7a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b7b>   DW_AT_byte_size   : 4
    <b7b>   DW_AT_type        : <0xb7f>
 <1><b7f>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <b80>   DW_AT_prototyped  : 1
    <b80>   DW_AT_sibling     : <0xb8a>
 <2><b84>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <b85>   DW_AT_type        : <0x88f>
 <2><b89>: Abbrev Number: 0
 <1><b8a>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8b>   DW_AT_name        : (indirect string, offset: 0xe271d): StackType_t
    <b8f>   DW_AT_decl_file   : 7
    <b90>   DW_AT_decl_line   : 58
    <b91>   DW_AT_decl_column : 26
    <b92>   DW_AT_type        : <0x8c9>
 <1><b96>: Abbrev Number: 6 (DW_TAG_const_type)
    <b97>   DW_AT_type        : <0xb8a>
 <1><b9b>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9c>   DW_AT_name        : (indirect string, offset: 0xe8ce9): BaseType_t
    <ba0>   DW_AT_decl_file   : 7
    <ba1>   DW_AT_decl_line   : 59
    <ba2>   DW_AT_decl_column : 26
    <ba3>   DW_AT_type        : <0x846>
 <1><ba7>: Abbrev Number: 3 (DW_TAG_typedef)
    <ba8>   DW_AT_name        : (indirect string, offset: 0xe8ce8): UBaseType_t
    <bac>   DW_AT_decl_file   : 7
    <bad>   DW_AT_decl_line   : 60
    <bae>   DW_AT_decl_column : 26
    <baf>   DW_AT_type        : <0x859>
 <1><bb3>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb4>   DW_AT_name        : (indirect string, offset: 0xc710a): TickType_t
    <bb8>   DW_AT_decl_file   : 7
    <bb9>   DW_AT_decl_line   : 66
    <bba>   DW_AT_decl_column : 26
    <bbb>   DW_AT_type        : <0x8c9>
 <1><bbf>: Abbrev Number: 6 (DW_TAG_const_type)
    <bc0>   DW_AT_type        : <0xbb3>
 <1><bc4>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc5>   DW_AT_name        : (indirect string, offset: 0xdec83): TaskHandle_t
    <bc9>   DW_AT_decl_file   : 8
    <bca>   DW_AT_decl_line   : 95
    <bcb>   DW_AT_decl_column : 46
    <bcc>   DW_AT_type        : <0xbd0>
 <1><bd0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <bd1>   DW_AT_byte_size   : 4
    <bd1>   DW_AT_type        : <0xbd5>
 <1><bd5>: Abbrev Number: 25 (DW_TAG_structure_type)
    <bd6>   DW_AT_name        : (indirect string, offset: 0xdd0b5): tskTaskControlBlock
    <bda>   DW_AT_declaration : 1
 <1><bda>: Abbrev Number: 11 (DW_TAG_structure_type)
    <bdb>   DW_AT_byte_size   : 12
    <bdc>   DW_AT_decl_file   : 9
    <bdd>   DW_AT_decl_line   : 34
    <bde>   DW_AT_decl_column : 9
    <bde>   DW_AT_sibling     : <0xc2b>
 <2><be2>: Abbrev Number: 8 (DW_TAG_member)
    <be3>   DW_AT_name        : gx
    <be6>   DW_AT_decl_file   : 9
    <be7>   DW_AT_decl_line   : 35
    <be8>   DW_AT_decl_column : 10
    <be9>   DW_AT_type        : <0x8bd>
    <bed>   DW_AT_data_member_location: 0
 <2><bee>: Abbrev Number: 8 (DW_TAG_member)
    <bef>   DW_AT_name        : gy
    <bf2>   DW_AT_decl_file   : 9
    <bf3>   DW_AT_decl_line   : 35
    <bf4>   DW_AT_decl_column : 14
    <bf5>   DW_AT_type        : <0x8bd>
    <bf9>   DW_AT_data_member_location: 2
 <2><bfa>: Abbrev Number: 8 (DW_TAG_member)
    <bfb>   DW_AT_name        : gz
    <bfe>   DW_AT_decl_file   : 9
    <bff>   DW_AT_decl_line   : 35
    <c00>   DW_AT_decl_column : 18
    <c01>   DW_AT_type        : <0x8bd>
    <c05>   DW_AT_data_member_location: 4
 <2><c06>: Abbrev Number: 8 (DW_TAG_member)
    <c07>   DW_AT_name        : ax
    <c0a>   DW_AT_decl_file   : 9
    <c0b>   DW_AT_decl_line   : 36
    <c0c>   DW_AT_decl_column : 10
    <c0d>   DW_AT_type        : <0x8bd>
    <c11>   DW_AT_data_member_location: 6
 <2><c12>: Abbrev Number: 8 (DW_TAG_member)
    <c13>   DW_AT_name        : ay
    <c16>   DW_AT_decl_file   : 9
    <c17>   DW_AT_decl_line   : 36
    <c18>   DW_AT_decl_column : 14
    <c19>   DW_AT_type        : <0x8bd>
    <c1d>   DW_AT_data_member_location: 8
 <2><c1e>: Abbrev Number: 8 (DW_TAG_member)
    <c1f>   DW_AT_name        : az
    <c22>   DW_AT_decl_file   : 9
    <c23>   DW_AT_decl_line   : 36
    <c24>   DW_AT_decl_column : 18
    <c25>   DW_AT_type        : <0x8bd>
    <c29>   DW_AT_data_member_location: 10
 <2><c2a>: Abbrev Number: 0
 <1><c2b>: Abbrev Number: 3 (DW_TAG_typedef)
    <c2c>   DW_AT_name        : (indirect string, offset: 0x9e3f8): LSM6DS3_Sample
    <c30>   DW_AT_decl_file   : 9
    <c31>   DW_AT_decl_line   : 37
    <c32>   DW_AT_decl_column : 2
    <c33>   DW_AT_type        : <0xbda>
 <1><c37>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <c38>   DW_AT_encoding    : 7	(unsigned)
    <c39>   DW_AT_byte_size   : 1
    <c3a>   DW_AT_type        : <0x825>
    <c3e>   DW_AT_decl_file   : 10
    <c3f>   DW_AT_decl_line   : 39
    <c40>   DW_AT_decl_column : 1
    <c41>   DW_AT_sibling     : <0xc5e>
 <2><c45>: Abbrev Number: 12 (DW_TAG_enumerator)
    <c46>   DW_AT_name        : (indirect string, offset: 0xe9dff): HAL_OK
    <c4a>   DW_AT_const_value : 0
 <2><c4b>: Abbrev Number: 12 (DW_TAG_enumerator)
    <c4c>   DW_AT_name        : (indirect string, offset: 0xeb020): HAL_ERROR
    <c50>   DW_AT_const_value : 1
 <2><c51>: Abbrev Number: 12 (DW_TAG_enumerator)
    <c52>   DW_AT_name        : (indirect string, offset: 0xe9602): HAL_BUSY
    <c56>   DW_AT_const_value : 2
 <2><c57>: Abbrev Number: 12 (DW_TAG_enumerator)
    <c58>   DW_AT_name        : (indirect string, offset: 0xe9c6a): HAL_TIMEOUT
    <c5c>   DW_AT_const_value : 3
 <2><c5d>: Abbrev Number: 0
 <1><c5e>: Abbrev Number: 3 (DW_TAG_typedef)
    <c5f>   DW_AT_name        : (indirect string, offset: 0xec237): HAL_StatusTypeDef
    <c63>   DW_AT_decl_file   : 10
    <c64>   DW_AT_decl_line   : 44
    <c65>   DW_AT_decl_column : 3
    <c66>   DW_AT_type        : <0xc37>
 <1><c6a>: Abbrev Number: 11 (DW_TAG_structure_type)
    <c6b>   DW_AT_byte_size   : 28
    <c6c>   DW_AT_decl_file   : 11
    <c6d>   DW_AT_decl_line   : 45
    <c6e>   DW_AT_decl_column : 9
    <c6e>   DW_AT_sibling     : <0xcc0>
 <2><c72>: Abbrev Number: 2 (DW_TAG_member)
    <c73>   DW_AT_name        : (indirect string, offset: 0xeb174): PLLState
    <c77>   DW_AT_decl_file   : 11
    <c77>   DW_AT_decl_line   : 47
    <c78>   DW_AT_decl_column : 12
    <c78>   DW_AT_type        : <0x8c9>
    <c7c>   DW_AT_data_member_location: 0
 <2><c7d>: Abbrev Number: 2 (DW_TAG_member)
    <c7e>   DW_AT_name        : (indirect string, offset: 0xeb522): PLLSource
    <c82>   DW_AT_decl_file   : 11
    <c82>   DW_AT_decl_line   : 50
    <c83>   DW_AT_decl_column : 12
    <c83>   DW_AT_type        : <0x8c9>
    <c87>   DW_AT_data_member_location: 4
 <2><c88>: Abbrev Number: 2 (DW_TAG_member)
    <c89>   DW_AT_name        : (indirect string, offset: 0xeb102): PLLM
    <c8d>   DW_AT_decl_file   : 11
    <c8d>   DW_AT_decl_line   : 53
    <c8e>   DW_AT_decl_column : 12
    <c8e>   DW_AT_type        : <0x8c9>
    <c92>   DW_AT_data_member_location: 8
 <2><c93>: Abbrev Number: 2 (DW_TAG_member)
    <c94>   DW_AT_name        : (indirect string, offset: 0xebc41): PLLN
    <c98>   DW_AT_decl_file   : 11
    <c98>   DW_AT_decl_line   : 57
    <c99>   DW_AT_decl_column : 12
    <c99>   DW_AT_type        : <0x8c9>
    <c9d>   DW_AT_data_member_location: 12
 <2><c9e>: Abbrev Number: 2 (DW_TAG_member)
    <c9f>   DW_AT_name        : (indirect string, offset: 0xebc46): PLLP
    <ca3>   DW_AT_decl_file   : 11
    <ca3>   DW_AT_decl_line   : 61
    <ca4>   DW_AT_decl_column : 12
    <ca4>   DW_AT_type        : <0x8c9>
    <ca8>   DW_AT_data_member_location: 16
 <2><ca9>: Abbrev Number: 2 (DW_TAG_member)
    <caa>   DW_AT_name        : (indirect string, offset: 0xd3cdb): PLLQ
    <cae>   DW_AT_decl_file   : 11
    <cae>   DW_AT_decl_line   : 65
    <caf>   DW_AT_decl_column : 12
    <caf>   DW_AT_type        : <0x8c9>
    <cb3>   DW_AT_data_member_location: 20
 <2><cb4>: Abbrev Number: 2 (DW_TAG_member)
    <cb5>   DW_AT_name        : (indirect string, offset: 0xebc4b): PLLR
    <cb9>   DW_AT_decl_file   : 11
    <cb9>   DW_AT_decl_line   : 68
    <cba>   DW_AT_decl_column : 12
    <cba>   DW_AT_type        : <0x8c9>
    <cbe>   DW_AT_data_member_location: 24
 <2><cbf>: Abbrev Number: 0
 <1><cc0>: Abbrev Number: 3 (DW_TAG_typedef)
    <cc1>   DW_AT_name        : (indirect string, offset: 0xeae16): RCC_PLLInitTypeDef
    <cc5>   DW_AT_decl_file   : 11
    <cc6>   DW_AT_decl_line   : 73
    <cc7>   DW_AT_decl_column : 2
    <cc8>   DW_AT_type        : <0xc6a>
 <1><ccc>: Abbrev Number: 11 (DW_TAG_structure_type)
    <ccd>   DW_AT_byte_size   : 68
    <cce>   DW_AT_decl_file   : 11
    <ccf>   DW_AT_decl_line   : 78
    <cd0>   DW_AT_decl_column : 9
    <cd0>   DW_AT_sibling     : <0xd50>
 <2><cd4>: Abbrev Number: 2 (DW_TAG_member)
    <cd5>   DW_AT_name        : (indirect string, offset: 0xebbd7): OscillatorType
    <cd9>   DW_AT_decl_file   : 11
    <cd9>   DW_AT_decl_line   : 80
    <cda>   DW_AT_decl_column : 12
    <cda>   DW_AT_type        : <0x8c9>
    <cde>   DW_AT_data_member_location: 0
 <2><cdf>: Abbrev Number: 2 (DW_TAG_member)
    <ce0>   DW_AT_name        : (indirect string, offset: 0xeb328): HSEState
    <ce4>   DW_AT_decl_file   : 11
    <ce4>   DW_AT_decl_line   : 83
    <ce5>   DW_AT_decl_column : 12
    <ce5>   DW_AT_type        : <0x8c9>
    <ce9>   DW_AT_data_member_location: 4
 <2><cea>: Abbrev Number: 2 (DW_TAG_member)
    <ceb>   DW_AT_name        : (indirect string, offset: 0xea46f): LSEState
    <cef>   DW_AT_decl_file   : 11
    <cef>   DW_AT_decl_line   : 86
    <cf0>   DW_AT_decl_column : 12
    <cf0>   DW_AT_type        : <0x8c9>
    <cf4>   DW_AT_data_member_location: 8
 <2><cf5>: Abbrev Number: 2 (DW_TAG_member)
    <cf6>   DW_AT_name        : (indirect string, offset: 0xea6e1): HSIState
    <cfa>   DW_AT_decl_file   : 11
    <cfa>   DW_AT_decl_line   : 89
    <cfb>   DW_AT_decl_column : 12
    <cfb>   DW_AT_type        : <0x8c9>
    <cff>   DW_AT_data_member_location: 12
 <2><d00>: Abbrev Number: 2 (DW_TAG_member)
    <d01>   DW_AT_name        : (indirect string, offset: 0xebdda): HSICalibrationValue
    <d05>   DW_AT_decl_file   : 11
    <d05>   DW_AT_decl_line   : 92
    <d06>   DW_AT_decl_column : 12
    <d06>   DW_AT_type        : <0x8c9>
    <d0a>   DW_AT_data_member_location: 16
 <2><d0b>: Abbrev Number: 2 (DW_TAG_member)
    <d0c>   DW_AT_name        : (indirect string, offset: 0xea1cd): LSIState
    <d10>   DW_AT_decl_file   : 11
    <d10>   DW_AT_decl_line   : 98
    <d11>   DW_AT_decl_column : 12
    <d11>   DW_AT_type        : <0x8c9>
    <d15>   DW_AT_data_member_location: 20
 <2><d16>: Abbrev Number: 2 (DW_TAG_member)
    <d17>   DW_AT_name        : (indirect string, offset: 0xe9cfa): MSIState
    <d1b>   DW_AT_decl_file   : 11
    <d1b>   DW_AT_decl_line   : 106
    <d1c>   DW_AT_decl_column : 12
    <d1c>   DW_AT_type        : <0x8c9>
    <d20>   DW_AT_data_member_location: 24
 <2><d21>: Abbrev Number: 2 (DW_TAG_member)
    <d22>   DW_AT_name        : (indirect string, offset: 0xe9d03): MSICalibrationValue
    <d26>   DW_AT_decl_file   : 11
    <d26>   DW_AT_decl_line   : 109
    <d27>   DW_AT_decl_column : 12
    <d27>   DW_AT_type        : <0x8c9>
    <d2b>   DW_AT_data_member_location: 28
 <2><d2c>: Abbrev Number: 2 (DW_TAG_member)
    <d2d>   DW_AT_name        : (indirect string, offset: 0xea93e): MSIClockRange
    <d31>   DW_AT_decl_file   : 11
    <d31>   DW_AT_decl_line   : 112
    <d32>   DW_AT_decl_column : 12
    <d32>   DW_AT_type        : <0x8c9>
    <d36>   DW_AT_data_member_location: 32
 <2><d37>: Abbrev Number: 2 (DW_TAG_member)
    <d38>   DW_AT_name        : (indirect string, offset: 0xeb764): HSI48State
    <d3c>   DW_AT_decl_file   : 11
    <d3c>   DW_AT_decl_line   : 115
    <d3d>   DW_AT_decl_column : 12
    <d3d>   DW_AT_type        : <0x8c9>
    <d41>   DW_AT_data_member_location: 36
 <2><d42>: Abbrev Number: 8 (DW_TAG_member)
    <d43>   DW_AT_name        : PLL
    <d47>   DW_AT_decl_file   : 11
    <d48>   DW_AT_decl_line   : 118
    <d49>   DW_AT_decl_column : 22
    <d4a>   DW_AT_type        : <0xcc0>
    <d4e>   DW_AT_data_member_location: 40
 <2><d4f>: Abbrev Number: 0
 <1><d50>: Abbrev Number: 3 (DW_TAG_typedef)
    <d51>   DW_AT_name        : (indirect string, offset: 0xeab07): RCC_OscInitTypeDef
    <d55>   DW_AT_decl_file   : 11
    <d56>   DW_AT_decl_line   : 120
    <d57>   DW_AT_decl_column : 2
    <d58>   DW_AT_type        : <0xccc>
 <1><d5c>: Abbrev Number: 11 (DW_TAG_structure_type)
    <d5d>   DW_AT_byte_size   : 20
    <d5e>   DW_AT_decl_file   : 11
    <d5f>   DW_AT_decl_line   : 125
    <d60>   DW_AT_decl_column : 9
    <d60>   DW_AT_sibling     : <0xd9c>
 <2><d64>: Abbrev Number: 2 (DW_TAG_member)
    <d65>   DW_AT_name        : (indirect string, offset: 0xe9d17): ClockType
    <d69>   DW_AT_decl_file   : 11
    <d69>   DW_AT_decl_line   : 127
    <d6a>   DW_AT_decl_column : 12
    <d6a>   DW_AT_type        : <0x8c9>
    <d6e>   DW_AT_data_member_location: 0
 <2><d6f>: Abbrev Number: 2 (DW_TAG_member)
    <d70>   DW_AT_name        : (indirect string, offset: 0xeadfe): SYSCLKSource
    <d74>   DW_AT_decl_file   : 11
    <d74>   DW_AT_decl_line   : 130
    <d75>   DW_AT_decl_column : 12
    <d75>   DW_AT_type        : <0x8c9>
    <d79>   DW_AT_data_member_location: 4
 <2><d7a>: Abbrev Number: 2 (DW_TAG_member)
    <d7b>   DW_AT_name        : (indirect string, offset: 0xebc20): AHBCLKDivider
    <d7f>   DW_AT_decl_file   : 11
    <d7f>   DW_AT_decl_line   : 133
    <d80>   DW_AT_decl_column : 12
    <d80>   DW_AT_type        : <0x8c9>
    <d84>   DW_AT_data_member_location: 8
 <2><d85>: Abbrev Number: 2 (DW_TAG_member)
    <d86>   DW_AT_name        : (indirect string, offset: 0xe8e85): APB1CLKDivider
    <d8a>   DW_AT_decl_file   : 11
    <d8a>   DW_AT_decl_line   : 136
    <d8b>   DW_AT_decl_column : 12
    <d8b>   DW_AT_type        : <0x8c9>
    <d8f>   DW_AT_data_member_location: 12
 <2><d90>: Abbrev Number: 2 (DW_TAG_member)
    <d91>   DW_AT_name        : (indirect string, offset: 0xea7bb): APB2CLKDivider
    <d95>   DW_AT_decl_file   : 11
    <d95>   DW_AT_decl_line   : 139
    <d96>   DW_AT_decl_column : 12
    <d96>   DW_AT_type        : <0x8c9>
    <d9a>   DW_AT_data_member_location: 16
 <2><d9b>: Abbrev Number: 0
 <1><d9c>: Abbrev Number: 3 (DW_TAG_typedef)
    <d9d>   DW_AT_name        : (indirect string, offset: 0xe9d21): RCC_ClkInitTypeDef
    <da1>   DW_AT_decl_file   : 11
    <da2>   DW_AT_decl_line   : 142
    <da3>   DW_AT_decl_column : 2
    <da4>   DW_AT_type        : <0xd5c>
 <1><da8>: Abbrev Number: 6 (DW_TAG_const_type)
    <da9>   DW_AT_type        : <0xd9c>
 <1><dad>: Abbrev Number: 17 (DW_TAG_array_type)
    <dae>   DW_AT_type        : <0x8b8>
    <db2>   DW_AT_sibling     : <0xdbd>
 <2><db6>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <db7>   DW_AT_type        : <0x881>
    <dbb>   DW_AT_upper_bound : 6
 <2><dbc>: Abbrev Number: 0
 <1><dbd>: Abbrev Number: 6 (DW_TAG_const_type)
    <dbe>   DW_AT_type        : <0xdad>
 <1><dc2>: Abbrev Number: 9 (DW_TAG_variable)
    <dc3>   DW_AT_name        : (indirect string, offset: 0xace0f): CHANNEL_OFFSET_TAB
    <dc7>   DW_AT_decl_file   : 16
    <dc8>   DW_AT_decl_line   : 49
    <dc9>   DW_AT_decl_column : 22
    <dca>   DW_AT_type        : <0xdbd>
    <dce>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><dd4>: Abbrev Number: 13 (DW_TAG_subprogram)
    <dd5>   DW_AT_external    : 1
    <dd5>   DW_AT_name        : (indirect string, offset: 0xebd8f): HAL_RCC_ClockConfig
    <dd9>   DW_AT_decl_file   : 11
    <dda>   DW_AT_decl_line   : 4837
    <ddc>   DW_AT_decl_column : 19
    <ddd>   DW_AT_prototyped  : 1
    <ddd>   DW_AT_type        : <0xc5e>
    <de1>   DW_AT_declaration : 1
    <de1>   DW_AT_sibling     : <0xdf0>
 <2><de5>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <de6>   DW_AT_type        : <0xdf0>
 <2><dea>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <deb>   DW_AT_type        : <0x8c9>
 <2><def>: Abbrev Number: 0
 <1><df0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <df1>   DW_AT_byte_size   : 4
    <df1>   DW_AT_type        : <0xda8>
 <1><df5>: Abbrev Number: 13 (DW_TAG_subprogram)
    <df6>   DW_AT_external    : 1
    <df6>   DW_AT_name        : (indirect string, offset: 0xeb510): HAL_RCC_OscConfig
    <dfa>   DW_AT_decl_file   : 11
    <dfb>   DW_AT_decl_line   : 4836
    <dfd>   DW_AT_decl_column : 19
    <dfe>   DW_AT_prototyped  : 1
    <dfe>   DW_AT_type        : <0xc5e>
    <e02>   DW_AT_declaration : 1
    <e02>   DW_AT_sibling     : <0xe0c>
 <2><e06>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e07>   DW_AT_type        : <0xe0c>
 <2><e0b>: Abbrev Number: 0
 <1><e0c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e0d>   DW_AT_byte_size   : 4
    <e0d>   DW_AT_type        : <0xd50>
 <1><e11>: Abbrev Number: 13 (DW_TAG_subprogram)
    <e12>   DW_AT_external    : 1
    <e12>   DW_AT_name        : (indirect string, offset: 0xea3fe): HAL_PWREx_ControlVoltageScaling
    <e16>   DW_AT_decl_file   : 12
    <e17>   DW_AT_decl_line   : 837
    <e19>   DW_AT_decl_column : 19
    <e1a>   DW_AT_prototyped  : 1
    <e1a>   DW_AT_type        : <0xc5e>
    <e1e>   DW_AT_declaration : 1
    <e1e>   DW_AT_sibling     : <0xe28>
 <2><e22>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e23>   DW_AT_type        : <0x8c9>
 <2><e27>: Abbrev Number: 0
 <1><e28>: Abbrev Number: 27 (DW_TAG_subprogram)
    <e29>   DW_AT_external    : 1
    <e29>   DW_AT_name        : (indirect string, offset: 0xe8e7e): printf
    <e2d>   DW_AT_decl_file   : 13
    <e2e>   DW_AT_decl_line   : 206
    <e2f>   DW_AT_decl_column : 5
    <e30>   DW_AT_prototyped  : 1
    <e30>   DW_AT_type        : <0x87a>
    <e34>   DW_AT_declaration : 1
    <e34>   DW_AT_sibling     : <0xe3f>
 <2><e38>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e39>   DW_AT_type        : <0x8a2>
 <2><e3d>: Abbrev Number: 28 (DW_TAG_unspecified_parameters)
 <2><e3e>: Abbrev Number: 0
 <1><e3f>: Abbrev Number: 29 (DW_TAG_subprogram)
    <e40>   DW_AT_external    : 1
    <e40>   DW_AT_name        : (indirect string, offset: 0x9e328): LSM6DS3_GyroAccelRead
    <e44>   DW_AT_decl_file   : 9
    <e45>   DW_AT_decl_line   : 40
    <e46>   DW_AT_decl_column : 6
    <e47>   DW_AT_prototyped  : 1
    <e47>   DW_AT_declaration : 1
    <e47>   DW_AT_sibling     : <0xe51>
 <2><e4b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e4c>   DW_AT_type        : <0xe51>
 <2><e50>: Abbrev Number: 0
 <1><e51>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e52>   DW_AT_byte_size   : 4
    <e52>   DW_AT_type        : <0xc2b>
 <1><e56>: Abbrev Number: 30 (DW_TAG_subprogram)
    <e57>   DW_AT_external    : 1
    <e57>   DW_AT_name        : (indirect string, offset: 0xead75): vTaskDelay
    <e5b>   DW_AT_decl_file   : 8
    <e5c>   DW_AT_decl_line   : 859
    <e5e>   DW_AT_decl_column : 6
    <e5f>   DW_AT_prototyped  : 1
    <e5f>   DW_AT_declaration : 1
    <e5f>   DW_AT_sibling     : <0xe69>
 <2><e63>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e64>   DW_AT_type        : <0xbbf>
 <2><e68>: Abbrev Number: 0
 <1><e69>: Abbrev Number: 13 (DW_TAG_subprogram)
    <e6a>   DW_AT_external    : 1
    <e6a>   DW_AT_name        : (indirect string, offset: 0xeadf2): xTaskCreate
    <e6e>   DW_AT_decl_file   : 8
    <e6f>   DW_AT_decl_line   : 385
    <e71>   DW_AT_decl_column : 16
    <e72>   DW_AT_prototyped  : 1
    <e72>   DW_AT_type        : <0xb9b>
    <e76>   DW_AT_declaration : 1
    <e76>   DW_AT_sibling     : <0xe99>
 <2><e7a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e7b>   DW_AT_type        : <0xb6e>
 <2><e7f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e80>   DW_AT_type        : <0x8a7>
 <2><e84>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e85>   DW_AT_type        : <0xb96>
 <2><e89>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e8a>   DW_AT_type        : <0x891>
 <2><e8e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e8f>   DW_AT_type        : <0xba7>
 <2><e93>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e94>   DW_AT_type        : <0xe9e>
 <2><e98>: Abbrev Number: 0
 <1><e99>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e9a>   DW_AT_byte_size   : 4
    <e9a>   DW_AT_type        : <0xbc4>
 <1><e9e>: Abbrev Number: 6 (DW_TAG_const_type)
    <e9f>   DW_AT_type        : <0xe99>
 <1><ea3>: Abbrev Number: 31 (DW_TAG_subprogram)
    <ea4>   DW_AT_external    : 1
    <ea4>   DW_AT_name        : (indirect string, offset: 0xead61): vTaskStartScheduler
    <ea8>   DW_AT_decl_file   : 8
    <ea9>   DW_AT_decl_line   : 1520
    <eab>   DW_AT_decl_column : 6
    <eac>   DW_AT_prototyped  : 1
    <eac>   DW_AT_declaration : 1
 <1><eac>: Abbrev Number: 32 (DW_TAG_subprogram)
    <ead>   DW_AT_external    : 1
    <ead>   DW_AT_name        : (indirect string, offset: 0x9e33e): LSM6DS3_Init
    <eb1>   DW_AT_decl_file   : 9
    <eb2>   DW_AT_decl_line   : 39
    <eb3>   DW_AT_decl_column : 9
    <eb4>   DW_AT_prototyped  : 1
    <eb4>   DW_AT_type        : <0x8ac>
    <eb8>   DW_AT_declaration : 1
 <1><eb8>: Abbrev Number: 33 (DW_TAG_subprogram)
    <eb9>   DW_AT_external    : 1
    <eb9>   DW_AT_name        : (indirect string, offset: 0x293b5): I2C1_Config
    <ebd>   DW_AT_decl_file   : 14
    <ebe>   DW_AT_decl_line   : 13
    <ebf>   DW_AT_decl_column : 6
    <ec0>   DW_AT_prototyped  : 1
    <ec0>   DW_AT_declaration : 1
 <1><ec0>: Abbrev Number: 34 (DW_TAG_subprogram)
    <ec1>   DW_AT_external    : 1
    <ec1>   DW_AT_name        : (indirect string, offset: 0xec162): HAL_Init
    <ec5>   DW_AT_decl_file   : 15
    <ec6>   DW_AT_decl_line   : 636
    <ec8>   DW_AT_decl_column : 19
    <ec9>   DW_AT_prototyped  : 1
    <ec9>   DW_AT_type        : <0xc5e>
    <ecd>   DW_AT_declaration : 1
 <1><ecd>: Abbrev Number: 20 (DW_TAG_subprogram)
    <ece>   DW_AT_external    : 1
    <ece>   DW_AT_name        : (indirect string, offset: 0xea6b6): Error_Handler
    <ed2>   DW_AT_decl_file   : 1
    <ed2>   DW_AT_decl_line   : 113
    <ed3>   DW_AT_decl_column : 6
    <ed3>   DW_AT_prototyped  : 1
    <ed3>   DW_AT_low_pc      : 0x8000c48
    <ed7>   DW_AT_high_pc     : 0xc
    <edb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <edd>   DW_AT_call_all_calls: 1
    <edd>   DW_AT_sibling     : <0xef2>
 <2><ee1>: Abbrev Number: 35 (DW_TAG_inlined_subroutine)
    <ee2>   DW_AT_abstract_origin: <0xfe6>
    <ee6>   DW_AT_low_pc      : 0x8000c4c
    <eea>   DW_AT_high_pc     : 0x4
    <eee>   DW_AT_call_file   : 1
    <eef>   DW_AT_call_line   : 115
    <ef0>   DW_AT_call_column : 3
 <2><ef1>: Abbrev Number: 0
 <1><ef2>: Abbrev Number: 14 (DW_TAG_subprogram)
    <ef3>   DW_AT_external    : 1
    <ef3>   DW_AT_name        : (indirect string, offset: 0xebee8): SystemClock_Config
    <ef7>   DW_AT_decl_file   : 1
    <ef7>   DW_AT_decl_line   : 72
    <ef8>   DW_AT_decl_column : 6
    <ef8>   DW_AT_prototyped  : 1
    <ef8>   DW_AT_low_pc      : 0x8000ba4
    <efc>   DW_AT_high_pc     : 0xa4
    <f00>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f02>   DW_AT_call_all_tail_calls: 1
    <f02>   DW_AT_sibling     : <0xf27>
 <2><f06>: Abbrev Number: 9 (DW_TAG_variable)
    <f07>   DW_AT_name        : (indirect string, offset: 0xe9803): RCC_OscInitStruct
    <f0b>   DW_AT_decl_file   : 1
    <f0c>   DW_AT_decl_line   : 74
    <f0d>   DW_AT_decl_column : 22
    <f0e>   DW_AT_type        : <0xd50>
    <f12>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><f16>: Abbrev Number: 9 (DW_TAG_variable)
    <f17>   DW_AT_name        : (indirect string, offset: 0xea36c): RCC_ClkInitStruct
    <f1b>   DW_AT_decl_file   : 1
    <f1c>   DW_AT_decl_line   : 75
    <f1d>   DW_AT_decl_column : 22
    <f1e>   DW_AT_type        : <0xd9c>
    <f22>   DW_AT_location    : 3 byte block: 91 a0 7f 	(DW_OP_fbreg: -96)
 <2><f26>: Abbrev Number: 0
 <1><f27>: Abbrev Number: 20 (DW_TAG_subprogram)
    <f28>   DW_AT_external    : 1
    <f28>   DW_AT_name        : (indirect string, offset: 0xec13d): GPIOPortConfig
    <f2c>   DW_AT_decl_file   : 1
    <f2c>   DW_AT_decl_line   : 62
    <f2d>   DW_AT_decl_column : 6
    <f2d>   DW_AT_prototyped  : 1
    <f2d>   DW_AT_low_pc      : 0x8000b58
    <f31>   DW_AT_high_pc     : 0x4c
    <f35>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f37>   DW_AT_call_all_calls: 1
    <f37>   DW_AT_sibling     : <0xf4b>
 <2><f3b>: Abbrev Number: 9 (DW_TAG_variable)
    <f3c>   DW_AT_name        : (indirect string, offset: 0x82942): tmpreg
    <f40>   DW_AT_decl_file   : 1
    <f41>   DW_AT_decl_line   : 63
    <f42>   DW_AT_decl_column : 20
    <f43>   DW_AT_type        : <0x8d5>
    <f47>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><f4a>: Abbrev Number: 0
 <1><f4b>: Abbrev Number: 14 (DW_TAG_subprogram)
    <f4c>   DW_AT_external    : 1
    <f4c>   DW_AT_name        : (indirect string, offset: 0xeb385): vIMURead
    <f50>   DW_AT_decl_file   : 1
    <f50>   DW_AT_decl_line   : 54
    <f51>   DW_AT_decl_column : 6
    <f51>   DW_AT_prototyped  : 1
    <f51>   DW_AT_low_pc      : 0x8000b0c
    <f55>   DW_AT_high_pc     : 0x4c
    <f59>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f5b>   DW_AT_call_all_tail_calls: 1
    <f5b>   DW_AT_sibling     : <0xf6f>
 <2><f5f>: Abbrev Number: 9 (DW_TAG_variable)
    <f60>   DW_AT_name        : (indirect string, offset: 0xe8f07): IMU_Sample
    <f64>   DW_AT_decl_file   : 1
    <f65>   DW_AT_decl_line   : 55
    <f66>   DW_AT_decl_column : 17
    <f67>   DW_AT_type        : <0xc2b>
    <f6b>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><f6e>: Abbrev Number: 0
 <1><f6f>: Abbrev Number: 14 (DW_TAG_subprogram)
    <f70>   DW_AT_external    : 1
    <f70>   DW_AT_name        : (indirect string, offset: 0xeae0b): vHeartbeat
    <f74>   DW_AT_decl_file   : 1
    <f74>   DW_AT_decl_line   : 43
    <f75>   DW_AT_decl_column : 6
    <f75>   DW_AT_prototyped  : 1
    <f75>   DW_AT_low_pc      : 0x80009c8
    <f79>   DW_AT_high_pc     : 0x142
    <f7d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f7f>   DW_AT_call_all_tail_calls: 1
    <f7f>   DW_AT_sibling     : <0xfa2>
 <2><f83>: Abbrev Number: 36 (DW_TAG_formal_parameter)
    <f84>   DW_AT_name        : (indirect string, offset: 0xe8efa): pvParameters
    <f88>   DW_AT_decl_file   : 1
    <f89>   DW_AT_decl_line   : 43
    <f8a>   DW_AT_decl_column : 23
    <f8b>   DW_AT_type        : <0x88f>
    <f8f>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><f92>: Abbrev Number: 9 (DW_TAG_variable)
    <f93>   DW_AT_name        : (indirect string, offset: 0xec467): rate
    <f97>   DW_AT_decl_file   : 1
    <f98>   DW_AT_decl_line   : 44
    <f99>   DW_AT_decl_column : 12
    <f9a>   DW_AT_type        : <0xfa2>
    <f9e>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><fa1>: Abbrev Number: 0
 <1><fa2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <fa3>   DW_AT_byte_size   : 4
    <fa3>   DW_AT_type        : <0x8c9>
 <1><fa7>: Abbrev Number: 37 (DW_TAG_subprogram)
    <fa8>   DW_AT_name        : (indirect string, offset: 0xe9a0b): prvCreateTasks
    <fac>   DW_AT_decl_file   : 1
    <fad>   DW_AT_decl_line   : 37
    <fae>   DW_AT_decl_column : 13
    <faf>   DW_AT_prototyped  : 1
    <faf>   DW_AT_low_pc      : 0x800099c
    <fb3>   DW_AT_high_pc     : 0x2c
    <fb7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fb9>   DW_AT_call_all_tail_calls: 1
    <fb9>   DW_AT_sibling     : <0xfd0>
 <2><fbd>: Abbrev Number: 9 (DW_TAG_variable)
    <fbe>   DW_AT_name        : (indirect string, offset: 0xec467): rate
    <fc2>   DW_AT_decl_file   : 1
    <fc3>   DW_AT_decl_line   : 38
    <fc4>   DW_AT_decl_column : 18
    <fc5>   DW_AT_type        : <0x8c9>
