Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x4d3 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 11 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x299ef): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x97528): ../Core/Src/Drivers/I2C.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x57523): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 3 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x4fce6): signed char
 <1><31>: Abbrev Number: 5 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x2e54f): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 3 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0x98268): unsigned char
 <1><44>: Abbrev Number: 3 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x7583d): short int
 <1><4b>: Abbrev Number: 3 (DW_TAG_base_type)
    <4c>   DW_AT_byte_size   : 2
    <4d>   DW_AT_encoding    : 7	(unsigned)
    <4e>   DW_AT_name        : (indirect string, offset: 0x970a5): short unsigned int
 <1><52>: Abbrev Number: 3 (DW_TAG_base_type)
    <53>   DW_AT_byte_size   : 4
    <54>   DW_AT_encoding    : 5	(signed)
    <55>   DW_AT_name        : (indirect string, offset: 0xcd5a): long int
 <1><59>: Abbrev Number: 5 (DW_TAG_typedef)
    <5a>   DW_AT_name        : (indirect string, offset: 0x652d9): __uint32_t
    <5e>   DW_AT_decl_file   : 2
    <5f>   DW_AT_decl_line   : 79
    <60>   DW_AT_decl_column : 25
    <61>   DW_AT_type        : <0x65>
 <1><65>: Abbrev Number: 3 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 4
    <67>   DW_AT_encoding    : 7	(unsigned)
    <68>   DW_AT_name        : (indirect string, offset: 0x3ccb2): long unsigned int
 <1><6c>: Abbrev Number: 3 (DW_TAG_base_type)
    <6d>   DW_AT_byte_size   : 8
    <6e>   DW_AT_encoding    : 5	(signed)
    <6f>   DW_AT_name        : (indirect string, offset: 0x48957): long long int
 <1><73>: Abbrev Number: 3 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 8
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0x20f43): long long unsigned int
 <1><7a>: Abbrev Number: 12 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : int
 <1><81>: Abbrev Number: 3 (DW_TAG_base_type)
    <82>   DW_AT_byte_size   : 4
    <83>   DW_AT_encoding    : 7	(unsigned)
    <84>   DW_AT_name        : (indirect string, offset: 0xc591): unsigned int
 <1><88>: Abbrev Number: 5 (DW_TAG_typedef)
    <89>   DW_AT_name        : (indirect string, offset: 0x2e551): uint8_t
    <8d>   DW_AT_decl_file   : 3
    <8e>   DW_AT_decl_line   : 24
    <8f>   DW_AT_decl_column : 19
    <90>   DW_AT_type        : <0x31>
 <1><94>: Abbrev Number: 5 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0xd7470): uint32_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 48
    <9b>   DW_AT_decl_column : 20
    <9c>   DW_AT_type        : <0x59>
 <1><a0>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 6 (DW_TAG_structure_type)
    <a6>   DW_AT_byte_size   : 48
    <a7>   DW_AT_decl_file   : 4
    <a7>   DW_AT_decl_line   : 531
    <a9>   DW_AT_decl_column : 9
    <a9>   DW_AT_sibling     : <0x132>
 <2><ad>: Abbrev Number: 1 (DW_TAG_member)
    <ae>   DW_AT_name        : (indirect string, offset: 0x10f4): MODER
    <b2>   DW_AT_decl_file   : 4
    <b2>   DW_AT_decl_line   : 533
    <b4>   DW_AT_decl_column : 17
    <b4>   DW_AT_type        : <0xa0>
    <b8>   DW_AT_data_member_location: 0
 <2><b9>: Abbrev Number: 1 (DW_TAG_member)
    <ba>   DW_AT_name        : (indirect string, offset: 0x7a54b): OTYPER
    <be>   DW_AT_decl_file   : 4
    <be>   DW_AT_decl_line   : 534
    <c0>   DW_AT_decl_column : 17
    <c0>   DW_AT_type        : <0xa0>
    <c4>   DW_AT_data_member_location: 4
 <2><c5>: Abbrev Number: 1 (DW_TAG_member)
    <c6>   DW_AT_name        : (indirect string, offset: 0x89434): OSPEEDR
    <ca>   DW_AT_decl_file   : 4
    <ca>   DW_AT_decl_line   : 535
    <cc>   DW_AT_decl_column : 17
    <cc>   DW_AT_type        : <0xa0>
    <d0>   DW_AT_data_member_location: 8
 <2><d1>: Abbrev Number: 1 (DW_TAG_member)
    <d2>   DW_AT_name        : (indirect string, offset: 0x66ac3): PUPDR
    <d6>   DW_AT_decl_file   : 4
    <d6>   DW_AT_decl_line   : 536
    <d8>   DW_AT_decl_column : 17
    <d8>   DW_AT_type        : <0xa0>
    <dc>   DW_AT_data_member_location: 12
 <2><dd>: Abbrev Number: 2 (DW_TAG_member)
    <de>   DW_AT_name        : IDR
    <e2>   DW_AT_decl_file   : 4
    <e2>   DW_AT_decl_line   : 537
    <e4>   DW_AT_decl_column : 17
    <e4>   DW_AT_type        : <0xa0>
    <e8>   DW_AT_data_member_location: 16
 <2><e9>: Abbrev Number: 2 (DW_TAG_member)
    <ea>   DW_AT_name        : ODR
    <ee>   DW_AT_decl_file   : 4
    <ee>   DW_AT_decl_line   : 538
    <f0>   DW_AT_decl_column : 17
    <f0>   DW_AT_type        : <0xa0>
    <f4>   DW_AT_data_member_location: 20
 <2><f5>: Abbrev Number: 1 (DW_TAG_member)
    <f6>   DW_AT_name        : (indirect string, offset: 0x239c6): BSRR
    <fa>   DW_AT_decl_file   : 4
    <fa>   DW_AT_decl_line   : 539
    <fc>   DW_AT_decl_column : 17
    <fc>   DW_AT_type        : <0xa0>
    <100>   DW_AT_data_member_location: 24
 <2><101>: Abbrev Number: 1 (DW_TAG_member)
    <102>   DW_AT_name        : (indirect string, offset: 0x877c4): LCKR
    <106>   DW_AT_decl_file   : 4
    <106>   DW_AT_decl_line   : 540
    <108>   DW_AT_decl_column : 17
    <108>   DW_AT_type        : <0xa0>
    <10c>   DW_AT_data_member_location: 28
 <2><10d>: Abbrev Number: 2 (DW_TAG_member)
    <10e>   DW_AT_name        : AFR
    <112>   DW_AT_decl_file   : 4
    <112>   DW_AT_decl_line   : 541
    <114>   DW_AT_decl_column : 17
    <114>   DW_AT_type        : <0x142>
    <118>   DW_AT_data_member_location: 32
 <2><119>: Abbrev Number: 2 (DW_TAG_member)
    <11a>   DW_AT_name        : BRR
    <11e>   DW_AT_decl_file   : 4
    <11e>   DW_AT_decl_line   : 542
    <120>   DW_AT_decl_column : 17
    <120>   DW_AT_type        : <0xa0>
    <124>   DW_AT_data_member_location: 40
 <2><125>: Abbrev Number: 1 (DW_TAG_member)
    <126>   DW_AT_name        : (indirect string, offset: 0x1b92): ASCR
    <12a>   DW_AT_decl_file   : 4
    <12a>   DW_AT_decl_line   : 543
    <12c>   DW_AT_decl_column : 17
    <12c>   DW_AT_type        : <0xa0>
    <130>   DW_AT_data_member_location: 44
 <2><131>: Abbrev Number: 0
 <1><132>: Abbrev Number: 13 (DW_TAG_array_type)
    <133>   DW_AT_type        : <0xa0>
    <137>   DW_AT_sibling     : <0x142>
 <2><13b>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <13c>   DW_AT_type        : <0x81>
    <140>   DW_AT_upper_bound : 1
 <2><141>: Abbrev Number: 0
 <1><142>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <143>   DW_AT_type        : <0x132>
 <1><147>: Abbrev Number: 7 (DW_TAG_typedef)
    <148>   DW_AT_name        : (indirect string, offset: 0x991b6): GPIO_TypeDef
    <14c>   DW_AT_decl_file   : 4
    <14c>   DW_AT_decl_line   : 545
    <14e>   DW_AT_decl_column : 3
    <14e>   DW_AT_type        : <0xa5>
 <1><152>: Abbrev Number: 6 (DW_TAG_structure_type)
    <153>   DW_AT_byte_size   : 44
    <154>   DW_AT_decl_file   : 4
    <154>   DW_AT_decl_line   : 552
    <156>   DW_AT_decl_column : 9
    <156>   DW_AT_sibling     : <0x1df>
 <2><15a>: Abbrev Number: 2 (DW_TAG_member)
    <15b>   DW_AT_name        : CR1
    <15f>   DW_AT_decl_file   : 4
    <15f>   DW_AT_decl_line   : 554
    <161>   DW_AT_decl_column : 17
    <161>   DW_AT_type        : <0xa0>
    <165>   DW_AT_data_member_location: 0
 <2><166>: Abbrev Number: 2 (DW_TAG_member)
    <167>   DW_AT_name        : CR2
    <16b>   DW_AT_decl_file   : 4
    <16b>   DW_AT_decl_line   : 555
    <16d>   DW_AT_decl_column : 17
    <16d>   DW_AT_type        : <0xa0>
    <171>   DW_AT_data_member_location: 4
 <2><172>: Abbrev Number: 1 (DW_TAG_member)
    <173>   DW_AT_name        : (indirect string, offset: 0x173b9): OAR1
    <177>   DW_AT_decl_file   : 4
    <177>   DW_AT_decl_line   : 556
    <179>   DW_AT_decl_column : 17
    <179>   DW_AT_type        : <0xa0>
    <17d>   DW_AT_data_member_location: 8
 <2><17e>: Abbrev Number: 1 (DW_TAG_member)
    <17f>   DW_AT_name        : (indirect string, offset: 0x434eb): OAR2
    <183>   DW_AT_decl_file   : 4
    <183>   DW_AT_decl_line   : 557
    <185>   DW_AT_decl_column : 17
    <185>   DW_AT_type        : <0xa0>
    <189>   DW_AT_data_member_location: 12
 <2><18a>: Abbrev Number: 1 (DW_TAG_member)
    <18b>   DW_AT_name        : (indirect string, offset: 0x5d94b): TIMINGR
    <18f>   DW_AT_decl_file   : 4
    <18f>   DW_AT_decl_line   : 558
    <191>   DW_AT_decl_column : 17
    <191>   DW_AT_type        : <0xa0>
    <195>   DW_AT_data_member_location: 16
 <2><196>: Abbrev Number: 1 (DW_TAG_member)
    <197>   DW_AT_name        : (indirect string, offset: 0x80bf2): TIMEOUTR
    <19b>   DW_AT_decl_file   : 4
    <19b>   DW_AT_decl_line   : 559
    <19d>   DW_AT_decl_column : 17
    <19d>   DW_AT_type        : <0xa0>
    <1a1>   DW_AT_data_member_location: 20
 <2><1a2>: Abbrev Number: 2 (DW_TAG_member)
    <1a3>   DW_AT_name        : ISR
    <1a7>   DW_AT_decl_file   : 4
    <1a7>   DW_AT_decl_line   : 560
    <1a9>   DW_AT_decl_column : 17
    <1a9>   DW_AT_type        : <0xa0>
    <1ad>   DW_AT_data_member_location: 24
 <2><1ae>: Abbrev Number: 2 (DW_TAG_member)
    <1af>   DW_AT_name        : ICR
    <1b3>   DW_AT_decl_file   : 4
    <1b3>   DW_AT_decl_line   : 561
    <1b5>   DW_AT_decl_column : 17
    <1b5>   DW_AT_type        : <0xa0>
    <1b9>   DW_AT_data_member_location: 28
 <2><1ba>: Abbrev Number: 1 (DW_TAG_member)
    <1bb>   DW_AT_name        : (indirect string, offset: 0x6d8ef): PECR
    <1bf>   DW_AT_decl_file   : 4
    <1bf>   DW_AT_decl_line   : 562
    <1c1>   DW_AT_decl_column : 17
    <1c1>   DW_AT_type        : <0xa0>
    <1c5>   DW_AT_data_member_location: 32
 <2><1c6>: Abbrev Number: 1 (DW_TAG_member)
    <1c7>   DW_AT_name        : (indirect string, offset: 0x827d2): RXDR
    <1cb>   DW_AT_decl_file   : 4
    <1cb>   DW_AT_decl_line   : 563
    <1cd>   DW_AT_decl_column : 17
    <1cd>   DW_AT_type        : <0xa0>
    <1d1>   DW_AT_data_member_location: 36
 <2><1d2>: Abbrev Number: 1 (DW_TAG_member)
    <1d3>   DW_AT_name        : (indirect string, offset: 0x1e746): TXDR
    <1d7>   DW_AT_decl_file   : 4
    <1d7>   DW_AT_decl_line   : 564
    <1d9>   DW_AT_decl_column : 17
    <1d9>   DW_AT_type        : <0xa0>
    <1dd>   DW_AT_data_member_location: 40
 <2><1de>: Abbrev Number: 0
 <1><1df>: Abbrev Number: 7 (DW_TAG_typedef)
    <1e0>   DW_AT_name        : (indirect string, offset: 0x7c6f4): I2C_TypeDef
    <1e4>   DW_AT_decl_file   : 4
    <1e4>   DW_AT_decl_line   : 565
    <1e6>   DW_AT_decl_column : 3
    <1e6>   DW_AT_type        : <0x152>
 <1><1ea>: Abbrev Number: 6 (DW_TAG_structure_type)
    <1eb>   DW_AT_byte_size   : 152
    <1ec>   DW_AT_decl_file   : 4
    <1ec>   DW_AT_decl_line   : 685
    <1ee>   DW_AT_decl_column : 9
    <1ee>   DW_AT_sibling     : <0x3ba>
 <2><1f2>: Abbrev Number: 2 (DW_TAG_member)
    <1f3>   DW_AT_name        : CR
    <1f6>   DW_AT_decl_file   : 4
    <1f6>   DW_AT_decl_line   : 687
    <1f8>   DW_AT_decl_column : 17
    <1f8>   DW_AT_type        : <0xa0>
    <1fc>   DW_AT_data_member_location: 0
 <2><1fd>: Abbrev Number: 1 (DW_TAG_member)
    <1fe>   DW_AT_name        : (indirect string, offset: 0x6af01): ICSCR
    <202>   DW_AT_decl_file   : 4
    <202>   DW_AT_decl_line   : 688
    <204>   DW_AT_decl_column : 17
    <204>   DW_AT_type        : <0xa0>
    <208>   DW_AT_data_member_location: 4
 <2><209>: Abbrev Number: 1 (DW_TAG_member)
    <20a>   DW_AT_name        : (indirect string, offset: 0x34674): CFGR
    <20e>   DW_AT_decl_file   : 4
    <20e>   DW_AT_decl_line   : 689
    <210>   DW_AT_decl_column : 17
    <210>   DW_AT_type        : <0xa0>
    <214>   DW_AT_data_member_location: 8
 <2><215>: Abbrev Number: 1 (DW_TAG_member)
    <216>   DW_AT_name        : (indirect string, offset: 0x6f093): PLLCFGR
    <21a>   DW_AT_decl_file   : 4
    <21a>   DW_AT_decl_line   : 690
    <21c>   DW_AT_decl_column : 17
    <21c>   DW_AT_type        : <0xa0>
    <220>   DW_AT_data_member_location: 12
 <2><221>: Abbrev Number: 1 (DW_TAG_member)
    <222>   DW_AT_name        : (indirect string, offset: 0x3466d): PLLSAI1CFGR
    <226>   DW_AT_decl_file   : 4
    <226>   DW_AT_decl_line   : 691
    <228>   DW_AT_decl_column : 17
    <228>   DW_AT_type        : <0xa0>
    <22c>   DW_AT_data_member_location: 16
 <2><22d>: Abbrev Number: 1 (DW_TAG_member)
    <22e>   DW_AT_name        : (indirect string, offset: 0x6750c): PLLSAI2CFGR
    <232>   DW_AT_decl_file   : 4
    <232>   DW_AT_decl_line   : 692
    <234>   DW_AT_decl_column : 17
    <234>   DW_AT_type        : <0xa0>
    <238>   DW_AT_data_member_location: 20
 <2><239>: Abbrev Number: 1 (DW_TAG_member)
    <23a>   DW_AT_name        : (indirect string, offset: 0x1e2c): CIER
    <23e>   DW_AT_decl_file   : 4
    <23e>   DW_AT_decl_line   : 693
    <240>   DW_AT_decl_column : 17
    <240>   DW_AT_type        : <0xa0>
    <244>   DW_AT_data_member_location: 24
 <2><245>: Abbrev Number: 1 (DW_TAG_member)
    <246>   DW_AT_name        : (indirect string, offset: 0x21bc): CIFR
    <24a>   DW_AT_decl_file   : 4
    <24a>   DW_AT_decl_line   : 694
    <24c>   DW_AT_decl_column : 17
    <24c>   DW_AT_type        : <0xa0>
    <250>   DW_AT_data_member_location: 28
 <2><251>: Abbrev Number: 1 (DW_TAG_member)
    <252>   DW_AT_name        : (indirect string, offset: 0x14c7): CICR
    <256>   DW_AT_decl_file   : 4
    <256>   DW_AT_decl_line   : 695
    <258>   DW_AT_decl_column : 17
    <258>   DW_AT_type        : <0xa0>
    <25c>   DW_AT_data_member_location: 32
 <2><25d>: Abbrev Number: 1 (DW_TAG_member)
    <25e>   DW_AT_name        : (indirect string, offset: 0x94934): RESERVED0
    <262>   DW_AT_decl_file   : 4
    <262>   DW_AT_decl_line   : 696
    <264>   DW_AT_decl_column : 17
    <264>   DW_AT_type        : <0x94>
    <268>   DW_AT_data_member_location: 36
 <2><269>: Abbrev Number: 1 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0x7df1e): AHB1RSTR
    <26e>   DW_AT_decl_file   : 4
    <26e>   DW_AT_decl_line   : 697
    <270>   DW_AT_decl_column : 17
    <270>   DW_AT_type        : <0xa0>
    <274>   DW_AT_data_member_location: 40
 <2><275>: Abbrev Number: 1 (DW_TAG_member)
    <276>   DW_AT_name        : (indirect string, offset: 0x1d1de): AHB2RSTR
    <27a>   DW_AT_decl_file   : 4
    <27a>   DW_AT_decl_line   : 698
    <27c>   DW_AT_decl_column : 17
    <27c>   DW_AT_type        : <0xa0>
    <280>   DW_AT_data_member_location: 44
 <2><281>: Abbrev Number: 1 (DW_TAG_member)
    <282>   DW_AT_name        : (indirect string, offset: 0x342f4): AHB3RSTR
    <286>   DW_AT_decl_file   : 4
    <286>   DW_AT_decl_line   : 699
    <288>   DW_AT_decl_column : 17
    <288>   DW_AT_type        : <0xa0>
    <28c>   DW_AT_data_member_location: 48
 <2><28d>: Abbrev Number: 1 (DW_TAG_member)
    <28e>   DW_AT_name        : (indirect string, offset: 0x9493e): RESERVED1
    <292>   DW_AT_decl_file   : 4
    <292>   DW_AT_decl_line   : 700
    <294>   DW_AT_decl_column : 17
    <294>   DW_AT_type        : <0x94>
    <298>   DW_AT_data_member_location: 52
 <2><299>: Abbrev Number: 1 (DW_TAG_member)
    <29a>   DW_AT_name        : (indirect string, offset: 0x2025f): APB1RSTR1
    <29e>   DW_AT_decl_file   : 4
    <29e>   DW_AT_decl_line   : 701
    <2a0>   DW_AT_decl_column : 17
    <2a0>   DW_AT_type        : <0xa0>
    <2a4>   DW_AT_data_member_location: 56
 <2><2a5>: Abbrev Number: 1 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x20269): APB1RSTR2
    <2aa>   DW_AT_decl_file   : 4
    <2aa>   DW_AT_decl_line   : 702
    <2ac>   DW_AT_decl_column : 17
    <2ac>   DW_AT_type        : <0xa0>
    <2b0>   DW_AT_data_member_location: 60
 <2><2b1>: Abbrev Number: 1 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0x452d5): APB2RSTR
    <2b6>   DW_AT_decl_file   : 4
    <2b6>   DW_AT_decl_line   : 703
    <2b8>   DW_AT_decl_column : 17
    <2b8>   DW_AT_type        : <0xa0>
    <2bc>   DW_AT_data_member_location: 64
 <2><2bd>: Abbrev Number: 1 (DW_TAG_member)
    <2be>   DW_AT_name        : (indirect string, offset: 0x94948): RESERVED2
    <2c2>   DW_AT_decl_file   : 4
    <2c2>   DW_AT_decl_line   : 704
    <2c4>   DW_AT_decl_column : 17
    <2c4>   DW_AT_type        : <0x94>
    <2c8>   DW_AT_data_member_location: 68
 <2><2c9>: Abbrev Number: 1 (DW_TAG_member)
    <2ca>   DW_AT_name        : (indirect string, offset: 0xc557): AHB1ENR
    <2ce>   DW_AT_decl_file   : 4
    <2ce>   DW_AT_decl_line   : 705
    <2d0>   DW_AT_decl_column : 17
    <2d0>   DW_AT_type        : <0xa0>
    <2d4>   DW_AT_data_member_location: 72
 <2><2d5>: Abbrev Number: 1 (DW_TAG_member)
    <2d6>   DW_AT_name        : (indirect string, offset: 0x2a2be): AHB2ENR
    <2da>   DW_AT_decl_file   : 4
    <2da>   DW_AT_decl_line   : 706
    <2dc>   DW_AT_decl_column : 17
    <2dc>   DW_AT_type        : <0xa0>
    <2e0>   DW_AT_data_member_location: 76
 <2><2e1>: Abbrev Number: 1 (DW_TAG_member)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x477be): AHB3ENR
    <2e6>   DW_AT_decl_file   : 4
    <2e6>   DW_AT_decl_line   : 707
    <2e8>   DW_AT_decl_column : 17
    <2e8>   DW_AT_type        : <0xa0>
    <2ec>   DW_AT_data_member_location: 80
 <2><2ed>: Abbrev Number: 1 (DW_TAG_member)
    <2ee>   DW_AT_name        : (indirect string, offset: 0x94952): RESERVED3
    <2f2>   DW_AT_decl_file   : 4
    <2f2>   DW_AT_decl_line   : 708
    <2f4>   DW_AT_decl_column : 17
    <2f4>   DW_AT_type        : <0x94>
    <2f8>   DW_AT_data_member_location: 84
 <2><2f9>: Abbrev Number: 1 (DW_TAG_member)
    <2fa>   DW_AT_name        : (indirect string, offset: 0x5148): APB1ENR1
    <2fe>   DW_AT_decl_file   : 4
    <2fe>   DW_AT_decl_line   : 709
    <300>   DW_AT_decl_column : 17
    <300>   DW_AT_type        : <0xa0>
    <304>   DW_AT_data_member_location: 88
 <2><305>: Abbrev Number: 1 (DW_TAG_member)
    <306>   DW_AT_name        : (indirect string, offset: 0x5151): APB1ENR2
    <30a>   DW_AT_decl_file   : 4
    <30a>   DW_AT_decl_line   : 710
    <30c>   DW_AT_decl_column : 17
    <30c>   DW_AT_type        : <0xa0>
    <310>   DW_AT_data_member_location: 92
 <2><311>: Abbrev Number: 1 (DW_TAG_member)
    <312>   DW_AT_name        : (indirect string, offset: 0x12839): APB2ENR
    <316>   DW_AT_decl_file   : 4
    <316>   DW_AT_decl_line   : 711
    <318>   DW_AT_decl_column : 17
    <318>   DW_AT_type        : <0xa0>
    <31c>   DW_AT_data_member_location: 96
 <2><31d>: Abbrev Number: 1 (DW_TAG_member)
    <31e>   DW_AT_name        : (indirect string, offset: 0x58712): RESERVED4
    <322>   DW_AT_decl_file   : 4
    <322>   DW_AT_decl_line   : 712
    <324>   DW_AT_decl_column : 17
    <324>   DW_AT_type        : <0x94>
    <328>   DW_AT_data_member_location: 100
 <2><329>: Abbrev Number: 1 (DW_TAG_member)
    <32a>   DW_AT_name        : (indirect string, offset: 0x4921d): AHB1SMENR
    <32e>   DW_AT_decl_file   : 4
    <32e>   DW_AT_decl_line   : 713
    <330>   DW_AT_decl_column : 17
    <330>   DW_AT_type        : <0xa0>
    <334>   DW_AT_data_member_location: 104
 <2><335>: Abbrev Number: 1 (DW_TAG_member)
    <336>   DW_AT_name        : (indirect string, offset: 0x908da): AHB2SMENR
    <33a>   DW_AT_decl_file   : 4
    <33a>   DW_AT_decl_line   : 714
    <33c>   DW_AT_decl_column : 17
    <33c>   DW_AT_type        : <0xa0>
    <340>   DW_AT_data_member_location: 108
 <2><341>: Abbrev Number: 1 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0x3a543): AHB3SMENR
    <346>   DW_AT_decl_file   : 4
    <346>   DW_AT_decl_line   : 715
    <348>   DW_AT_decl_column : 17
    <348>   DW_AT_type        : <0xa0>
    <34c>   DW_AT_data_member_location: 112
 <2><34d>: Abbrev Number: 1 (DW_TAG_member)
    <34e>   DW_AT_name        : (indirect string, offset: 0x94980): RESERVED5
    <352>   DW_AT_decl_file   : 4
    <352>   DW_AT_decl_line   : 716
    <354>   DW_AT_decl_column : 17
    <354>   DW_AT_type        : <0x94>
    <358>   DW_AT_data_member_location: 116
 <2><359>: Abbrev Number: 1 (DW_TAG_member)
    <35a>   DW_AT_name        : (indirect string, offset: 0x59da): APB1SMENR1
    <35e>   DW_AT_decl_file   : 4
    <35e>   DW_AT_decl_line   : 717
    <360>   DW_AT_decl_column : 17
    <360>   DW_AT_type        : <0xa0>
    <364>   DW_AT_data_member_location: 120
 <2><365>: Abbrev Number: 1 (DW_TAG_member)
    <366>   DW_AT_name        : (indirect string, offset: 0x59e5): APB1SMENR2
    <36a>   DW_AT_decl_file   : 4
    <36a>   DW_AT_decl_line   : 718
    <36c>   DW_AT_decl_column : 17
    <36c>   DW_AT_type        : <0xa0>
    <370>   DW_AT_data_member_location: 124
 <2><371>: Abbrev Number: 1 (DW_TAG_member)
    <372>   DW_AT_name        : (indirect string, offset: 0x7f70a): APB2SMENR
    <376>   DW_AT_decl_file   : 4
    <376>   DW_AT_decl_line   : 719
    <378>   DW_AT_decl_column : 17
    <378>   DW_AT_type        : <0xa0>
    <37c>   DW_AT_data_member_location: 128
 <2><37d>: Abbrev Number: 1 (DW_TAG_member)
    <37e>   DW_AT_name        : (indirect string, offset: 0x9498a): RESERVED6
    <382>   DW_AT_decl_file   : 4
    <382>   DW_AT_decl_line   : 720
    <384>   DW_AT_decl_column : 17
    <384>   DW_AT_type        : <0x94>
    <388>   DW_AT_data_member_location: 132
 <2><389>: Abbrev Number: 1 (DW_TAG_member)
    <38a>   DW_AT_name        : (indirect string, offset: 0x30a10): CCIPR
    <38e>   DW_AT_decl_file   : 4
    <38e>   DW_AT_decl_line   : 721
    <390>   DW_AT_decl_column : 17
    <390>   DW_AT_type        : <0xa0>
    <394>   DW_AT_data_member_location: 136
 <2><395>: Abbrev Number: 1 (DW_TAG_member)
    <396>   DW_AT_name        : (indirect string, offset: 0x94994): RESERVED7
    <39a>   DW_AT_decl_file   : 4
    <39a>   DW_AT_decl_line   : 722
    <39c>   DW_AT_decl_column : 17
    <39c>   DW_AT_type        : <0x94>
    <3a0>   DW_AT_data_member_location: 140
 <2><3a1>: Abbrev Number: 1 (DW_TAG_member)
    <3a2>   DW_AT_name        : (indirect string, offset: 0x2950e): BDCR
    <3a6>   DW_AT_decl_file   : 4
    <3a6>   DW_AT_decl_line   : 723
    <3a8>   DW_AT_decl_column : 17
    <3a8>   DW_AT_type        : <0xa0>
    <3ac>   DW_AT_data_member_location: 144
 <2><3ad>: Abbrev Number: 2 (DW_TAG_member)
    <3ae>   DW_AT_name        : CSR
    <3b2>   DW_AT_decl_file   : 4
    <3b2>   DW_AT_decl_line   : 724
    <3b4>   DW_AT_decl_column : 17
    <3b4>   DW_AT_type        : <0xa0>
    <3b8>   DW_AT_data_member_location: 148
 <2><3b9>: Abbrev Number: 0
 <1><3ba>: Abbrev Number: 7 (DW_TAG_typedef)
    <3bb>   DW_AT_name        : (indirect string, offset: 0x49a7b): RCC_TypeDef
    <3bf>   DW_AT_decl_file   : 4
    <3bf>   DW_AT_decl_line   : 725
    <3c1>   DW_AT_decl_column : 3
    <3c1>   DW_AT_type        : <0x1ea>
 <1><3c5>: Abbrev Number: 15 (DW_TAG_variable)
    <3c6>   DW_AT_name        : (indirect string, offset: 0x8293a): tmpreg
    <3ca>   DW_AT_decl_file   : 1
    <3cb>   DW_AT_decl_line   : 4
    <3cc>   DW_AT_decl_column : 19
    <3cd>   DW_AT_type        : <0xa0>
    <3d1>   DW_AT_external    : 1
    <3d1>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><3d7>: Abbrev Number: 16 (DW_TAG_subprogram)
    <3d8>   DW_AT_external    : 1
    <3d8>   DW_AT_name        : (indirect string, offset: 0x293ad): I2C1_Config
    <3dc>   DW_AT_decl_file   : 1
    <3dd>   DW_AT_decl_line   : 97
    <3de>   DW_AT_decl_column : 6
    <3df>   DW_AT_prototyped  : 1
    <3df>   DW_AT_low_pc      : 0x8000770
    <3e3>   DW_AT_high_pc     : 0x144
    <3e7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3e9>   DW_AT_call_all_calls: 1
 <1><3e9>: Abbrev Number: 9 (DW_TAG_subprogram)
    <3ea>   DW_AT_external    : 1
    <3ea>   DW_AT_name        : (indirect string, offset: 0x6dc7): I2C1_Write
    <3ee>   DW_AT_decl_file   : 1
    <3ee>   DW_AT_decl_line   : 74
    <3ef>   DW_AT_decl_column : 6
    <3ef>   DW_AT_prototyped  : 1
    <3ef>   DW_AT_low_pc      : 0x80006e4
    <3f3>   DW_AT_high_pc     : 0x8c
    <3f7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3f9>   DW_AT_call_all_calls: 1
    <3f9>   DW_AT_sibling     : <0x428>
 <2><3fd>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <3fe>   DW_AT_name        : (indirect string, offset: 0x2dac0): devAddr
    <402>   DW_AT_decl_file   : 1
    <402>   DW_AT_decl_line   : 74
    <403>   DW_AT_decl_column : 25
    <404>   DW_AT_type        : <0x88>
    <408>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><40b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <40c>   DW_AT_name        : (indirect string, offset: 0x59d8b): regAddr
    <410>   DW_AT_decl_file   : 1
    <410>   DW_AT_decl_line   : 74
    <411>   DW_AT_decl_column : 42
    <412>   DW_AT_type        : <0x88>
    <416>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><419>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <41a>   DW_AT_name        : (indirect string, offset: 0x4a1e0): data
    <41e>   DW_AT_decl_file   : 1
    <41e>   DW_AT_decl_line   : 74
    <41f>   DW_AT_decl_column : 59
    <420>   DW_AT_type        : <0x88>
    <424>   DW_AT_location    : 2 byte block: 91 75 	(DW_OP_fbreg: -11)
 <2><427>: Abbrev Number: 0
 <1><428>: Abbrev Number: 17 (DW_TAG_subprogram)
    <429>   DW_AT_external    : 1
    <429>   DW_AT_name        : (indirect string, offset: 0x6dde5): I2C1_Read
    <42d>   DW_AT_decl_file   : 1
    <42e>   DW_AT_decl_line   : 34
    <42f>   DW_AT_decl_column : 9
    <430>   DW_AT_prototyped  : 1
    <430>   DW_AT_type        : <0x88>
    <434>   DW_AT_low_pc      : 0x8000634
    <438>   DW_AT_high_pc     : 0xb0
    <43c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <43e>   DW_AT_call_all_calls: 1
    <43e>   DW_AT_sibling     : <0x46e>
 <2><442>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <443>   DW_AT_name        : (indirect string, offset: 0x2dac0): devAddr
    <447>   DW_AT_decl_file   : 1
    <447>   DW_AT_decl_line   : 34
    <448>   DW_AT_decl_column : 27
    <449>   DW_AT_type        : <0x88>
    <44d>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><450>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <451>   DW_AT_name        : (indirect string, offset: 0x59d8b): regAddr
    <455>   DW_AT_decl_file   : 1
    <455>   DW_AT_decl_line   : 34
    <456>   DW_AT_decl_column : 44
    <457>   DW_AT_type        : <0x88>
    <45b>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><45e>: Abbrev Number: 18 (DW_TAG_variable)
    <45f>   DW_AT_name        : (indirect string, offset: 0x4a1e0): data
    <463>   DW_AT_decl_file   : 1
    <464>   DW_AT_decl_line   : 35
    <465>   DW_AT_decl_column : 10
    <466>   DW_AT_type        : <0x88>
    <46a>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><46d>: Abbrev Number: 0
 <1><46e>: Abbrev Number: 9 (DW_TAG_subprogram)
    <46f>   DW_AT_external    : 1
    <46f>   DW_AT_name        : (indirect string, offset: 0x3bfaa): I2C1_MultiRead
    <473>   DW_AT_decl_file   : 1
    <473>   DW_AT_decl_line   : 7
    <474>   DW_AT_decl_column : 6
    <474>   DW_AT_prototyped  : 1
    <474>   DW_AT_low_pc      : 0x8000560
    <478>   DW_AT_high_pc     : 0xd4
    <47c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <47e>   DW_AT_call_all_calls: 1
    <47e>   DW_AT_sibling     : <0x4d0>
 <2><482>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <483>   DW_AT_name        : (indirect string, offset: 0x2dac0): devAddr
    <487>   DW_AT_decl_file   : 1
    <487>   DW_AT_decl_line   : 7
    <488>   DW_AT_decl_column : 29
    <489>   DW_AT_type        : <0x88>
    <48d>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><490>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <491>   DW_AT_name        : (indirect string, offset: 0x59d8b): regAddr
    <495>   DW_AT_decl_file   : 1
    <495>   DW_AT_decl_line   : 7
    <496>   DW_AT_decl_column : 46
    <497>   DW_AT_type        : <0x88>
    <49b>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><49e>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <49f>   DW_AT_name        : buf
    <4a3>   DW_AT_decl_file   : 1
    <4a3>   DW_AT_decl_line   : 7
    <4a3>   DW_AT_decl_column : 64
    <4a4>   DW_AT_type        : <0x4d0>
    <4a8>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><4ab>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <4ac>   DW_AT_name        : len
    <4b0>   DW_AT_decl_file   : 1
    <4b0>   DW_AT_decl_line   : 7
    <4b0>   DW_AT_decl_column : 77
    <4b1>   DW_AT_type        : <0x88>
    <4b5>   DW_AT_location    : 2 byte block: 91 6d 	(DW_OP_fbreg: -19)
 <2><4b8>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <4b9>   DW_AT_low_pc      : 0x80005e0
    <4bd>   DW_AT_high_pc     : 0x30
 <3><4c1>: Abbrev Number: 20 (DW_TAG_variable)
    <4c2>   DW_AT_name        : i
    <4c4>   DW_AT_decl_file   : 1
    <4c5>   DW_AT_decl_line   : 24
    <4c6>   DW_AT_decl_column : 17
    <4c7>   DW_AT_type        : <0x88>
    <4cb>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <3><4ce>: Abbrev Number: 0
 <2><4cf>: Abbrev Number: 0
 <1><4d0>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <4d1>   DW_AT_byte_size   : 4
    <4d2>   DW_AT_type        : <0x88>
 <1><4d6>: Abbrev Number: 0
  Compilation Unit @ offset 0x4d7:
   Length:        0x201 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x15b
   Pointer Size:  4
 <0><4e3>: Abbrev Number: 8 (DW_TAG_compile_unit)
    <4e4>   DW_AT_producer    : (indirect string, offset: 0x299ef): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <4e8>   DW_AT_language    : 29	(C11)
    <4e9>   DW_AT_name        : (indirect string, offset: 0xa011a): ../Core/Src/Drivers/LSM6DS3.c
    <4ed>   DW_AT_comp_dir    : (indirect string, offset: 0x57523): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <4f1>   DW_AT_ranges      : 0x35
    <4f5>   DW_AT_low_pc      : 0
    <4f9>   DW_AT_stmt_list   : 0x7d2
    <4fd>   DW_AT_macros      : 0x1c3fc
 <1><501>: Abbrev Number: 1 (DW_TAG_base_type)
    <502>   DW_AT_byte_size   : 1
    <503>   DW_AT_encoding    : 6	(signed char)
    <504>   DW_AT_name        : (indirect string, offset: 0x4fce6): signed char
 <1><508>: Abbrev Number: 3 (DW_TAG_typedef)
    <509>   DW_AT_name        : (indirect string, offset: 0x2e54f): __uint8_t
    <50d>   DW_AT_decl_file   : 2
    <50e>   DW_AT_decl_line   : 43
    <50f>   DW_AT_decl_column : 24
    <510>   DW_AT_type        : <0x514>
 <1><514>: Abbrev Number: 1 (DW_TAG_base_type)
    <515>   DW_AT_byte_size   : 1
    <516>   DW_AT_encoding    : 8	(unsigned char)
    <517>   DW_AT_name        : (indirect string, offset: 0x98268): unsigned char
 <1><51b>: Abbrev Number: 3 (DW_TAG_typedef)
    <51c>   DW_AT_name        : (indirect string, offset: 0x9ed24): __int16_t
    <520>   DW_AT_decl_file   : 2
    <521>   DW_AT_decl_line   : 55
    <522>   DW_AT_decl_column : 24
    <523>   DW_AT_type        : <0x527>
 <1><527>: Abbrev Number: 1 (DW_TAG_base_type)
    <528>   DW_AT_byte_size   : 2
    <529>   DW_AT_encoding    : 5	(signed)
    <52a>   DW_AT_name        : (indirect string, offset: 0x7583d): short int
 <1><52e>: Abbrev Number: 3 (DW_TAG_typedef)
    <52f>   DW_AT_name        : (indirect string, offset: 0xa1445): __uint16_t
    <533>   DW_AT_decl_file   : 2
    <534>   DW_AT_decl_line   : 57
    <535>   DW_AT_decl_column : 25
    <536>   DW_AT_type        : <0x53a>
 <1><53a>: Abbrev Number: 1 (DW_TAG_base_type)
    <53b>   DW_AT_byte_size   : 2
    <53c>   DW_AT_encoding    : 7	(unsigned)
    <53d>   DW_AT_name        : (indirect string, offset: 0x970a5): short unsigned int
 <1><541>: Abbrev Number: 1 (DW_TAG_base_type)
    <542>   DW_AT_byte_size   : 4
    <543>   DW_AT_encoding    : 5	(signed)
    <544>   DW_AT_name        : (indirect string, offset: 0xcd5a): long int
 <1><548>: Abbrev Number: 1 (DW_TAG_base_type)
    <549>   DW_AT_byte_size   : 4
    <54a>   DW_AT_encoding    : 7	(unsigned)
    <54b>   DW_AT_name        : (indirect string, offset: 0x3ccb2): long unsigned int
 <1><54f>: Abbrev Number: 1 (DW_TAG_base_type)
    <550>   DW_AT_byte_size   : 8
    <551>   DW_AT_encoding    : 5	(signed)
    <552>   DW_AT_name        : (indirect string, offset: 0x48957): long long int
 <1><556>: Abbrev Number: 1 (DW_TAG_base_type)
    <557>   DW_AT_byte_size   : 8
    <558>   DW_AT_encoding    : 7	(unsigned)
    <559>   DW_AT_name        : (indirect string, offset: 0x20f43): long long unsigned int
 <1><55d>: Abbrev Number: 9 (DW_TAG_base_type)
    <55e>   DW_AT_byte_size   : 4
    <55f>   DW_AT_encoding    : 5	(signed)
    <560>   DW_AT_name        : int
 <1><564>: Abbrev Number: 1 (DW_TAG_base_type)
    <565>   DW_AT_byte_size   : 4
    <566>   DW_AT_encoding    : 7	(unsigned)
    <567>   DW_AT_name        : (indirect string, offset: 0xc591): unsigned int
 <1><56b>: Abbrev Number: 1 (DW_TAG_base_type)
    <56c>   DW_AT_byte_size   : 8
    <56d>   DW_AT_encoding    : 4	(float)
    <56e>   DW_AT_name        : (indirect string, offset: 0x9e777): long double
 <1><572>: Abbrev Number: 1 (DW_TAG_base_type)
    <573>   DW_AT_byte_size   : 1
    <574>   DW_AT_encoding    : 8	(unsigned char)
    <575>   DW_AT_name        : (indirect string, offset: 0xb9629): char
 <1><579>: Abbrev Number: 10 (DW_TAG_const_type)
    <57a>   DW_AT_type        : <0x572>
 <1><57e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <57f>   DW_AT_byte_size   : 4
    <57f>   DW_AT_type        : <0x579>
 <1><583>: Abbrev Number: 3 (DW_TAG_typedef)
    <584>   DW_AT_name        : (indirect string, offset: 0x2e551): uint8_t
    <588>   DW_AT_decl_file   : 3
    <589>   DW_AT_decl_line   : 24
    <58a>   DW_AT_decl_column : 19
    <58b>   DW_AT_type        : <0x508>
 <1><58f>: Abbrev Number: 3 (DW_TAG_typedef)
    <590>   DW_AT_name        : (indirect string, offset: 0x9ed26): int16_t
    <594>   DW_AT_decl_file   : 3
    <595>   DW_AT_decl_line   : 32
    <596>   DW_AT_decl_column : 19
    <597>   DW_AT_type        : <0x51b>
 <1><59b>: Abbrev Number: 3 (DW_TAG_typedef)
    <59c>   DW_AT_name        : (indirect string, offset: 0xa1447): uint16_t
    <5a0>   DW_AT_decl_file   : 3
    <5a1>   DW_AT_decl_line   : 36
    <5a2>   DW_AT_decl_column : 20
    <5a3>   DW_AT_type        : <0x52e>
 <1><5a7>: Abbrev Number: 11 (DW_TAG_structure_type)
    <5a8>   DW_AT_byte_size   : 12
    <5a9>   DW_AT_decl_file   : 4
    <5aa>   DW_AT_decl_line   : 34
    <5ab>   DW_AT_decl_column : 9
    <5ac>   DW_AT_sibling     : <0x5f3>
 <2><5b0>: Abbrev Number: 4 (DW_TAG_member)
    <5b1>   DW_AT_name        : gx
    <5b4>   DW_AT_decl_file   : 4
    <5b4>   DW_AT_decl_line   : 35
    <5b5>   DW_AT_decl_column : 10
    <5b6>   DW_AT_type        : <0x58f>
    <5ba>   DW_AT_data_member_location: 0
 <2><5bb>: Abbrev Number: 4 (DW_TAG_member)
    <5bc>   DW_AT_name        : gy
    <5bf>   DW_AT_decl_file   : 4
    <5bf>   DW_AT_decl_line   : 35
    <5c0>   DW_AT_decl_column : 14
    <5c1>   DW_AT_type        : <0x58f>
    <5c5>   DW_AT_data_member_location: 2
 <2><5c6>: Abbrev Number: 4 (DW_TAG_member)
    <5c7>   DW_AT_name        : gz
    <5ca>   DW_AT_decl_file   : 4
    <5ca>   DW_AT_decl_line   : 35
    <5cb>   DW_AT_decl_column : 18
    <5cc>   DW_AT_type        : <0x58f>
    <5d0>   DW_AT_data_member_location: 4
 <2><5d1>: Abbrev Number: 4 (DW_TAG_member)
    <5d2>   DW_AT_name        : ax
    <5d5>   DW_AT_decl_file   : 4
    <5d5>   DW_AT_decl_line   : 36
    <5d6>   DW_AT_decl_column : 10
    <5d7>   DW_AT_type        : <0x58f>
    <5db>   DW_AT_data_member_location: 6
 <2><5dc>: Abbrev Number: 4 (DW_TAG_member)
    <5dd>   DW_AT_name        : ay
    <5e0>   DW_AT_decl_file   : 4
    <5e0>   DW_AT_decl_line   : 36
    <5e1>   DW_AT_decl_column : 14
    <5e2>   DW_AT_type        : <0x58f>
    <5e6>   DW_AT_data_member_location: 8
 <2><5e7>: Abbrev Number: 4 (DW_TAG_member)
    <5e8>   DW_AT_name        : az
    <5eb>   DW_AT_decl_file   : 4
    <5eb>   DW_AT_decl_line   : 36
    <5ec>   DW_AT_decl_column : 18
    <5ed>   DW_AT_type        : <0x58f>
    <5f1>   DW_AT_data_member_location: 10
 <2><5f2>: Abbrev Number: 0
 <1><5f3>: Abbrev Number: 3 (DW_TAG_typedef)
    <5f4>   DW_AT_name        : (indirect string, offset: 0xa09bb): LSM6DS3_Sample
    <5f8>   DW_AT_decl_file   : 4
    <5f9>   DW_AT_decl_line   : 37
    <5fa>   DW_AT_decl_column : 2
    <5fb>   DW_AT_type        : <0x5a7>
 <1><5ff>: Abbrev Number: 6 (DW_TAG_subprogram)
    <600>   DW_AT_external    : 1
    <600>   DW_AT_name        : (indirect string, offset: 0x3bfaa): I2C1_MultiRead
    <604>   DW_AT_decl_file   : 5
    <604>   DW_AT_decl_line   : 10
    <605>   DW_AT_decl_column : 6
    <605>   DW_AT_prototyped  : 1
    <605>   DW_AT_declaration : 1
    <605>   DW_AT_sibling     : <0x61e>
 <2><609>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <60a>   DW_AT_type        : <0x583>
 <2><60e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <60f>   DW_AT_type        : <0x583>
 <2><613>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <614>   DW_AT_type        : <0x61e>
 <2><618>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <619>   DW_AT_type        : <0x583>
 <2><61d>: Abbrev Number: 0
 <1><61e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <61f>   DW_AT_byte_size   : 4
    <61f>   DW_AT_type        : <0x583>
 <1><623>: Abbrev Number: 7 (DW_TAG_subprogram)
    <624>   DW_AT_external    : 1
    <624>   DW_AT_name        : (indirect string, offset: 0x9e4c5): printf
    <628>   DW_AT_decl_file   : 6
    <629>   DW_AT_decl_line   : 206
    <62a>   DW_AT_decl_column : 5
    <62b>   DW_AT_prototyped  : 1
    <62b>   DW_AT_type        : <0x55d>
    <62f>   DW_AT_declaration : 1
    <62f>   DW_AT_sibling     : <0x63a>
 <2><633>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <634>   DW_AT_type        : <0x57e>
 <2><638>: Abbrev Number: 12 (DW_TAG_unspecified_parameters)
 <2><639>: Abbrev Number: 0
 <1><63a>: Abbrev Number: 6 (DW_TAG_subprogram)
    <63b>   DW_AT_external    : 1
    <63b>   DW_AT_name        : (indirect string, offset: 0x6dc7): I2C1_Write
    <63f>   DW_AT_decl_file   : 5
    <63f>   DW_AT_decl_line   : 12
    <640>   DW_AT_decl_column : 6
    <640>   DW_AT_prototyped  : 1
    <640>   DW_AT_declaration : 1
    <640>   DW_AT_sibling     : <0x654>
 <2><644>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <645>   DW_AT_type        : <0x583>
 <2><649>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <64a>   DW_AT_type        : <0x583>
 <2><64e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <64f>   DW_AT_type        : <0x583>
 <2><653>: Abbrev Number: 0
 <1><654>: Abbrev Number: 7 (DW_TAG_subprogram)
    <655>   DW_AT_external    : 1
    <655>   DW_AT_name        : (indirect string, offset: 0x6dde5): I2C1_Read
    <659>   DW_AT_decl_file   : 5
    <65a>   DW_AT_decl_line   : 11
    <65b>   DW_AT_decl_column : 9
    <65c>   DW_AT_prototyped  : 1
    <65c>   DW_AT_type        : <0x583>
    <660>   DW_AT_declaration : 1
    <660>   DW_AT_sibling     : <0x66f>
 <2><664>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <665>   DW_AT_type        : <0x583>
 <2><669>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <66a>   DW_AT_type        : <0x583>
 <2><66e>: Abbrev Number: 0
 <1><66f>: Abbrev Number: 13 (DW_TAG_subprogram)
    <670>   DW_AT_external    : 1
    <670>   DW_AT_name        : (indirect string, offset: 0x9f0e4): LSM6DS3_GyroAccelRead
    <674>   DW_AT_decl_file   : 1
    <675>   DW_AT_decl_line   : 23
    <676>   DW_AT_decl_column : 6
    <677>   DW_AT_prototyped  : 1
    <677>   DW_AT_low_pc      : 0x8000908
    <67b>   DW_AT_high_pc     : 0x8a
    <67f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <681>   DW_AT_call_all_tail_calls: 1
    <681>   DW_AT_sibling     : <0x6a4>
 <2><685>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <686>   DW_AT_name        : (indirect string, offset: 0x4a1e0): data
    <68a>   DW_AT_decl_file   : 1
    <68b>   DW_AT_decl_line   : 23
    <68c>   DW_AT_decl_column : 44
    <68d>   DW_AT_type        : <0x6a4>
    <691>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><694>: Abbrev Number: 15 (DW_TAG_variable)
    <695>   DW_AT_name        : buf
    <699>   DW_AT_decl_file   : 1
    <69a>   DW_AT_decl_line   : 24
    <69b>   DW_AT_decl_column : 10
    <69c>   DW_AT_type        : <0x6a9>
    <6a0>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><6a3>: Abbrev Number: 0
 <1><6a4>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <6a5>   DW_AT_byte_size   : 4
    <6a5>   DW_AT_type        : <0x5f3>
 <1><6a9>: Abbrev Number: 16 (DW_TAG_array_type)
    <6aa>   DW_AT_type        : <0x583>
    <6ae>   DW_AT_sibling     : <0x6b9>
 <2><6b2>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <6b3>   DW_AT_type        : <0x564>
    <6b7>   DW_AT_upper_bound : 11
 <2><6b8>: Abbrev Number: 0
 <1><6b9>: Abbrev Number: 18 (DW_TAG_subprogram)
    <6ba>   DW_AT_external    : 1
    <6ba>   DW_AT_name        : (indirect string, offset: 0x9f348): LSM6DS3_Init
    <6be>   DW_AT_decl_file   : 1
    <6bf>   DW_AT_decl_line   : 7
    <6c0>   DW_AT_decl_column : 6
    <6c1>   DW_AT_prototyped  : 1
    <6c1>   DW_AT_low_pc      : 0x80008b4
    <6c5>   DW_AT_high_pc     : 0x54
    <6c9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6cb>   DW_AT_call_all_tail_calls: 1
 <2><6cb>: Abbrev Number: 19 (DW_TAG_variable)
    <6cc>   DW_AT_name        : (indirect string, offset: 0xa0164): result
    <6d0>   DW_AT_decl_file   : 1
    <6d1>   DW_AT_decl_line   : 8
    <6d2>   DW_AT_decl_column : 10
    <6d3>   DW_AT_type        : <0x583>
    <6d7>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><6da>: Abbrev Number: 0
 <1><6db>: Abbrev Number: 0
  Compilation Unit @ offset 0x6dc:
   Length:        0x126 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x27b
   Pointer Size:  4
 <0><6e8>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <6e9>   DW_AT_producer    : (indirect string, offset: 0x299ef): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <6ed>   DW_AT_language    : 29	(C11)
    <6ee>   DW_AT_name        : (indirect string, offset: 0xbc754): ../Core/Src/freertos_hooks.c
    <6f2>   DW_AT_comp_dir    : (indirect string, offset: 0x57523): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <6f6>   DW_AT_ranges      : 0x4f
    <6fa>   DW_AT_low_pc      : 0
    <6fe>   DW_AT_stmt_list   : 0xec7
    <702>   DW_AT_macros      : 0x1d1c1
 <1><706>: Abbrev Number: 7 (DW_TAG_base_type)
    <707>   DW_AT_byte_size   : 4
    <708>   DW_AT_encoding    : 5	(signed)
    <709>   DW_AT_name        : int
 <1><70d>: Abbrev Number: 1 (DW_TAG_base_type)
    <70e>   DW_AT_byte_size   : 4
    <70f>   DW_AT_encoding    : 7	(unsigned)
    <710>   DW_AT_name        : (indirect string, offset: 0xc591): unsigned int
 <1><714>: Abbrev Number: 1 (DW_TAG_base_type)
    <715>   DW_AT_byte_size   : 8
    <716>   DW_AT_encoding    : 5	(signed)
    <717>   DW_AT_name        : (indirect string, offset: 0x48957): long long int
 <1><71b>: Abbrev Number: 1 (DW_TAG_base_type)
    <71c>   DW_AT_byte_size   : 8
    <71d>   DW_AT_encoding    : 4	(float)
    <71e>   DW_AT_name        : (indirect string, offset: 0x9e777): long double
 <1><722>: Abbrev Number: 1 (DW_TAG_base_type)
    <723>   DW_AT_byte_size   : 1
    <724>   DW_AT_encoding    : 6	(signed char)
    <725>   DW_AT_name        : (indirect string, offset: 0x4fce6): signed char
 <1><729>: Abbrev Number: 2 (DW_TAG_typedef)
    <72a>   DW_AT_name        : (indirect string, offset: 0x2e54f): __uint8_t
    <72e>   DW_AT_decl_file   : 2
    <72f>   DW_AT_decl_line   : 43
    <730>   DW_AT_decl_column : 24
    <731>   DW_AT_type        : <0x735>
 <1><735>: Abbrev Number: 1 (DW_TAG_base_type)
    <736>   DW_AT_byte_size   : 1
    <737>   DW_AT_encoding    : 8	(unsigned char)
    <738>   DW_AT_name        : (indirect string, offset: 0x98268): unsigned char
 <1><73c>: Abbrev Number: 1 (DW_TAG_base_type)
    <73d>   DW_AT_byte_size   : 2
    <73e>   DW_AT_encoding    : 5	(signed)
    <73f>   DW_AT_name        : (indirect string, offset: 0x7583d): short int
 <1><743>: Abbrev Number: 1 (DW_TAG_base_type)
    <744>   DW_AT_byte_size   : 2
    <745>   DW_AT_encoding    : 7	(unsigned)
    <746>   DW_AT_name        : (indirect string, offset: 0x970a5): short unsigned int
 <1><74a>: Abbrev Number: 1 (DW_TAG_base_type)
    <74b>   DW_AT_byte_size   : 4
    <74c>   DW_AT_encoding    : 5	(signed)
    <74d>   DW_AT_name        : (indirect string, offset: 0xcd5a): long int
 <1><751>: Abbrev Number: 1 (DW_TAG_base_type)
    <752>   DW_AT_byte_size   : 4
    <753>   DW_AT_encoding    : 7	(unsigned)
    <754>   DW_AT_name        : (indirect string, offset: 0x3ccb2): long unsigned int
 <1><758>: Abbrev Number: 1 (DW_TAG_base_type)
    <759>   DW_AT_byte_size   : 8
    <75a>   DW_AT_encoding    : 7	(unsigned)
    <75b>   DW_AT_name        : (indirect string, offset: 0x20f43): long long unsigned int
 <1><75f>: Abbrev Number: 2 (DW_TAG_typedef)
    <760>   DW_AT_name        : (indirect string, offset: 0x2e551): uint8_t
    <764>   DW_AT_decl_file   : 3
    <765>   DW_AT_decl_line   : 24
    <766>   DW_AT_decl_column : 19
    <767>   DW_AT_type        : <0x729>
 <1><76b>: Abbrev Number: 3 (DW_TAG_const_type)
    <76c>   DW_AT_type        : <0x75f>
 <1><770>: Abbrev Number: 2 (DW_TAG_typedef)
    <771>   DW_AT_name        : (indirect string, offset: 0xe23be): TaskHandle_t
    <775>   DW_AT_decl_file   : 4
    <776>   DW_AT_decl_line   : 95
    <777>   DW_AT_decl_column : 46
    <778>   DW_AT_type        : <0x77c>
 <1><77c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <77d>   DW_AT_byte_size   : 4
    <77d>   DW_AT_type        : <0x781>
 <1><781>: Abbrev Number: 8 (DW_TAG_structure_type)
    <782>   DW_AT_name        : (indirect string, offset: 0xe0803): tskTaskControlBlock
    <786>   DW_AT_declaration : 1
 <1><786>: Abbrev Number: 1 (DW_TAG_base_type)
    <787>   DW_AT_byte_size   : 1
    <788>   DW_AT_encoding    : 8	(unsigned char)
    <789>   DW_AT_name        : (indirect string, offset: 0xb9629): char
 <1><78d>: Abbrev Number: 9 (DW_TAG_array_type)
    <78e>   DW_AT_type        : <0x76b>
    <792>   DW_AT_sibling     : <0x79d>
 <2><796>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <797>   DW_AT_type        : <0x70d>
    <79b>   DW_AT_upper_bound : 6
 <2><79c>: Abbrev Number: 0
 <1><79d>: Abbrev Number: 3 (DW_TAG_const_type)
    <79e>   DW_AT_type        : <0x78d>
 <1><7a2>: Abbrev Number: 11 (DW_TAG_variable)
    <7a3>   DW_AT_name        : (indirect string, offset: 0xb077f): CHANNEL_OFFSET_TAB
    <7a7>   DW_AT_decl_file   : 5
    <7a8>   DW_AT_decl_line   : 49
    <7a9>   DW_AT_decl_column : 22
    <7aa>   DW_AT_type        : <0x79d>
    <7ae>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><7b4>: Abbrev Number: 12 (DW_TAG_subprogram)
    <7b5>   DW_AT_external    : 1
    <7b5>   DW_AT_name        : (indirect string, offset: 0xba615): HAL_IncTick
    <7b9>   DW_AT_decl_file   : 6
    <7ba>   DW_AT_decl_line   : 651
    <7bc>   DW_AT_decl_column : 20
    <7bd>   DW_AT_prototyped  : 1
    <7bd>   DW_AT_declaration : 1
 <1><7bd>: Abbrev Number: 13 (DW_TAG_subprogram)
    <7be>   DW_AT_external    : 1
    <7be>   DW_AT_name        : (indirect string, offset: 0xc17ff): vApplicationTickHook
    <7c2>   DW_AT_decl_file   : 1
    <7c3>   DW_AT_decl_line   : 11
    <7c4>   DW_AT_decl_column : 6
    <7c5>   DW_AT_prototyped  : 1
    <7c5>   DW_AT_low_pc      : 0x80009a0
    <7c9>   DW_AT_high_pc     : 0xc
    <7cd>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7cf>   DW_AT_call_all_tail_calls: 1
 <1><7cf>: Abbrev Number: 14 (DW_TAG_subprogram)
    <7d0>   DW_AT_external    : 1
    <7d0>   DW_AT_name        : (indirect string, offset: 0xbc245): vApplicationStackOverflowHook
    <7d4>   DW_AT_decl_file   : 1
    <7d5>   DW_AT_decl_line   : 5
    <7d6>   DW_AT_decl_column : 6
    <7d7>   DW_AT_prototyped  : 1
    <7d7>   DW_AT_low_pc      : 0x8000992
    <7db>   DW_AT_high_pc     : 0xe
    <7df>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7e1>   DW_AT_call_all_calls: 1
    <7e1>   DW_AT_sibling     : <0x800>
 <2><7e5>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7e6>   DW_AT_name        : (indirect string, offset: 0xd6f1b): xTask
    <7ea>   DW_AT_decl_file   : 1
    <7ea>   DW_AT_decl_line   : 5
    <7ea>   DW_AT_decl_column : 49
    <7eb>   DW_AT_type        : <0x770>
    <7ef>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><7f2>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7f3>   DW_AT_name        : (indirect string, offset: 0xbac72): pcTaskName
    <7f7>   DW_AT_decl_file   : 1
    <7f7>   DW_AT_decl_line   : 5
    <7f7>   DW_AT_decl_column : 62
    <7f8>   DW_AT_type        : <0x800>
    <7fc>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><7ff>: Abbrev Number: 0
 <1><800>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <801>   DW_AT_byte_size   : 4
    <801>   DW_AT_type        : <0x786>
 <1><805>: Abbrev Number: 0
  Compilation Unit @ offset 0x806:
   Length:        0x80b (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x34d
   Pointer Size:  4
 <0><812>: Abbrev Number: 23 (DW_TAG_compile_unit)
    <813>   DW_AT_producer    : (indirect string, offset: 0x299ef): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <817>   DW_AT_language    : 29	(C11)
    <818>   DW_AT_name        : (indirect string, offset: 0xec5df): ../Core/Src/main.c
    <81c>   DW_AT_comp_dir    : (indirect string, offset: 0x57523): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <820>   DW_AT_ranges      : 0x68
    <824>   DW_AT_low_pc      : 0
    <828>   DW_AT_stmt_list   : 0x1688
    <82c>   DW_AT_macros      : 0x25cfd
 <1><830>: Abbrev Number: 5 (DW_TAG_base_type)
    <831>   DW_AT_byte_size   : 1
    <832>   DW_AT_encoding    : 6	(signed char)
    <833>   DW_AT_name        : (indirect string, offset: 0x4fce6): signed char
 <1><837>: Abbrev Number: 3 (DW_TAG_typedef)
    <838>   DW_AT_name        : (indirect string, offset: 0x2e54f): __uint8_t
    <83c>   DW_AT_decl_file   : 3
    <83d>   DW_AT_decl_line   : 43
    <83e>   DW_AT_decl_column : 24
    <83f>   DW_AT_type        : <0x843>
 <1><843>: Abbrev Number: 5 (DW_TAG_base_type)
    <844>   DW_AT_byte_size   : 1
    <845>   DW_AT_encoding    : 8	(unsigned char)
    <846>   DW_AT_name        : (indirect string, offset: 0x98268): unsigned char
 <1><84a>: Abbrev Number: 3 (DW_TAG_typedef)
    <84b>   DW_AT_name        : (indirect string, offset: 0x9ed24): __int16_t
    <84f>   DW_AT_decl_file   : 3
    <850>   DW_AT_decl_line   : 55
    <851>   DW_AT_decl_column : 24
    <852>   DW_AT_type        : <0x856>
 <1><856>: Abbrev Number: 5 (DW_TAG_base_type)
    <857>   DW_AT_byte_size   : 2
    <858>   DW_AT_encoding    : 5	(signed)
    <859>   DW_AT_name        : (indirect string, offset: 0x7583d): short int
 <1><85d>: Abbrev Number: 5 (DW_TAG_base_type)
    <85e>   DW_AT_byte_size   : 2
    <85f>   DW_AT_encoding    : 7	(unsigned)
    <860>   DW_AT_name        : (indirect string, offset: 0x970a5): short unsigned int
 <1><864>: Abbrev Number: 5 (DW_TAG_base_type)
    <865>   DW_AT_byte_size   : 4
    <866>   DW_AT_encoding    : 5	(signed)
    <867>   DW_AT_name        : (indirect string, offset: 0xcd5a): long int
 <1><86b>: Abbrev Number: 3 (DW_TAG_typedef)
    <86c>   DW_AT_name        : (indirect string, offset: 0x652d9): __uint32_t
    <870>   DW_AT_decl_file   : 3
    <871>   DW_AT_decl_line   : 79
    <872>   DW_AT_decl_column : 25
    <873>   DW_AT_type        : <0x877>
 <1><877>: Abbrev Number: 5 (DW_TAG_base_type)
    <878>   DW_AT_byte_size   : 4
    <879>   DW_AT_encoding    : 7	(unsigned)
    <87a>   DW_AT_name        : (indirect string, offset: 0x3ccb2): long unsigned int
 <1><87e>: Abbrev Number: 5 (DW_TAG_base_type)
    <87f>   DW_AT_byte_size   : 8
    <880>   DW_AT_encoding    : 5	(signed)
    <881>   DW_AT_name        : (indirect string, offset: 0x48957): long long int
 <1><885>: Abbrev Number: 3 (DW_TAG_typedef)
    <886>   DW_AT_name        : (indirect string, offset: 0xec48d): __uint64_t
    <88a>   DW_AT_decl_file   : 3
    <88b>   DW_AT_decl_line   : 105
    <88c>   DW_AT_decl_column : 25
    <88d>   DW_AT_type        : <0x891>
 <1><891>: Abbrev Number: 5 (DW_TAG_base_type)
    <892>   DW_AT_byte_size   : 8
    <893>   DW_AT_encoding    : 7	(unsigned)
    <894>   DW_AT_name        : (indirect string, offset: 0x20f43): long long unsigned int
 <1><898>: Abbrev Number: 24 (DW_TAG_base_type)
    <899>   DW_AT_byte_size   : 4
    <89a>   DW_AT_encoding    : 5	(signed)
    <89b>   DW_AT_name        : int
 <1><89f>: Abbrev Number: 5 (DW_TAG_base_type)
    <8a0>   DW_AT_byte_size   : 4
    <8a1>   DW_AT_encoding    : 7	(unsigned)
    <8a2>   DW_AT_name        : (indirect string, offset: 0xc591): unsigned int
 <1><8a6>: Abbrev Number: 5 (DW_TAG_base_type)
    <8a7>   DW_AT_byte_size   : 8
    <8a8>   DW_AT_encoding    : 4	(float)
    <8a9>   DW_AT_name        : (indirect string, offset: 0x9e777): long double
 <1><8ad>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <8ae>   DW_AT_byte_size   : 4
 <1><8af>: Abbrev Number: 6 (DW_TAG_const_type)
    <8b0>   DW_AT_type        : <0x8ad>
 <1><8b4>: Abbrev Number: 5 (DW_TAG_base_type)
    <8b5>   DW_AT_byte_size   : 1
    <8b6>   DW_AT_encoding    : 8	(unsigned char)
    <8b7>   DW_AT_name        : (indirect string, offset: 0xb9629): char
 <1><8bb>: Abbrev Number: 6 (DW_TAG_const_type)
    <8bc>   DW_AT_type        : <0x8b4>
 <1><8c0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <8c1>   DW_AT_byte_size   : 4
    <8c1>   DW_AT_type        : <0x8bb>
 <1><8c5>: Abbrev Number: 6 (DW_TAG_const_type)
    <8c6>   DW_AT_type        : <0x8c0>
 <1><8ca>: Abbrev Number: 3 (DW_TAG_typedef)
    <8cb>   DW_AT_name        : (indirect string, offset: 0x2e551): uint8_t
    <8cf>   DW_AT_decl_file   : 4
    <8d0>   DW_AT_decl_line   : 24
    <8d1>   DW_AT_decl_column : 19
    <8d2>   DW_AT_type        : <0x837>
 <1><8d6>: Abbrev Number: 6 (DW_TAG_const_type)
    <8d7>   DW_AT_type        : <0x8ca>
 <1><8db>: Abbrev Number: 3 (DW_TAG_typedef)
    <8dc>   DW_AT_name        : (indirect string, offset: 0x9ed26): int16_t
    <8e0>   DW_AT_decl_file   : 4
    <8e1>   DW_AT_decl_line   : 32
    <8e2>   DW_AT_decl_column : 19
    <8e3>   DW_AT_type        : <0x84a>
 <1><8e7>: Abbrev Number: 3 (DW_TAG_typedef)
    <8e8>   DW_AT_name        : (indirect string, offset: 0xd7470): uint32_t
    <8ec>   DW_AT_decl_file   : 4
    <8ed>   DW_AT_decl_line   : 48
    <8ee>   DW_AT_decl_column : 20
    <8ef>   DW_AT_type        : <0x86b>
 <1><8f3>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <8f4>   DW_AT_type        : <0x8e7>
 <1><8f8>: Abbrev Number: 3 (DW_TAG_typedef)
    <8f9>   DW_AT_name        : (indirect string, offset: 0xec48f): uint64_t
    <8fd>   DW_AT_decl_file   : 4
    <8fe>   DW_AT_decl_line   : 60
    <8ff>   DW_AT_decl_column : 20
    <900>   DW_AT_type        : <0x885>
 <1><904>: Abbrev Number: 16 (DW_TAG_structure_type)
    <905>   DW_AT_byte_size   : 48
    <906>   DW_AT_decl_file   : 5
    <906>   DW_AT_decl_line   : 531
    <908>   DW_AT_decl_column : 9
    <908>   DW_AT_sibling     : <0x991>
 <2><90c>: Abbrev Number: 1 (DW_TAG_member)
    <90d>   DW_AT_name        : (indirect string, offset: 0x10f4): MODER
    <911>   DW_AT_decl_file   : 5
    <911>   DW_AT_decl_line   : 533
    <913>   DW_AT_decl_column : 17
    <913>   DW_AT_type        : <0x8f3>
    <917>   DW_AT_data_member_location: 0
 <2><918>: Abbrev Number: 1 (DW_TAG_member)
    <919>   DW_AT_name        : (indirect string, offset: 0x7a54b): OTYPER
    <91d>   DW_AT_decl_file   : 5
    <91d>   DW_AT_decl_line   : 534
    <91f>   DW_AT_decl_column : 17
    <91f>   DW_AT_type        : <0x8f3>
    <923>   DW_AT_data_member_location: 4
 <2><924>: Abbrev Number: 1 (DW_TAG_member)
    <925>   DW_AT_name        : (indirect string, offset: 0x89434): OSPEEDR
    <929>   DW_AT_decl_file   : 5
    <929>   DW_AT_decl_line   : 535
    <92b>   DW_AT_decl_column : 17
    <92b>   DW_AT_type        : <0x8f3>
    <92f>   DW_AT_data_member_location: 8
 <2><930>: Abbrev Number: 1 (DW_TAG_member)
    <931>   DW_AT_name        : (indirect string, offset: 0x66ac3): PUPDR
    <935>   DW_AT_decl_file   : 5
    <935>   DW_AT_decl_line   : 536
    <937>   DW_AT_decl_column : 17
    <937>   DW_AT_type        : <0x8f3>
    <93b>   DW_AT_data_member_location: 12
 <2><93c>: Abbrev Number: 10 (DW_TAG_member)
    <93d>   DW_AT_name        : IDR
    <941>   DW_AT_decl_file   : 5
    <941>   DW_AT_decl_line   : 537
    <943>   DW_AT_decl_column : 17
    <943>   DW_AT_type        : <0x8f3>
    <947>   DW_AT_data_member_location: 16
 <2><948>: Abbrev Number: 10 (DW_TAG_member)
    <949>   DW_AT_name        : ODR
    <94d>   DW_AT_decl_file   : 5
    <94d>   DW_AT_decl_line   : 538
    <94f>   DW_AT_decl_column : 17
    <94f>   DW_AT_type        : <0x8f3>
    <953>   DW_AT_data_member_location: 20
 <2><954>: Abbrev Number: 1 (DW_TAG_member)
    <955>   DW_AT_name        : (indirect string, offset: 0x239c6): BSRR
    <959>   DW_AT_decl_file   : 5
    <959>   DW_AT_decl_line   : 539
    <95b>   DW_AT_decl_column : 17
    <95b>   DW_AT_type        : <0x8f3>
    <95f>   DW_AT_data_member_location: 24
 <2><960>: Abbrev Number: 1 (DW_TAG_member)
    <961>   DW_AT_name        : (indirect string, offset: 0x877c4): LCKR
    <965>   DW_AT_decl_file   : 5
    <965>   DW_AT_decl_line   : 540
    <967>   DW_AT_decl_column : 17
    <967>   DW_AT_type        : <0x8f3>
    <96b>   DW_AT_data_member_location: 28
 <2><96c>: Abbrev Number: 10 (DW_TAG_member)
    <96d>   DW_AT_name        : AFR
    <971>   DW_AT_decl_file   : 5
    <971>   DW_AT_decl_line   : 541
    <973>   DW_AT_decl_column : 17
    <973>   DW_AT_type        : <0x9a1>
    <977>   DW_AT_data_member_location: 32
 <2><978>: Abbrev Number: 10 (DW_TAG_member)
    <979>   DW_AT_name        : BRR
    <97d>   DW_AT_decl_file   : 5
    <97d>   DW_AT_decl_line   : 542
    <97f>   DW_AT_decl_column : 17
    <97f>   DW_AT_type        : <0x8f3>
    <983>   DW_AT_data_member_location: 40
 <2><984>: Abbrev Number: 1 (DW_TAG_member)
    <985>   DW_AT_name        : (indirect string, offset: 0x1b92): ASCR
    <989>   DW_AT_decl_file   : 5
    <989>   DW_AT_decl_line   : 543
    <98b>   DW_AT_decl_column : 17
    <98b>   DW_AT_type        : <0x8f3>
    <98f>   DW_AT_data_member_location: 44
 <2><990>: Abbrev Number: 0
 <1><991>: Abbrev Number: 17 (DW_TAG_array_type)
    <992>   DW_AT_type        : <0x8f3>
    <996>   DW_AT_sibling     : <0x9a1>
 <2><99a>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <99b>   DW_AT_type        : <0x89f>
    <99f>   DW_AT_upper_bound : 1
 <2><9a0>: Abbrev Number: 0
 <1><9a1>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <9a2>   DW_AT_type        : <0x991>
 <1><9a6>: Abbrev Number: 19 (DW_TAG_typedef)
    <9a7>   DW_AT_name        : (indirect string, offset: 0x991b6): GPIO_TypeDef
    <9ab>   DW_AT_decl_file   : 5
    <9ab>   DW_AT_decl_line   : 545
    <9ad>   DW_AT_decl_column : 3
    <9ad>   DW_AT_type        : <0x904>
 <1><9b1>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9b2>   DW_AT_byte_size   : 152
    <9b3>   DW_AT_decl_file   : 5
    <9b3>   DW_AT_decl_line   : 685
    <9b5>   DW_AT_decl_column : 9
    <9b5>   DW_AT_sibling     : <0xb81>
 <2><9b9>: Abbrev Number: 10 (DW_TAG_member)
    <9ba>   DW_AT_name        : CR
    <9bd>   DW_AT_decl_file   : 5
    <9bd>   DW_AT_decl_line   : 687
    <9bf>   DW_AT_decl_column : 17
    <9bf>   DW_AT_type        : <0x8f3>
    <9c3>   DW_AT_data_member_location: 0
 <2><9c4>: Abbrev Number: 1 (DW_TAG_member)
    <9c5>   DW_AT_name        : (indirect string, offset: 0x6af01): ICSCR
    <9c9>   DW_AT_decl_file   : 5
    <9c9>   DW_AT_decl_line   : 688
    <9cb>   DW_AT_decl_column : 17
    <9cb>   DW_AT_type        : <0x8f3>
    <9cf>   DW_AT_data_member_location: 4
 <2><9d0>: Abbrev Number: 1 (DW_TAG_member)
    <9d1>   DW_AT_name        : (indirect string, offset: 0x34674): CFGR
    <9d5>   DW_AT_decl_file   : 5
    <9d5>   DW_AT_decl_line   : 689
    <9d7>   DW_AT_decl_column : 17
    <9d7>   DW_AT_type        : <0x8f3>
    <9db>   DW_AT_data_member_location: 8
 <2><9dc>: Abbrev Number: 1 (DW_TAG_member)
    <9dd>   DW_AT_name        : (indirect string, offset: 0x6f093): PLLCFGR
    <9e1>   DW_AT_decl_file   : 5
    <9e1>   DW_AT_decl_line   : 690
    <9e3>   DW_AT_decl_column : 17
    <9e3>   DW_AT_type        : <0x8f3>
    <9e7>   DW_AT_data_member_location: 12
 <2><9e8>: Abbrev Number: 1 (DW_TAG_member)
    <9e9>   DW_AT_name        : (indirect string, offset: 0x3466d): PLLSAI1CFGR
    <9ed>   DW_AT_decl_file   : 5
    <9ed>   DW_AT_decl_line   : 691
    <9ef>   DW_AT_decl_column : 17
    <9ef>   DW_AT_type        : <0x8f3>
    <9f3>   DW_AT_data_member_location: 16
 <2><9f4>: Abbrev Number: 1 (DW_TAG_member)
    <9f5>   DW_AT_name        : (indirect string, offset: 0x6750c): PLLSAI2CFGR
    <9f9>   DW_AT_decl_file   : 5
    <9f9>   DW_AT_decl_line   : 692
    <9fb>   DW_AT_decl_column : 17
    <9fb>   DW_AT_type        : <0x8f3>
    <9ff>   DW_AT_data_member_location: 20
 <2><a00>: Abbrev Number: 1 (DW_TAG_member)
    <a01>   DW_AT_name        : (indirect string, offset: 0x1e2c): CIER
    <a05>   DW_AT_decl_file   : 5
    <a05>   DW_AT_decl_line   : 693
    <a07>   DW_AT_decl_column : 17
    <a07>   DW_AT_type        : <0x8f3>
    <a0b>   DW_AT_data_member_location: 24
 <2><a0c>: Abbrev Number: 1 (DW_TAG_member)
    <a0d>   DW_AT_name        : (indirect string, offset: 0x21bc): CIFR
    <a11>   DW_AT_decl_file   : 5
    <a11>   DW_AT_decl_line   : 694
    <a13>   DW_AT_decl_column : 17
    <a13>   DW_AT_type        : <0x8f3>
    <a17>   DW_AT_data_member_location: 28
 <2><a18>: Abbrev Number: 1 (DW_TAG_member)
    <a19>   DW_AT_name        : (indirect string, offset: 0x14c7): CICR
    <a1d>   DW_AT_decl_file   : 5
    <a1d>   DW_AT_decl_line   : 695
    <a1f>   DW_AT_decl_column : 17
    <a1f>   DW_AT_type        : <0x8f3>
    <a23>   DW_AT_data_member_location: 32
 <2><a24>: Abbrev Number: 1 (DW_TAG_member)
    <a25>   DW_AT_name        : (indirect string, offset: 0x94934): RESERVED0
    <a29>   DW_AT_decl_file   : 5
    <a29>   DW_AT_decl_line   : 696
    <a2b>   DW_AT_decl_column : 17
    <a2b>   DW_AT_type        : <0x8e7>
    <a2f>   DW_AT_data_member_location: 36
 <2><a30>: Abbrev Number: 1 (DW_TAG_member)
    <a31>   DW_AT_name        : (indirect string, offset: 0x7df1e): AHB1RSTR
    <a35>   DW_AT_decl_file   : 5
    <a35>   DW_AT_decl_line   : 697
    <a37>   DW_AT_decl_column : 17
    <a37>   DW_AT_type        : <0x8f3>
    <a3b>   DW_AT_data_member_location: 40
 <2><a3c>: Abbrev Number: 1 (DW_TAG_member)
    <a3d>   DW_AT_name        : (indirect string, offset: 0x1d1de): AHB2RSTR
    <a41>   DW_AT_decl_file   : 5
    <a41>   DW_AT_decl_line   : 698
    <a43>   DW_AT_decl_column : 17
    <a43>   DW_AT_type        : <0x8f3>
    <a47>   DW_AT_data_member_location: 44
 <2><a48>: Abbrev Number: 1 (DW_TAG_member)
    <a49>   DW_AT_name        : (indirect string, offset: 0x342f4): AHB3RSTR
    <a4d>   DW_AT_decl_file   : 5
    <a4d>   DW_AT_decl_line   : 699
    <a4f>   DW_AT_decl_column : 17
    <a4f>   DW_AT_type        : <0x8f3>
    <a53>   DW_AT_data_member_location: 48
 <2><a54>: Abbrev Number: 1 (DW_TAG_member)
    <a55>   DW_AT_name        : (indirect string, offset: 0x9493e): RESERVED1
    <a59>   DW_AT_decl_file   : 5
    <a59>   DW_AT_decl_line   : 700
    <a5b>   DW_AT_decl_column : 17
    <a5b>   DW_AT_type        : <0x8e7>
    <a5f>   DW_AT_data_member_location: 52
 <2><a60>: Abbrev Number: 1 (DW_TAG_member)
    <a61>   DW_AT_name        : (indirect string, offset: 0x2025f): APB1RSTR1
    <a65>   DW_AT_decl_file   : 5
    <a65>   DW_AT_decl_line   : 701
    <a67>   DW_AT_decl_column : 17
    <a67>   DW_AT_type        : <0x8f3>
    <a6b>   DW_AT_data_member_location: 56
 <2><a6c>: Abbrev Number: 1 (DW_TAG_member)
    <a6d>   DW_AT_name        : (indirect string, offset: 0x20269): APB1RSTR2
    <a71>   DW_AT_decl_file   : 5
    <a71>   DW_AT_decl_line   : 702
    <a73>   DW_AT_decl_column : 17
    <a73>   DW_AT_type        : <0x8f3>
    <a77>   DW_AT_data_member_location: 60
 <2><a78>: Abbrev Number: 1 (DW_TAG_member)
    <a79>   DW_AT_name        : (indirect string, offset: 0x452d5): APB2RSTR
    <a7d>   DW_AT_decl_file   : 5
    <a7d>   DW_AT_decl_line   : 703
    <a7f>   DW_AT_decl_column : 17
    <a7f>   DW_AT_type        : <0x8f3>
    <a83>   DW_AT_data_member_location: 64
 <2><a84>: Abbrev Number: 1 (DW_TAG_member)
    <a85>   DW_AT_name        : (indirect string, offset: 0x94948): RESERVED2
    <a89>   DW_AT_decl_file   : 5
    <a89>   DW_AT_decl_line   : 704
    <a8b>   DW_AT_decl_column : 17
    <a8b>   DW_AT_type        : <0x8e7>
    <a8f>   DW_AT_data_member_location: 68
 <2><a90>: Abbrev Number: 1 (DW_TAG_member)
    <a91>   DW_AT_name        : (indirect string, offset: 0xc557): AHB1ENR
    <a95>   DW_AT_decl_file   : 5
    <a95>   DW_AT_decl_line   : 705
    <a97>   DW_AT_decl_column : 17
    <a97>   DW_AT_type        : <0x8f3>
    <a9b>   DW_AT_data_member_location: 72
 <2><a9c>: Abbrev Number: 1 (DW_TAG_member)
    <a9d>   DW_AT_name        : (indirect string, offset: 0x2a2be): AHB2ENR
    <aa1>   DW_AT_decl_file   : 5
    <aa1>   DW_AT_decl_line   : 706
    <aa3>   DW_AT_decl_column : 17
    <aa3>   DW_AT_type        : <0x8f3>
    <aa7>   DW_AT_data_member_location: 76
 <2><aa8>: Abbrev Number: 1 (DW_TAG_member)
    <aa9>   DW_AT_name        : (indirect string, offset: 0x477be): AHB3ENR
    <aad>   DW_AT_decl_file   : 5
    <aad>   DW_AT_decl_line   : 707
    <aaf>   DW_AT_decl_column : 17
    <aaf>   DW_AT_type        : <0x8f3>
    <ab3>   DW_AT_data_member_location: 80
 <2><ab4>: Abbrev Number: 1 (DW_TAG_member)
    <ab5>   DW_AT_name        : (indirect string, offset: 0x94952): RESERVED3
    <ab9>   DW_AT_decl_file   : 5
    <ab9>   DW_AT_decl_line   : 708
    <abb>   DW_AT_decl_column : 17
    <abb>   DW_AT_type        : <0x8e7>
    <abf>   DW_AT_data_member_location: 84
 <2><ac0>: Abbrev Number: 1 (DW_TAG_member)
    <ac1>   DW_AT_name        : (indirect string, offset: 0x5148): APB1ENR1
    <ac5>   DW_AT_decl_file   : 5
    <ac5>   DW_AT_decl_line   : 709
    <ac7>   DW_AT_decl_column : 17
    <ac7>   DW_AT_type        : <0x8f3>
    <acb>   DW_AT_data_member_location: 88
 <2><acc>: Abbrev Number: 1 (DW_TAG_member)
    <acd>   DW_AT_name        : (indirect string, offset: 0x5151): APB1ENR2
    <ad1>   DW_AT_decl_file   : 5
    <ad1>   DW_AT_decl_line   : 710
    <ad3>   DW_AT_decl_column : 17
    <ad3>   DW_AT_type        : <0x8f3>
    <ad7>   DW_AT_data_member_location: 92
 <2><ad8>: Abbrev Number: 1 (DW_TAG_member)
    <ad9>   DW_AT_name        : (indirect string, offset: 0x12839): APB2ENR
    <add>   DW_AT_decl_file   : 5
    <add>   DW_AT_decl_line   : 711
    <adf>   DW_AT_decl_column : 17
    <adf>   DW_AT_type        : <0x8f3>
    <ae3>   DW_AT_data_member_location: 96
 <2><ae4>: Abbrev Number: 1 (DW_TAG_member)
    <ae5>   DW_AT_name        : (indirect string, offset: 0x58712): RESERVED4
    <ae9>   DW_AT_decl_file   : 5
    <ae9>   DW_AT_decl_line   : 712
    <aeb>   DW_AT_decl_column : 17
    <aeb>   DW_AT_type        : <0x8e7>
    <aef>   DW_AT_data_member_location: 100
 <2><af0>: Abbrev Number: 1 (DW_TAG_member)
    <af1>   DW_AT_name        : (indirect string, offset: 0x4921d): AHB1SMENR
    <af5>   DW_AT_decl_file   : 5
    <af5>   DW_AT_decl_line   : 713
    <af7>   DW_AT_decl_column : 17
    <af7>   DW_AT_type        : <0x8f3>
    <afb>   DW_AT_data_member_location: 104
 <2><afc>: Abbrev Number: 1 (DW_TAG_member)
    <afd>   DW_AT_name        : (indirect string, offset: 0x908da): AHB2SMENR
    <b01>   DW_AT_decl_file   : 5
    <b01>   DW_AT_decl_line   : 714
    <b03>   DW_AT_decl_column : 17
    <b03>   DW_AT_type        : <0x8f3>
    <b07>   DW_AT_data_member_location: 108
 <2><b08>: Abbrev Number: 1 (DW_TAG_member)
    <b09>   DW_AT_name        : (indirect string, offset: 0x3a543): AHB3SMENR
    <b0d>   DW_AT_decl_file   : 5
    <b0d>   DW_AT_decl_line   : 715
    <b0f>   DW_AT_decl_column : 17
    <b0f>   DW_AT_type        : <0x8f3>
    <b13>   DW_AT_data_member_location: 112
 <2><b14>: Abbrev Number: 1 (DW_TAG_member)
    <b15>   DW_AT_name        : (indirect string, offset: 0x94980): RESERVED5
    <b19>   DW_AT_decl_file   : 5
    <b19>   DW_AT_decl_line   : 716
    <b1b>   DW_AT_decl_column : 17
    <b1b>   DW_AT_type        : <0x8e7>
    <b1f>   DW_AT_data_member_location: 116
 <2><b20>: Abbrev Number: 1 (DW_TAG_member)
    <b21>   DW_AT_name        : (indirect string, offset: 0x59da): APB1SMENR1
    <b25>   DW_AT_decl_file   : 5
    <b25>   DW_AT_decl_line   : 717
    <b27>   DW_AT_decl_column : 17
    <b27>   DW_AT_type        : <0x8f3>
    <b2b>   DW_AT_data_member_location: 120
 <2><b2c>: Abbrev Number: 1 (DW_TAG_member)
    <b2d>   DW_AT_name        : (indirect string, offset: 0x59e5): APB1SMENR2
    <b31>   DW_AT_decl_file   : 5
    <b31>   DW_AT_decl_line   : 718
    <b33>   DW_AT_decl_column : 17
    <b33>   DW_AT_type        : <0x8f3>
    <b37>   DW_AT_data_member_location: 124
 <2><b38>: Abbrev Number: 1 (DW_TAG_member)
    <b39>   DW_AT_name        : (indirect string, offset: 0x7f70a): APB2SMENR
    <b3d>   DW_AT_decl_file   : 5
    <b3d>   DW_AT_decl_line   : 719
    <b3f>   DW_AT_decl_column : 17
    <b3f>   DW_AT_type        : <0x8f3>
    <b43>   DW_AT_data_member_location: 128
 <2><b44>: Abbrev Number: 1 (DW_TAG_member)
    <b45>   DW_AT_name        : (indirect string, offset: 0x9498a): RESERVED6
    <b49>   DW_AT_decl_file   : 5
    <b49>   DW_AT_decl_line   : 720
    <b4b>   DW_AT_decl_column : 17
    <b4b>   DW_AT_type        : <0x8e7>
    <b4f>   DW_AT_data_member_location: 132
 <2><b50>: Abbrev Number: 1 (DW_TAG_member)
    <b51>   DW_AT_name        : (indirect string, offset: 0x30a10): CCIPR
    <b55>   DW_AT_decl_file   : 5
    <b55>   DW_AT_decl_line   : 721
    <b57>   DW_AT_decl_column : 17
    <b57>   DW_AT_type        : <0x8f3>
    <b5b>   DW_AT_data_member_location: 136
 <2><b5c>: Abbrev Number: 1 (DW_TAG_member)
    <b5d>   DW_AT_name        : (indirect string, offset: 0x94994): RESERVED7
    <b61>   DW_AT_decl_file   : 5
    <b61>   DW_AT_decl_line   : 722
    <b63>   DW_AT_decl_column : 17
    <b63>   DW_AT_type        : <0x8e7>
    <b67>   DW_AT_data_member_location: 140
 <2><b68>: Abbrev Number: 1 (DW_TAG_member)
    <b69>   DW_AT_name        : (indirect string, offset: 0x2950e): BDCR
    <b6d>   DW_AT_decl_file   : 5
    <b6d>   DW_AT_decl_line   : 723
    <b6f>   DW_AT_decl_column : 17
    <b6f>   DW_AT_type        : <0x8f3>
    <b73>   DW_AT_data_member_location: 144
 <2><b74>: Abbrev Number: 10 (DW_TAG_member)
    <b75>   DW_AT_name        : CSR
    <b79>   DW_AT_decl_file   : 5
    <b79>   DW_AT_decl_line   : 724
    <b7b>   DW_AT_decl_column : 17
    <b7b>   DW_AT_type        : <0x8f3>
    <b7f>   DW_AT_data_member_location: 148
 <2><b80>: Abbrev Number: 0
 <1><b81>: Abbrev Number: 19 (DW_TAG_typedef)
    <b82>   DW_AT_name        : (indirect string, offset: 0x49a7b): RCC_TypeDef
    <b86>   DW_AT_decl_file   : 5
    <b86>   DW_AT_decl_line   : 725
    <b88>   DW_AT_decl_column : 3
    <b88>   DW_AT_type        : <0x9b1>
 <1><b8c>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8d>   DW_AT_name        : (indirect string, offset: 0xc4b58): TaskFunction_t
    <b91>   DW_AT_decl_file   : 6
    <b92>   DW_AT_decl_line   : 36
    <b93>   DW_AT_decl_column : 17
    <b94>   DW_AT_type        : <0xb98>
 <1><b98>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b99>   DW_AT_byte_size   : 4
    <b99>   DW_AT_type        : <0xb9d>
 <1><b9d>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <b9e>   DW_AT_prototyped  : 1
    <b9e>   DW_AT_sibling     : <0xba8>
 <2><ba2>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <ba3>   DW_AT_type        : <0x8ad>
 <2><ba7>: Abbrev Number: 0
 <1><ba8>: Abbrev Number: 3 (DW_TAG_typedef)
    <ba9>   DW_AT_name        : (indirect string, offset: 0xe5e4b): StackType_t
    <bad>   DW_AT_decl_file   : 7
    <bae>   DW_AT_decl_line   : 58
    <baf>   DW_AT_decl_column : 26
    <bb0>   DW_AT_type        : <0x8e7>
 <1><bb4>: Abbrev Number: 6 (DW_TAG_const_type)
    <bb5>   DW_AT_type        : <0xba8>
 <1><bb9>: Abbrev Number: 3 (DW_TAG_typedef)
    <bba>   DW_AT_name        : (indirect string, offset: 0xec375): BaseType_t
    <bbe>   DW_AT_decl_file   : 7
    <bbf>   DW_AT_decl_line   : 59
    <bc0>   DW_AT_decl_column : 26
    <bc1>   DW_AT_type        : <0x864>
 <1><bc5>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc6>   DW_AT_name        : (indirect string, offset: 0xec374): UBaseType_t
    <bca>   DW_AT_decl_file   : 7
    <bcb>   DW_AT_decl_line   : 60
    <bcc>   DW_AT_decl_column : 26
    <bcd>   DW_AT_type        : <0x877>
 <1><bd1>: Abbrev Number: 3 (DW_TAG_typedef)
    <bd2>   DW_AT_name        : (indirect string, offset: 0xca947): TickType_t
    <bd6>   DW_AT_decl_file   : 7
    <bd7>   DW_AT_decl_line   : 66
    <bd8>   DW_AT_decl_column : 26
    <bd9>   DW_AT_type        : <0x8e7>
 <1><bdd>: Abbrev Number: 6 (DW_TAG_const_type)
    <bde>   DW_AT_type        : <0xbd1>
 <1><be2>: Abbrev Number: 3 (DW_TAG_typedef)
    <be3>   DW_AT_name        : (indirect string, offset: 0xe23be): TaskHandle_t
    <be7>   DW_AT_decl_file   : 8
    <be8>   DW_AT_decl_line   : 95
    <be9>   DW_AT_decl_column : 46
    <bea>   DW_AT_type        : <0xbee>
 <1><bee>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <bef>   DW_AT_byte_size   : 4
    <bef>   DW_AT_type        : <0xbf3>
 <1><bf3>: Abbrev Number: 27 (DW_TAG_structure_type)
    <bf4>   DW_AT_name        : (indirect string, offset: 0xe0803): tskTaskControlBlock
    <bf8>   DW_AT_declaration : 1
 <1><bf8>: Abbrev Number: 11 (DW_TAG_structure_type)
    <bf9>   DW_AT_byte_size   : 12
    <bfa>   DW_AT_decl_file   : 9
    <bfb>   DW_AT_decl_line   : 34
    <bfc>   DW_AT_decl_column : 9
    <bfc>   DW_AT_sibling     : <0xc49>
 <2><c00>: Abbrev Number: 8 (DW_TAG_member)
    <c01>   DW_AT_name        : gx
    <c04>   DW_AT_decl_file   : 9
    <c05>   DW_AT_decl_line   : 35
    <c06>   DW_AT_decl_column : 10
    <c07>   DW_AT_type        : <0x8db>
    <c0b>   DW_AT_data_member_location: 0
 <2><c0c>: Abbrev Number: 8 (DW_TAG_member)
    <c0d>   DW_AT_name        : gy
    <c10>   DW_AT_decl_file   : 9
    <c11>   DW_AT_decl_line   : 35
    <c12>   DW_AT_decl_column : 14
    <c13>   DW_AT_type        : <0x8db>
    <c17>   DW_AT_data_member_location: 2
 <2><c18>: Abbrev Number: 8 (DW_TAG_member)
    <c19>   DW_AT_name        : gz
    <c1c>   DW_AT_decl_file   : 9
    <c1d>   DW_AT_decl_line   : 35
    <c1e>   DW_AT_decl_column : 18
    <c1f>   DW_AT_type        : <0x8db>
    <c23>   DW_AT_data_member_location: 4
 <2><c24>: Abbrev Number: 8 (DW_TAG_member)
    <c25>   DW_AT_name        : ax
    <c28>   DW_AT_decl_file   : 9
    <c29>   DW_AT_decl_line   : 36
    <c2a>   DW_AT_decl_column : 10
    <c2b>   DW_AT_type        : <0x8db>
    <c2f>   DW_AT_data_member_location: 6
 <2><c30>: Abbrev Number: 8 (DW_TAG_member)
    <c31>   DW_AT_name        : ay
    <c34>   DW_AT_decl_file   : 9
    <c35>   DW_AT_decl_line   : 36
    <c36>   DW_AT_decl_column : 14
    <c37>   DW_AT_type        : <0x8db>
    <c3b>   DW_AT_data_member_location: 8
 <2><c3c>: Abbrev Number: 8 (DW_TAG_member)
    <c3d>   DW_AT_name        : az
    <c40>   DW_AT_decl_file   : 9
    <c41>   DW_AT_decl_line   : 36
    <c42>   DW_AT_decl_column : 18
    <c43>   DW_AT_type        : <0x8db>
    <c47>   DW_AT_data_member_location: 10
 <2><c48>: Abbrev Number: 0
 <1><c49>: Abbrev Number: 3 (DW_TAG_typedef)
    <c4a>   DW_AT_name        : (indirect string, offset: 0xa09bb): LSM6DS3_Sample
    <c4e>   DW_AT_decl_file   : 9
    <c4f>   DW_AT_decl_line   : 37
    <c50>   DW_AT_decl_column : 2
    <c51>   DW_AT_type        : <0xbf8>
 <1><c55>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <c56>   DW_AT_encoding    : 7	(unsigned)
    <c57>   DW_AT_byte_size   : 1
    <c58>   DW_AT_type        : <0x843>
    <c5c>   DW_AT_decl_file   : 10
    <c5d>   DW_AT_decl_line   : 39
    <c5e>   DW_AT_decl_column : 1
    <c5f>   DW_AT_sibling     : <0xc7c>
 <2><c63>: Abbrev Number: 12 (DW_TAG_enumerator)
    <c64>   DW_AT_name        : (indirect string, offset: 0xec41c): HAL_OK
    <c68>   DW_AT_const_value : 0
 <2><c69>: Abbrev Number: 12 (DW_TAG_enumerator)
    <c6a>   DW_AT_name        : (indirect string, offset: 0xec527): HAL_ERROR
    <c6e>   DW_AT_const_value : 1
 <2><c6f>: Abbrev Number: 12 (DW_TAG_enumerator)
    <c70>   DW_AT_name        : (indirect string, offset: 0xec3ac): HAL_BUSY
    <c74>   DW_AT_const_value : 2
 <2><c75>: Abbrev Number: 12 (DW_TAG_enumerator)
    <c76>   DW_AT_name        : (indirect string, offset: 0xec3d6): HAL_TIMEOUT
    <c7a>   DW_AT_const_value : 3
 <2><c7b>: Abbrev Number: 0
 <1><c7c>: Abbrev Number: 3 (DW_TAG_typedef)
    <c7d>   DW_AT_name        : (indirect string, offset: 0xec60a): HAL_StatusTypeDef
    <c81>   DW_AT_decl_file   : 10
    <c82>   DW_AT_decl_line   : 44
    <c83>   DW_AT_decl_column : 3
    <c84>   DW_AT_type        : <0xc55>
 <1><c88>: Abbrev Number: 11 (DW_TAG_structure_type)
    <c89>   DW_AT_byte_size   : 28
    <c8a>   DW_AT_decl_file   : 11
    <c8b>   DW_AT_decl_line   : 45
    <c8c>   DW_AT_decl_column : 9
    <c8c>   DW_AT_sibling     : <0xcde>
 <2><c90>: Abbrev Number: 2 (DW_TAG_member)
    <c91>   DW_AT_name        : (indirect string, offset: 0xec536): PLLState
    <c95>   DW_AT_decl_file   : 11
    <c95>   DW_AT_decl_line   : 47
    <c96>   DW_AT_decl_column : 12
    <c96>   DW_AT_type        : <0x8e7>
    <c9a>   DW_AT_data_member_location: 0
 <2><c9b>: Abbrev Number: 2 (DW_TAG_member)
    <c9c>   DW_AT_name        : (indirect string, offset: 0xec563): PLLSource
    <ca0>   DW_AT_decl_file   : 11
    <ca0>   DW_AT_decl_line   : 50
    <ca1>   DW_AT_decl_column : 12
    <ca1>   DW_AT_type        : <0x8e7>
    <ca5>   DW_AT_data_member_location: 4
 <2><ca6>: Abbrev Number: 2 (DW_TAG_member)
    <ca7>   DW_AT_name        : (indirect string, offset: 0xec531): PLLM
    <cab>   DW_AT_decl_file   : 11
    <cab>   DW_AT_decl_line   : 53
    <cac>   DW_AT_decl_column : 12
    <cac>   DW_AT_type        : <0x8e7>
    <cb0>   DW_AT_data_member_location: 8
 <2><cb1>: Abbrev Number: 2 (DW_TAG_member)
    <cb2>   DW_AT_name        : (indirect string, offset: 0xec595): PLLN
    <cb6>   DW_AT_decl_file   : 11
    <cb6>   DW_AT_decl_line   : 57
    <cb7>   DW_AT_decl_column : 12
    <cb7>   DW_AT_type        : <0x8e7>
    <cbb>   DW_AT_data_member_location: 12
 <2><cbc>: Abbrev Number: 2 (DW_TAG_member)
    <cbd>   DW_AT_name        : (indirect string, offset: 0xec59a): PLLP
    <cc1>   DW_AT_decl_file   : 11
    <cc1>   DW_AT_decl_line   : 61
    <cc2>   DW_AT_decl_column : 12
    <cc2>   DW_AT_type        : <0x8e7>
    <cc6>   DW_AT_data_member_location: 16
 <2><cc7>: Abbrev Number: 2 (DW_TAG_member)
    <cc8>   DW_AT_name        : (indirect string, offset: 0xd74a3): PLLQ
    <ccc>   DW_AT_decl_file   : 11
    <ccc>   DW_AT_decl_line   : 65
    <ccd>   DW_AT_decl_column : 12
    <ccd>   DW_AT_type        : <0x8e7>
    <cd1>   DW_AT_data_member_location: 20
 <2><cd2>: Abbrev Number: 2 (DW_TAG_member)
    <cd3>   DW_AT_name        : (indirect string, offset: 0xec59f): PLLR
    <cd7>   DW_AT_decl_file   : 11
    <cd7>   DW_AT_decl_line   : 68
    <cd8>   DW_AT_decl_column : 12
    <cd8>   DW_AT_type        : <0x8e7>
    <cdc>   DW_AT_data_member_location: 24
 <2><cdd>: Abbrev Number: 0
 <1><cde>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdf>   DW_AT_name        : (indirect string, offset: 0xec514): RCC_PLLInitTypeDef
    <ce3>   DW_AT_decl_file   : 11
    <ce4>   DW_AT_decl_line   : 73
    <ce5>   DW_AT_decl_column : 2
    <ce6>   DW_AT_type        : <0xc88>
 <1><cea>: Abbrev Number: 11 (DW_TAG_structure_type)
    <ceb>   DW_AT_byte_size   : 68
    <cec>   DW_AT_decl_file   : 11
    <ced>   DW_AT_decl_line   : 78
    <cee>   DW_AT_decl_column : 9
    <cee>   DW_AT_sibling     : <0xd6e>
 <2><cf2>: Abbrev Number: 2 (DW_TAG_member)
    <cf3>   DW_AT_name        : (indirect string, offset: 0xec578): OscillatorType
    <cf7>   DW_AT_decl_file   : 11
    <cf7>   DW_AT_decl_line   : 80
    <cf8>   DW_AT_decl_column : 12
    <cf8>   DW_AT_type        : <0x8e7>
    <cfc>   DW_AT_data_member_location: 0
 <2><cfd>: Abbrev Number: 2 (DW_TAG_member)
    <cfe>   DW_AT_name        : (indirect string, offset: 0xec53f): HSEState
    <d02>   DW_AT_decl_file   : 11
    <d02>   DW_AT_decl_line   : 83
    <d03>   DW_AT_decl_column : 12
    <d03>   DW_AT_type        : <0x8e7>
    <d07>   DW_AT_data_member_location: 4
 <2><d08>: Abbrev Number: 2 (DW_TAG_member)
    <d09>   DW_AT_name        : (indirect string, offset: 0xec45e): LSEState
    <d0d>   DW_AT_decl_file   : 11
    <d0d>   DW_AT_decl_line   : 86
    <d0e>   DW_AT_decl_column : 12
    <d0e>   DW_AT_type        : <0x8e7>
    <d12>   DW_AT_data_member_location: 8
 <2><d13>: Abbrev Number: 2 (DW_TAG_member)
    <d14>   DW_AT_name        : (indirect string, offset: 0xec475): HSIState
    <d18>   DW_AT_decl_file   : 11
    <d18>   DW_AT_decl_line   : 89
    <d19>   DW_AT_decl_column : 12
    <d19>   DW_AT_type        : <0x8e7>
    <d1d>   DW_AT_data_member_location: 12
 <2><d1e>: Abbrev Number: 2 (DW_TAG_member)
    <d1f>   DW_AT_name        : (indirect string, offset: 0xec5b8): HSICalibrationValue
    <d23>   DW_AT_decl_file   : 11
    <d23>   DW_AT_decl_line   : 92
    <d24>   DW_AT_decl_column : 12
    <d24>   DW_AT_type        : <0x8e7>
    <d28>   DW_AT_data_member_location: 16
 <2><d29>: Abbrev Number: 2 (DW_TAG_member)
    <d2a>   DW_AT_name        : (indirect string, offset: 0xec423): LSIState
    <d2e>   DW_AT_decl_file   : 11
    <d2e>   DW_AT_decl_line   : 98
    <d2f>   DW_AT_decl_column : 12
    <d2f>   DW_AT_type        : <0x8e7>
    <d33>   DW_AT_data_member_location: 20
 <2><d34>: Abbrev Number: 2 (DW_TAG_member)
    <d35>   DW_AT_name        : (indirect string, offset: 0xec3e2): MSIState
    <d39>   DW_AT_decl_file   : 11
    <d39>   DW_AT_decl_line   : 106
    <d3a>   DW_AT_decl_column : 12
    <d3a>   DW_AT_type        : <0x8e7>
    <d3e>   DW_AT_data_member_location: 24
 <2><d3f>: Abbrev Number: 2 (DW_TAG_member)
    <d40>   DW_AT_name        : (indirect string, offset: 0xec3eb): MSICalibrationValue
    <d44>   DW_AT_decl_file   : 11
    <d44>   DW_AT_decl_line   : 109
    <d45>   DW_AT_decl_column : 12
    <d45>   DW_AT_type        : <0x8e7>
    <d49>   DW_AT_data_member_location: 28
 <2><d4a>: Abbrev Number: 2 (DW_TAG_member)
    <d4b>   DW_AT_name        : (indirect string, offset: 0xec4a2): MSIClockRange
    <d4f>   DW_AT_decl_file   : 11
    <d4f>   DW_AT_decl_line   : 112
    <d50>   DW_AT_decl_column : 12
    <d50>   DW_AT_type        : <0x8e7>
    <d54>   DW_AT_data_member_location: 32
 <2><d55>: Abbrev Number: 2 (DW_TAG_member)
    <d56>   DW_AT_name        : (indirect string, offset: 0xec56d): HSI48State
    <d5a>   DW_AT_decl_file   : 11
    <d5a>   DW_AT_decl_line   : 115
    <d5b>   DW_AT_decl_column : 12
    <d5b>   DW_AT_type        : <0x8e7>
    <d5f>   DW_AT_data_member_location: 36
 <2><d60>: Abbrev Number: 8 (DW_TAG_member)
    <d61>   DW_AT_name        : PLL
    <d65>   DW_AT_decl_file   : 11
    <d66>   DW_AT_decl_line   : 118
    <d67>   DW_AT_decl_column : 22
    <d68>   DW_AT_type        : <0xcde>
    <d6c>   DW_AT_data_member_location: 40
 <2><d6d>: Abbrev Number: 0
 <1><d6e>: Abbrev Number: 3 (DW_TAG_typedef)
    <d6f>   DW_AT_name        : (indirect string, offset: 0xec4b0): RCC_OscInitTypeDef
    <d73>   DW_AT_decl_file   : 11
    <d74>   DW_AT_decl_line   : 120
    <d75>   DW_AT_decl_column : 2
    <d76>   DW_AT_type        : <0xcea>
 <1><d7a>: Abbrev Number: 11 (DW_TAG_structure_type)
    <d7b>   DW_AT_byte_size   : 20
    <d7c>   DW_AT_decl_file   : 11
    <d7d>   DW_AT_decl_line   : 125
    <d7e>   DW_AT_decl_column : 9
    <d7e>   DW_AT_sibling     : <0xdba>
 <2><d82>: Abbrev Number: 2 (DW_TAG_member)
    <d83>   DW_AT_name        : (indirect string, offset: 0xec3ff): ClockType
    <d87>   DW_AT_decl_file   : 11
    <d87>   DW_AT_decl_line   : 127
    <d88>   DW_AT_decl_column : 12
    <d88>   DW_AT_type        : <0x8e7>
    <d8c>   DW_AT_data_member_location: 0
 <2><d8d>: Abbrev Number: 2 (DW_TAG_member)
    <d8e>   DW_AT_name        : (indirect string, offset: 0xec4fc): SYSCLKSource
    <d92>   DW_AT_decl_file   : 11
    <d92>   DW_AT_decl_line   : 130
    <d93>   DW_AT_decl_column : 12
    <d93>   DW_AT_type        : <0x8e7>
    <d97>   DW_AT_data_member_location: 4
 <2><d98>: Abbrev Number: 2 (DW_TAG_member)
    <d99>   DW_AT_name        : (indirect string, offset: 0xec587): AHBCLKDivider
    <d9d>   DW_AT_decl_file   : 11
    <d9d>   DW_AT_decl_line   : 133
    <d9e>   DW_AT_decl_column : 12
    <d9e>   DW_AT_type        : <0x8e7>
    <da2>   DW_AT_data_member_location: 8
 <2><da3>: Abbrev Number: 2 (DW_TAG_member)
    <da4>   DW_AT_name        : (indirect string, offset: 0xec380): APB1CLKDivider
    <da8>   DW_AT_decl_file   : 11
    <da8>   DW_AT_decl_line   : 136
    <da9>   DW_AT_decl_column : 12
    <da9>   DW_AT_type        : <0x8e7>
    <dad>   DW_AT_data_member_location: 12
 <2><dae>: Abbrev Number: 2 (DW_TAG_member)
    <daf>   DW_AT_name        : (indirect string, offset: 0xec47e): APB2CLKDivider
    <db3>   DW_AT_decl_file   : 11
    <db3>   DW_AT_decl_line   : 139
    <db4>   DW_AT_decl_column : 12
    <db4>   DW_AT_type        : <0x8e7>
    <db8>   DW_AT_data_member_location: 16
 <2><db9>: Abbrev Number: 0
 <1><dba>: Abbrev Number: 3 (DW_TAG_typedef)
    <dbb>   DW_AT_name        : (indirect string, offset: 0xec409): RCC_ClkInitTypeDef
    <dbf>   DW_AT_decl_file   : 11
    <dc0>   DW_AT_decl_line   : 142
    <dc1>   DW_AT_decl_column : 2
    <dc2>   DW_AT_type        : <0xd7a>
 <1><dc6>: Abbrev Number: 6 (DW_TAG_const_type)
    <dc7>   DW_AT_type        : <0xdba>
 <1><dcb>: Abbrev Number: 17 (DW_TAG_array_type)
    <dcc>   DW_AT_type        : <0x8d6>
    <dd0>   DW_AT_sibling     : <0xddb>
 <2><dd4>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <dd5>   DW_AT_type        : <0x89f>
    <dd9>   DW_AT_upper_bound : 6
 <2><dda>: Abbrev Number: 0
 <1><ddb>: Abbrev Number: 6 (DW_TAG_const_type)
    <ddc>   DW_AT_type        : <0xdcb>
 <1><de0>: Abbrev Number: 9 (DW_TAG_variable)
    <de1>   DW_AT_name        : (indirect string, offset: 0xb077f): CHANNEL_OFFSET_TAB
    <de5>   DW_AT_decl_file   : 15
    <de6>   DW_AT_decl_line   : 49
    <de7>   DW_AT_decl_column : 22
    <de8>   DW_AT_type        : <0xddb>
    <dec>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><df2>: Abbrev Number: 13 (DW_TAG_subprogram)
    <df3>   DW_AT_external    : 1
    <df3>   DW_AT_name        : (indirect string, offset: 0xec5a4): HAL_RCC_ClockConfig
    <df7>   DW_AT_decl_file   : 11
    <df8>   DW_AT_decl_line   : 4837
    <dfa>   DW_AT_decl_column : 19
    <dfb>   DW_AT_prototyped  : 1
    <dfb>   DW_AT_type        : <0xc7c>
    <dff>   DW_AT_declaration : 1
    <dff>   DW_AT_sibling     : <0xe0e>
 <2><e03>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e04>   DW_AT_type        : <0xe0e>
 <2><e08>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e09>   DW_AT_type        : <0x8e7>
 <2><e0d>: Abbrev Number: 0
 <1><e0e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e0f>   DW_AT_byte_size   : 4
    <e0f>   DW_AT_type        : <0xdc6>
 <1><e13>: Abbrev Number: 13 (DW_TAG_subprogram)
    <e14>   DW_AT_external    : 1
    <e14>   DW_AT_name        : (indirect string, offset: 0xec551): HAL_RCC_OscConfig
    <e18>   DW_AT_decl_file   : 11
    <e19>   DW_AT_decl_line   : 4836
    <e1b>   DW_AT_decl_column : 19
    <e1c>   DW_AT_prototyped  : 1
    <e1c>   DW_AT_type        : <0xc7c>
    <e20>   DW_AT_declaration : 1
    <e20>   DW_AT_sibling     : <0xe2a>
 <2><e24>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e25>   DW_AT_type        : <0xe2a>
 <2><e29>: Abbrev Number: 0
 <1><e2a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e2b>   DW_AT_byte_size   : 4
    <e2b>   DW_AT_type        : <0xd6e>
 <1><e2f>: Abbrev Number: 13 (DW_TAG_subprogram)
    <e30>   DW_AT_external    : 1
    <e30>   DW_AT_name        : (indirect string, offset: 0xec43e): HAL_PWREx_ControlVoltageScaling
    <e34>   DW_AT_decl_file   : 12
    <e35>   DW_AT_decl_line   : 837
    <e37>   DW_AT_decl_column : 19
    <e38>   DW_AT_prototyped  : 1
    <e38>   DW_AT_type        : <0xc7c>
    <e3c>   DW_AT_declaration : 1
    <e3c>   DW_AT_sibling     : <0xe46>
 <2><e40>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e41>   DW_AT_type        : <0x8e7>
 <2><e45>: Abbrev Number: 0
 <1><e46>: Abbrev Number: 29 (DW_TAG_subprogram)
    <e47>   DW_AT_external    : 1
    <e47>   DW_AT_name        : (indirect string, offset: 0x9e4c5): printf
    <e4b>   DW_AT_decl_file   : 13
    <e4c>   DW_AT_decl_line   : 206
    <e4d>   DW_AT_decl_column : 5
    <e4e>   DW_AT_prototyped  : 1
    <e4e>   DW_AT_type        : <0x898>
    <e52>   DW_AT_declaration : 1
    <e52>   DW_AT_sibling     : <0xe5d>
 <2><e56>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e57>   DW_AT_type        : <0x8c0>
 <2><e5b>: Abbrev Number: 30 (DW_TAG_unspecified_parameters)
 <2><e5c>: Abbrev Number: 0
 <1><e5d>: Abbrev Number: 31 (DW_TAG_subprogram)
    <e5e>   DW_AT_external    : 1
    <e5e>   DW_AT_name        : (indirect string, offset: 0x9f0e4): LSM6DS3_GyroAccelRead
    <e62>   DW_AT_decl_file   : 9
    <e63>   DW_AT_decl_line   : 40
    <e64>   DW_AT_decl_column : 6
    <e65>   DW_AT_prototyped  : 1
    <e65>   DW_AT_declaration : 1
    <e65>   DW_AT_sibling     : <0xe6f>
 <2><e69>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e6a>   DW_AT_type        : <0xe6f>
 <2><e6e>: Abbrev Number: 0
 <1><e6f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e70>   DW_AT_byte_size   : 4
    <e70>   DW_AT_type        : <0xc49>
 <1><e74>: Abbrev Number: 32 (DW_TAG_subprogram)
    <e75>   DW_AT_external    : 1
    <e75>   DW_AT_name        : (indirect string, offset: 0xec4e5): vTaskDelay
    <e79>   DW_AT_decl_file   : 8
    <e7a>   DW_AT_decl_line   : 859
    <e7c>   DW_AT_decl_column : 6
    <e7d>   DW_AT_prototyped  : 1
    <e7d>   DW_AT_declaration : 1
    <e7d>   DW_AT_sibling     : <0xe87>
 <2><e81>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e82>   DW_AT_type        : <0xbdd>
 <2><e86>: Abbrev Number: 0
 <1><e87>: Abbrev Number: 13 (DW_TAG_subprogram)
    <e88>   DW_AT_external    : 1
    <e88>   DW_AT_name        : (indirect string, offset: 0xec4f0): xTaskCreate
    <e8c>   DW_AT_decl_file   : 8
    <e8d>   DW_AT_decl_line   : 385
    <e8f>   DW_AT_decl_column : 16
    <e90>   DW_AT_prototyped  : 1
    <e90>   DW_AT_type        : <0xbb9>
    <e94>   DW_AT_declaration : 1
    <e94>   DW_AT_sibling     : <0xeb7>
 <2><e98>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e99>   DW_AT_type        : <0xb8c>
 <2><e9d>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e9e>   DW_AT_type        : <0x8c5>
 <2><ea2>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <ea3>   DW_AT_type        : <0xbb4>
 <2><ea7>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <ea8>   DW_AT_type        : <0x8af>
 <2><eac>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <ead>   DW_AT_type        : <0xbc5>
 <2><eb1>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <eb2>   DW_AT_type        : <0xebc>
 <2><eb6>: Abbrev Number: 0
 <1><eb7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <eb8>   DW_AT_byte_size   : 4
    <eb8>   DW_AT_type        : <0xbe2>
 <1><ebc>: Abbrev Number: 6 (DW_TAG_const_type)
    <ebd>   DW_AT_type        : <0xeb7>
 <1><ec1>: Abbrev Number: 33 (DW_TAG_subprogram)
    <ec2>   DW_AT_external    : 1
    <ec2>   DW_AT_name        : (indirect string, offset: 0xec4d1): vTaskStartScheduler
    <ec6>   DW_AT_decl_file   : 8
    <ec7>   DW_AT_decl_line   : 1520
    <ec9>   DW_AT_decl_column : 6
    <eca>   DW_AT_prototyped  : 1
    <eca>   DW_AT_declaration : 1
 <1><eca>: Abbrev Number: 20 (DW_TAG_subprogram)
    <ecb>   DW_AT_external    : 1
    <ecb>   DW_AT_name        : (indirect string, offset: 0x9f348): LSM6DS3_Init
    <ecf>   DW_AT_decl_file   : 9
    <ed0>   DW_AT_decl_line   : 39
    <ed1>   DW_AT_decl_column : 6
    <ed1>   DW_AT_prototyped  : 1
    <ed1>   DW_AT_declaration : 1
 <1><ed1>: Abbrev Number: 20 (DW_TAG_subprogram)
    <ed2>   DW_AT_external    : 1
    <ed2>   DW_AT_name        : (indirect string, offset: 0x293ad): I2C1_Config
    <ed6>   DW_AT_decl_file   : 14
    <ed7>   DW_AT_decl_line   : 13
    <ed8>   DW_AT_decl_column : 6
    <ed8>   DW_AT_prototyped  : 1
    <ed8>   DW_AT_declaration : 1
 <1><ed8>: Abbrev Number: 34 (DW_TAG_subprogram)
    <ed9>   DW_AT_external    : 1
    <ed9>   DW_AT_name        : (indirect string, offset: 0xec601): HAL_Init
    <edd>   DW_AT_decl_file   : 16
    <ede>   DW_AT_decl_line   : 636
    <ee0>   DW_AT_decl_column : 19
    <ee1>   DW_AT_prototyped  : 1
    <ee1>   DW_AT_type        : <0xc7c>
    <ee5>   DW_AT_declaration : 1
 <1><ee5>: Abbrev Number: 21 (DW_TAG_subprogram)
    <ee6>   DW_AT_external    : 1
    <ee6>   DW_AT_name        : (indirect string, offset: 0xec467): Error_Handler
    <eea>   DW_AT_decl_file   : 1
    <eea>   DW_AT_decl_line   : 115
    <eeb>   DW_AT_decl_column : 6
    <eeb>   DW_AT_prototyped  : 1
    <eeb>   DW_AT_low_pc      : 0x8000ca0
    <eef>   DW_AT_high_pc     : 0xc
    <ef3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ef5>   DW_AT_call_all_calls: 1
    <ef5>   DW_AT_sibling     : <0xf0a>
 <2><ef9>: Abbrev Number: 35 (DW_TAG_inlined_subroutine)
    <efa>   DW_AT_abstract_origin: <0x100b>
    <efe>   DW_AT_low_pc      : 0x8000ca4
    <f02>   DW_AT_high_pc     : 0x4
    <f06>   DW_AT_call_file   : 1
    <f07>   DW_AT_call_line   : 117
    <f08>   DW_AT_call_column : 3
 <2><f09>: Abbrev Number: 0
 <1><f0a>: Abbrev Number: 14 (DW_TAG_subprogram)
    <f0b>   DW_AT_external    : 1
    <f0b>   DW_AT_name        : (indirect string, offset: 0xec5cc): SystemClock_Config
    <f0f>   DW_AT_decl_file   : 1
    <f0f>   DW_AT_decl_line   : 74
    <f10>   DW_AT_decl_column : 6
    <f10>   DW_AT_prototyped  : 1
    <f10>   DW_AT_low_pc      : 0x8000bfc
    <f14>   DW_AT_high_pc     : 0xa4
    <f18>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f1a>   DW_AT_call_all_tail_calls: 1
    <f1a>   DW_AT_sibling     : <0xf3f>
 <2><f1e>: Abbrev Number: 9 (DW_TAG_variable)
    <f1f>   DW_AT_name        : (indirect string, offset: 0xec3b5): RCC_OscInitStruct
    <f23>   DW_AT_decl_file   : 1
    <f24>   DW_AT_decl_line   : 76
    <f25>   DW_AT_decl_column : 22
    <f26>   DW_AT_type        : <0xd6e>
    <f2a>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><f2e>: Abbrev Number: 9 (DW_TAG_variable)
    <f2f>   DW_AT_name        : (indirect string, offset: 0xec42c): RCC_ClkInitStruct
    <f33>   DW_AT_decl_file   : 1
    <f34>   DW_AT_decl_line   : 77
    <f35>   DW_AT_decl_column : 22
    <f36>   DW_AT_type        : <0xdba>
    <f3a>   DW_AT_location    : 3 byte block: 91 a0 7f 	(DW_OP_fbreg: -96)
 <2><f3e>: Abbrev Number: 0
 <1><f3f>: Abbrev Number: 21 (DW_TAG_subprogram)
    <f40>   DW_AT_external    : 1
    <f40>   DW_AT_name        : (indirect string, offset: 0xec5f2): GPIOPortConfig
    <f44>   DW_AT_decl_file   : 1
    <f44>   DW_AT_decl_line   : 64
    <f45>   DW_AT_decl_column : 6
    <f45>   DW_AT_prototyped  : 1
    <f45>   DW_AT_low_pc      : 0x8000bb0
    <f49>   DW_AT_high_pc     : 0x4c
    <f4d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f4f>   DW_AT_call_all_calls: 1
    <f4f>   DW_AT_sibling     : <0xf63>
 <2><f53>: Abbrev Number: 9 (DW_TAG_variable)
    <f54>   DW_AT_name        : (indirect string, offset: 0x8293a): tmpreg
    <f58>   DW_AT_decl_file   : 1
    <f59>   DW_AT_decl_line   : 65
    <f5a>   DW_AT_decl_column : 20
    <f5b>   DW_AT_type        : <0x8f3>
    <f5f>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><f62>: Abbrev Number: 0
 <1><f63>: Abbrev Number: 14 (DW_TAG_subprogram)
    <f64>   DW_AT_external    : 1
    <f64>   DW_AT_name        : (indirect string, offset: 0xec548): vIMURead
    <f68>   DW_AT_decl_file   : 1
    <f68>   DW_AT_decl_line   : 53
    <f69>   DW_AT_decl_column : 6
    <f69>   DW_AT_prototyped  : 1
    <f69>   DW_AT_low_pc      : 0x8000b60
    <f6d>   DW_AT_high_pc     : 0x50
    <f71>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f73>   DW_AT_call_all_tail_calls: 1
    <f73>   DW_AT_sibling     : <0xf95>
 <2><f77>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <f78>   DW_AT_name        : (indirect string, offset: 0xec38f): pvParameters
    <f7c>   DW_AT_decl_file   : 1
    <f7c>   DW_AT_decl_line   : 53
    <f7d>   DW_AT_decl_column : 21
    <f7e>   DW_AT_type        : <0x8ad>
    <f82>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><f85>: Abbrev Number: 9 (DW_TAG_variable)
    <f86>   DW_AT_name        : (indirect string, offset: 0xec39c): IMU_Sample
    <f8a>   DW_AT_decl_file   : 1
    <f8b>   DW_AT_decl_line   : 54
    <f8c>   DW_AT_decl_column : 17
    <f8d>   DW_AT_type        : <0xc49>
    <f91>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><f94>: Abbrev Number: 0
 <1><f95>: Abbrev Number: 14 (DW_TAG_subprogram)
    <f96>   DW_AT_external    : 1
    <f96>   DW_AT_name        : (indirect string, offset: 0xec509): vHeartbeat
    <f9a>   DW_AT_decl_file   : 1
    <f9a>   DW_AT_decl_line   : 42
    <f9b>   DW_AT_decl_column : 6
    <f9b>   DW_AT_prototyped  : 1
    <f9b>   DW_AT_low_pc      : 0x8000a1c
    <f9f>   DW_AT_high_pc     : 0x142
    <fa3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fa5>   DW_AT_call_all_tail_calls: 1
    <fa5>   DW_AT_sibling     : <0xfc7>
 <2><fa9>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <faa>   DW_AT_name        : (indirect string, offset: 0xec38f): pvParameters
    <fae>   DW_AT_decl_file   : 1
    <fae>   DW_AT_decl_line   : 42
    <faf>   DW_AT_decl_column : 23
    <fb0>   DW_AT_type        : <0x8ad>
    <fb4>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><fb7>: Abbrev Number: 9 (DW_TAG_variable)
    <fb8>   DW_AT_name        : (indirect string, offset: 0xec61c): rate
    <fbc>   DW_AT_decl_file   : 1
