Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x126 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x3c767): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x54cc2): ../Core/Src/freertos_hooks.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x7fb10): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 7 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 1 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0x12ac1): unsigned int
 <1><38>: Abbrev Number: 1 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x69985): long long int

 <1><191>: Abbrev Number: 5 (DW_TAG_base_type)
    <192>   DW_AT_byte_size   : 2
    <193>   DW_AT_encoding    : 7	(unsigned)
    <194>   DW_AT_name        : (indirect string, offset: 0xde34b): short unsigned int
 <1><198>: Abbrev Number: 5 (DW_TAG_base_type)
    <199>   DW_AT_byte_size   : 4
    <19a>   DW_AT_encoding    : 5	(signed)
    <19b>   DW_AT_name        : (indirect string, offset: 0x135b8): long int
 <1><19f>: Abbrev Number: 3 (DW_TAG_typedef)
    <1a0>   DW_AT_name        : (indirect string, offset: 0xe8b4d): __uint32_t
    <1a4>   DW_AT_decl_file   : 3
    <1a5>   DW_AT_decl_line   : 79
    <1a6>   DW_AT_decl_column : 25
    <1a7>   DW_AT_type        : <0x1ab>
 <1><1ab>: Abbrev Number: 5 (DW_TAG_base_type)
    <1ac>   DW_AT_byte_size   : 4
    <1ad>   DW_AT_encoding    : 7	(unsigned)
    <1ae>   DW_AT_name        : (indirect string, offset: 0x58285): long unsigned int
 <1><1b2>: Abbrev Number: 3 (DW_TAG_typedef)
    <1b3>   DW_AT_name        : (indirect string, offset: 0xe8a73): __uint64_t
    <1b7>   DW_AT_decl_file   : 3
    <1b8>   DW_AT_decl_line   : 105
    <1b9>   DW_AT_decl_column : 25
    <1ba>   DW_AT_type        : <0x1be>
 <1><1be>: Abbrev Number: 5 (DW_TAG_base_type)
    <1bf>   DW_AT_byte_size   : 8
    <1c0>   DW_AT_encoding    : 7	(unsigned)
    <1c1>   DW_AT_name        : (indirect string, offset: 0x3004c): long long unsigned int
 <1><1c5>: Abbrev Number: 3 (DW_TAG_typedef)
    <1c6>   DW_AT_name        : (indirect string, offset: 0x4354f): uint8_t
    <1ca>   DW_AT_decl_file   : 4
    <1cb>   DW_AT_decl_line   : 24
    <1cc>   DW_AT_decl_column : 19
    <1cd>   DW_AT_type        : <0x177>
 <1><1d1>: Abbrev Number: 6 (DW_TAG_const_type)
    <1d2>   DW_AT_type        : <0x1c5>
 <1><1d6>: Abbrev Number: 3 (DW_TAG_typedef)
    <1d7>   DW_AT_name        : (indirect string, offset: 0xa82d1): uint32_t
    <1db>   DW_AT_decl_file   : 4
    <1dc>   DW_AT_decl_line   : 48
    <1dd>   DW_AT_decl_column : 20
    <1de>   DW_AT_type        : <0x19f>
 <1><1e2>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <1e3>   DW_AT_type        : <0x1d6>
 <1><1e7>: Abbrev Number: 3 (DW_TAG_typedef)
    <1e8>   DW_AT_name        : (indirect string, offset: 0xe8a75): uint64_t
    <1ec>   DW_AT_decl_file   : 4
    <1ed>   DW_AT_decl_line   : 60
    <1ee>   DW_AT_decl_column : 20
    <1ef>   DW_AT_type        : <0x1b2>
 <1><1f3>: Abbrev Number: 3 (DW_TAG_typedef)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x6da98): TaskFunction_t
    <1f8>   DW_AT_decl_file   : 5
    <1f9>   DW_AT_decl_line   : 36
    <1fa>   DW_AT_decl_column : 17
    <1fb>   DW_AT_type        : <0x1ff>
 <1><1ff>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <200>   DW_AT_byte_size   : 4
    <200>   DW_AT_type        : <0x204>
 <1><204>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <205>   DW_AT_prototyped  : 1
    <205>   DW_AT_sibling     : <0x20f>
 <2><209>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <20a>   DW_AT_type        : <0x20f>
 <2><20e>: Abbrev Number: 0
 <1><20f>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <210>   DW_AT_byte_size   : 4
 <1><211>: Abbrev Number: 6 (DW_TAG_const_type)
    <212>   DW_AT_type        : <0x20f>
 <1><216>: Abbrev Number: 3 (DW_TAG_typedef)
    <217>   DW_AT_name        : (indirect string, offset: 0xd522e): StackType_t
    <21b>   DW_AT_decl_file   : 6
    <21c>   DW_AT_decl_line   : 58
    <21d>   DW_AT_decl_column : 26
    <21e>   DW_AT_type        : <0x1d6>
 <1><222>: Abbrev Number: 6 (DW_TAG_const_type)
    <223>   DW_AT_type        : <0x216>
 <1><227>: Abbrev Number: 3 (DW_TAG_typedef)
    <228>   DW_AT_name        : (indirect string, offset: 0xe8cb3): BaseType_t
    <22c>   DW_AT_decl_file   : 6
    <22d>   DW_AT_decl_line   : 59
    <22e>   DW_AT_decl_column : 26
    <22f>   DW_AT_type        : <0x198>
 <1><233>: Abbrev Number: 3 (DW_TAG_typedef)
    <234>   DW_AT_name        : (indirect string, offset: 0xe8cb2): UBaseType_t
    <238>   DW_AT_decl_file   : 6
    <239>   DW_AT_decl_line   : 60
    <23a>   DW_AT_decl_column : 26
    <23b>   DW_AT_type        : <0x1ab>
 <1><23f>: Abbrev Number: 3 (DW_TAG_typedef)
    <240>   DW_AT_name        : (indirect string, offset: 0x8004b): TickType_t
    <244>   DW_AT_decl_file   : 6
    <245>   DW_AT_decl_line   : 66
    <246>   DW_AT_decl_column : 26
    <247>   DW_AT_type        : <0x1d6>
 <1><24b>: Abbrev Number: 6 (DW_TAG_const_type)
    <24c>   DW_AT_type        : <0x23f>
 <1><250>: Abbrev Number: 3 (DW_TAG_typedef)
    <251>   DW_AT_name        : (indirect string, offset: 0xc99d6): TaskHandle_t
    <255>   DW_AT_decl_file   : 7
    <256>   DW_AT_decl_line   : 95
    <257>   DW_AT_decl_column : 46
    <258>   DW_AT_type        : <0x25c>
 <1><25c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <25d>   DW_AT_byte_size   : 4
    <25d>   DW_AT_type        : <0x261>
 <1><261>: Abbrev Number: 24 (DW_TAG_structure_type)
    <262>   DW_AT_name        : (indirect string, offset: 0xc511a): tskTaskControlBlock
    <266>   DW_AT_declaration : 1
 <1><266>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <267>   DW_AT_byte_size   : 4
    <267>   DW_AT_type        : <0x277>
 <1><26b>: Abbrev Number: 6 (DW_TAG_const_type)
    <26c>   DW_AT_type        : <0x266>
 <1><270>: Abbrev Number: 5 (DW_TAG_base_type)
    <271>   DW_AT_byte_size   : 1
    <272>   DW_AT_encoding    : 8	(unsigned char)
    <273>   DW_AT_name        : (indirect string, offset: 0x4ad84): char
 <1><277>: Abbrev Number: 6 (DW_TAG_const_type)
    <278>   DW_AT_type        : <0x270>
 <1><27c>: Abbrev Number: 14 (DW_TAG_structure_type)
    <27d>   DW_AT_byte_size   : 48
    <27e>   DW_AT_decl_file   : 8
    <27e>   DW_AT_decl_line   : 531
    <280>   DW_AT_decl_column : 9
    <280>   DW_AT_sibling     : <0x309>
 <2><284>: Abbrev Number: 1 (DW_TAG_member)
    <285>   DW_AT_name        : (indirect string, offset: 0xe88b0): MODER
    <289>   DW_AT_decl_file   : 8
    <289>   DW_AT_decl_line   : 533
    <28b>   DW_AT_decl_column : 17
    <28b>   DW_AT_type        : <0x1e2>
    <28f>   DW_AT_data_member_location: 0
 <2><290>: Abbrev Number: 1 (DW_TAG_member)
    <291>   DW_AT_name        : (indirect string, offset: 0xe8bba): OTYPER
    <295>   DW_AT_decl_file   : 8
    <295>   DW_AT_decl_line   : 534
    <297>   DW_AT_decl_column : 17
    <297>   DW_AT_type        : <0x1e2>
    <29b>   DW_AT_data_member_location: 4
 <2><29c>: Abbrev Number: 1 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0xe8c23): OSPEEDR
    <2a1>   DW_AT_decl_file   : 8
    <2a1>   DW_AT_decl_line   : 535
    <2a3>   DW_AT_decl_column : 17
    <2a3>   DW_AT_type        : <0x1e2>
    <2a7>   DW_AT_data_member_location: 8
 <2><2a8>: Abbrev Number: 1 (DW_TAG_member)
    <2a9>   DW_AT_name        : (indirect string, offset: 0xe8b58): PUPDR
    <2ad>   DW_AT_decl_file   : 8
    <2ad>   DW_AT_decl_line   : 536
    <2af>   DW_AT_decl_column : 17
    <2af>   DW_AT_type        : <0x1e2>
    <2b3>   DW_AT_data_member_location: 12
 <2><2b4>: Abbrev Number: 8 (DW_TAG_member)
    <2b5>   DW_AT_name        : IDR
    <2b9>   DW_AT_decl_file   : 8
    <2b9>   DW_AT_decl_line   : 537
    <2bb>   DW_AT_decl_column : 17
    <2bb>   DW_AT_type        : <0x1e2>
    <2bf>   DW_AT_data_member_location: 16
 <2><2c0>: Abbrev Number: 8 (DW_TAG_member)
    <2c1>   DW_AT_name        : ODR
    <2c5>   DW_AT_decl_file   : 8
    <2c5>   DW_AT_decl_line   : 538
    <2c7>   DW_AT_decl_column : 17
    <2c7>   DW_AT_type        : <0x1e2>
    <2cb>   DW_AT_data_member_location: 20
 <2><2cc>: Abbrev Number: 1 (DW_TAG_member)
    <2cd>   DW_AT_name        : (indirect string, offset: 0xe897b): BSRR
    <2d1>   DW_AT_decl_file   : 8
    <2d1>   DW_AT_decl_line   : 539
    <2d3>   DW_AT_decl_column : 17
    <2d3>   DW_AT_type        : <0x1e2>
    <2d7>   DW_AT_data_member_location: 24
 <2><2d8>: Abbrev Number: 1 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0xe8c0a): LCKR
    <2dd>   DW_AT_decl_file   : 8
    <2dd>   DW_AT_decl_line   : 540
    <2df>   DW_AT_decl_column : 17
    <2df>   DW_AT_type        : <0x1e2>
    <2e3>   DW_AT_data_member_location: 28
 <2><2e4>: Abbrev Number: 8 (DW_TAG_member)
    <2e5>   DW_AT_name        : AFR
    <2e9>   DW_AT_decl_file   : 8
    <2e9>   DW_AT_decl_line   : 541
    <2eb>   DW_AT_decl_column : 17
    <2eb>   DW_AT_type        : <0x319>
    <2ef>   DW_AT_data_member_location: 32
 <2><2f0>: Abbrev Number: 8 (DW_TAG_member)
    <2f1>   DW_AT_name        : BRR
    <2f5>   DW_AT_decl_file   : 8
    <2f5>   DW_AT_decl_line   : 542
    <2f7>   DW_AT_decl_column : 17
    <2f7>   DW_AT_type        : <0x1e2>
    <2fb>   DW_AT_data_member_location: 40
 <2><2fc>: Abbrev Number: 1 (DW_TAG_member)
    <2fd>   DW_AT_name        : (indirect string, offset: 0xe88bb): ASCR
    <301>   DW_AT_decl_file   : 8
    <301>   DW_AT_decl_line   : 543
    <303>   DW_AT_decl_column : 17
    <303>   DW_AT_type        : <0x1e2>
    <307>   DW_AT_data_member_location: 44
 <2><308>: Abbrev Number: 0
 <1><309>: Abbrev Number: 15 (DW_TAG_array_type)
    <30a>   DW_AT_type        : <0x1e2>
    <30e>   DW_AT_sibling     : <0x319>
 <2><312>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <313>   DW_AT_type        : <0x15b>
    <317>   DW_AT_upper_bound : 1
 <2><318>: Abbrev Number: 0
 <1><319>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <31a>   DW_AT_type        : <0x309>
 <1><31e>: Abbrev Number: 17 (DW_TAG_typedef)
    <31f>   DW_AT_name        : (indirect string, offset: 0xe8cbe): GPIO_TypeDef
    <323>   DW_AT_decl_file   : 8
    <323>   DW_AT_decl_line   : 545
    <325>   DW_AT_decl_column : 3
    <325>   DW_AT_type        : <0x27c>
 <1><329>: Abbrev Number: 14 (DW_TAG_structure_type)
    <32a>   DW_AT_byte_size   : 152
    <32b>   DW_AT_decl_file   : 8
    <32b>   DW_AT_decl_line   : 685
    <32d>   DW_AT_decl_column : 9
    <32d>   DW_AT_sibling     : <0x4f9>
 <2><331>: Abbrev Number: 8 (DW_TAG_member)
    <332>   DW_AT_name        : CR
    <335>   DW_AT_decl_file   : 8
    <335>   DW_AT_decl_line   : 687
    <337>   DW_AT_decl_column : 17
    <337>   DW_AT_type        : <0x1e2>
    <33b>   DW_AT_data_member_location: 0
 <2><33c>: Abbrev Number: 1 (DW_TAG_member)
    <33d>   DW_AT_name        : (indirect string, offset: 0xe8ac3): ICSCR
    <341>   DW_AT_decl_file   : 8
    <341>   DW_AT_decl_line   : 688
    <343>   DW_AT_decl_column : 17
    <343>   DW_AT_type        : <0x1e2>
    <347>   DW_AT_data_member_location: 4
 <2><348>: Abbrev Number: 1 (DW_TAG_member)
    <349>   DW_AT_name        : (indirect string, offset: 0xe89ef): CFGR
    <34d>   DW_AT_decl_file   : 8
    <34d>   DW_AT_decl_line   : 689
    <34f>   DW_AT_decl_column : 17
    <34f>   DW_AT_type        : <0x1e2>
    <353>   DW_AT_data_member_location: 8
 <2><354>: Abbrev Number: 1 (DW_TAG_member)
    <355>   DW_AT_name        : (indirect string, offset: 0xe8b9d): PLLCFGR
    <359>   DW_AT_decl_file   : 8
    <359>   DW_AT_decl_line   : 690
    <35b>   DW_AT_decl_column : 17
    <35b>   DW_AT_type        : <0x1e2>
    <35f>   DW_AT_data_member_location: 12
 <2><360>: Abbrev Number: 1 (DW_TAG_member)
    <361>   DW_AT_name        : (indirect string, offset: 0xe89e8): PLLSAI1CFGR
    <365>   DW_AT_decl_file   : 8
    <365>   DW_AT_decl_line   : 691
    <367>   DW_AT_decl_column : 17
    <367>   DW_AT_type        : <0x1e2>
    <36b>   DW_AT_data_member_location: 16
 <2><36c>: Abbrev Number: 1 (DW_TAG_member)
    <36d>   DW_AT_name        : (indirect string, offset: 0xe8b63): PLLSAI2CFGR
    <371>   DW_AT_decl_file   : 8
    <371>   DW_AT_decl_line   : 692
    <373>   DW_AT_decl_column : 17
    <373>   DW_AT_type        : <0x1e2>
    <377>   DW_AT_data_member_location: 20
 <2><378>: Abbrev Number: 1 (DW_TAG_member)
    <379>   DW_AT_name        : (indirect string, offset: 0xe88c5): CIER
    <37d>   DW_AT_decl_file   : 8
    <37d>   DW_AT_decl_line   : 693
    <37f>   DW_AT_decl_column : 17
    <37f>   DW_AT_type        : <0x1e2>
    <383>   DW_AT_data_member_location: 24
 <2><384>: Abbrev Number: 1 (DW_TAG_member)
    <385>   DW_AT_name        : (indirect string, offset: 0xe88c0): CIFR
    <389>   DW_AT_decl_file   : 8
    <389>   DW_AT_decl_line   : 694
    <38b>   DW_AT_decl_column : 17
    <38b>   DW_AT_type        : <0x1e2>
    <38f>   DW_AT_data_member_location: 28
 <2><390>: Abbrev Number: 1 (DW_TAG_member)
    <391>   DW_AT_name        : (indirect string, offset: 0xe88b6): CICR
    <395>   DW_AT_decl_file   : 8
    <395>   DW_AT_decl_line   : 695
    <397>   DW_AT_decl_column : 17
    <397>   DW_AT_type        : <0x1e2>
    <39b>   DW_AT_data_member_location: 32
 <2><39c>: Abbrev Number: 1 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0xe8c64): RESERVED0
    <3a1>   DW_AT_decl_file   : 8
    <3a1>   DW_AT_decl_line   : 696
    <3a3>   DW_AT_decl_column : 17
    <3a3>   DW_AT_type        : <0x1d6>
    <3a7>   DW_AT_data_member_location: 36
 <2><3a8>: Abbrev Number: 1 (DW_TAG_member)
    <3a9>   DW_AT_name        : (indirect string, offset: 0xe8bc1): AHB1RSTR
    <3ad>   DW_AT_decl_file   : 8
    <3ad>   DW_AT_decl_line   : 697
    <3af>   DW_AT_decl_column : 17
    <3af>   DW_AT_type        : <0x1e2>
    <3b3>   DW_AT_data_member_location: 40
 <2><3b4>: Abbrev Number: 1 (DW_TAG_member)
    <3b5>   DW_AT_name        : (indirect string, offset: 0xe890c): AHB2RSTR
    <3b9>   DW_AT_decl_file   : 8
    <3b9>   DW_AT_decl_line   : 698
    <3bb>   DW_AT_decl_column : 17
    <3bb>   DW_AT_type        : <0x1e2>
    <3bf>   DW_AT_data_member_location: 44
 <2><3c0>: Abbrev Number: 1 (DW_TAG_member)
    <3c1>   DW_AT_name        : (indirect string, offset: 0xe89df): AHB3RSTR
    <3c5>   DW_AT_decl_file   : 8
    <3c5>   DW_AT_decl_line   : 699
    <3c7>   DW_AT_decl_column : 17
    <3c7>   DW_AT_type        : <0x1e2>
    <3cb>   DW_AT_data_member_location: 48
 <2><3cc>: Abbrev Number: 1 (DW_TAG_member)
    <3cd>   DW_AT_name        : (indirect string, offset: 0xe8c6e): RESERVED1
    <3d1>   DW_AT_decl_file   : 8
    <3d1>   DW_AT_decl_line   : 700
    <3d3>   DW_AT_decl_column : 17
    <3d3>   DW_AT_type        : <0x1d6>
    <3d7>   DW_AT_data_member_location: 52
 <2><3d8>: Abbrev Number: 1 (DW_TAG_member)
    <3d9>   DW_AT_name        : (indirect string, offset: 0xe8955): APB1RSTR1
    <3dd>   DW_AT_decl_file   : 8
    <3dd>   DW_AT_decl_line   : 701
    <3df>   DW_AT_decl_column : 17
    <3df>   DW_AT_type        : <0x1e2>
    <3e3>   DW_AT_data_member_location: 56
 <2><3e4>: Abbrev Number: 1 (DW_TAG_member)
    <3e5>   DW_AT_name        : (indirect string, offset: 0xe895f): APB1RSTR2
    <3e9>   DW_AT_decl_file   : 8
    <3e9>   DW_AT_decl_line   : 702
    <3eb>   DW_AT_decl_column : 17
    <3eb>   DW_AT_type        : <0x1e2>
    <3ef>   DW_AT_data_member_location: 60
 <2><3f0>: Abbrev Number: 1 (DW_TAG_member)
    <3f1>   DW_AT_name        : (indirect string, offset: 0xe8a32): APB2RSTR
    <3f5>   DW_AT_decl_file   : 8
    <3f5>   DW_AT_decl_line   : 703
    <3f7>   DW_AT_decl_column : 17
    <3f7>   DW_AT_type        : <0x1e2>
    <3fb>   DW_AT_data_member_location: 64
 <2><3fc>: Abbrev Number: 1 (DW_TAG_member)
    <3fd>   DW_AT_name        : (indirect string, offset: 0xe8c78): RESERVED2
    <401>   DW_AT_decl_file   : 8
    <401>   DW_AT_decl_line   : 704
    <403>   DW_AT_decl_column : 17
    <403>   DW_AT_type        : <0x1d6>
    <407>   DW_AT_data_member_location: 68
 <2><408>: Abbrev Number: 1 (DW_TAG_member)
    <409>   DW_AT_name        : (indirect string, offset: 0xe88ff): AHB1ENR
    <40d>   DW_AT_decl_file   : 8
    <40d>   DW_AT_decl_line   : 705
    <40f>   DW_AT_decl_column : 17
    <40f>   DW_AT_type        : <0x1e2>
    <413>   DW_AT_data_member_location: 72
 <2><414>: Abbrev Number: 1 (DW_TAG_member)
    <415>   DW_AT_name        : (indirect string, offset: 0xe8994): AHB2ENR
    <419>   DW_AT_decl_file   : 8
    <419>   DW_AT_decl_line   : 706
    <41b>   DW_AT_decl_column : 17
    <41b>   DW_AT_type        : <0x1e2>
    <41f>   DW_AT_data_member_location: 76
 <2><420>: Abbrev Number: 1 (DW_TAG_member)
    <421>   DW_AT_name        : (indirect string, offset: 0xe8a52): AHB3ENR
    <425>   DW_AT_decl_file   : 8
    <425>   DW_AT_decl_line   : 707
    <427>   DW_AT_decl_column : 17
    <427>   DW_AT_type        : <0x1e2>
    <42b>   DW_AT_data_member_location: 80
 <2><42c>: Abbrev Number: 1 (DW_TAG_member)
    <42d>   DW_AT_name        : (indirect string, offset: 0xe8c82): RESERVED3
    <431>   DW_AT_decl_file   : 8
    <431>   DW_AT_decl_line   : 708
    <433>   DW_AT_decl_column : 17
    <433>   DW_AT_type        : <0x1d6>
    <437>   DW_AT_data_member_location: 84
 <2><438>: Abbrev Number: 1 (DW_TAG_member)
    <439>   DW_AT_name        : (indirect string, offset: 0xe88ca): APB1ENR1
    <43d>   DW_AT_decl_file   : 8
    <43d>   DW_AT_decl_line   : 709
    <43f>   DW_AT_decl_column : 17
    <43f>   DW_AT_type        : <0x1e2>
    <443>   DW_AT_data_member_location: 88
 <2><444>: Abbrev Number: 1 (DW_TAG_member)
    <445>   DW_AT_name        : (indirect string, offset: 0xe88d3): APB1ENR2
    <449>   DW_AT_decl_file   : 8
    <449>   DW_AT_decl_line   : 710
    <44b>   DW_AT_decl_column : 17
    <44b>   DW_AT_type        : <0x1e2>
    <44f>   DW_AT_data_member_location: 92
 <2><450>: Abbrev Number: 1 (DW_TAG_member)
    <451>   DW_AT_name        : (indirect string, offset: 0xe8915): APB2ENR
    <455>   DW_AT_decl_file   : 8
    <455>   DW_AT_decl_line   : 711
    <457>   DW_AT_decl_column : 17
    <457>   DW_AT_type        : <0x1e2>
    <45b>   DW_AT_data_member_location: 96
 <2><45c>: Abbrev Number: 1 (DW_TAG_member)
    <45d>   DW_AT_name        : (indirect string, offset: 0xe8ae8): RESERVED4
    <461>   DW_AT_decl_file   : 8
    <461>   DW_AT_decl_line   : 712
    <463>   DW_AT_decl_column : 17
    <463>   DW_AT_type        : <0x1d6>
    <467>   DW_AT_data_member_location: 100
 <2><468>: Abbrev Number: 1 (DW_TAG_member)
    <469>   DW_AT_name        : (indirect string, offset: 0xe8a69): AHB1SMENR
    <46d>   DW_AT_decl_file   : 8
    <46d>   DW_AT_decl_line   : 713
    <46f>   DW_AT_decl_column : 17
    <46f>   DW_AT_type        : <0x1e2>
    <473>   DW_AT_data_member_location: 104
 <2><474>: Abbrev Number: 1 (DW_TAG_member)
    <475>   DW_AT_name        : (indirect string, offset: 0xe8c51): AHB2SMENR
    <479>   DW_AT_decl_file   : 8
    <479>   DW_AT_decl_line   : 714
    <47b>   DW_AT_decl_column : 17
    <47b>   DW_AT_type        : <0x1e2>
    <47f>   DW_AT_data_member_location: 108
 <2><480>: Abbrev Number: 1 (DW_TAG_member)
    <481>   DW_AT_name        : (indirect string, offset: 0xe8a0d): AHB3SMENR
    <485>   DW_AT_decl_file   : 8
    <485>   DW_AT_decl_line   : 715
    <487>   DW_AT_decl_column : 17
    <487>   DW_AT_type        : <0x1e2>
    <48b>   DW_AT_data_member_location: 112
 <2><48c>: Abbrev Number: 1 (DW_TAG_member)
    <48d>   DW_AT_name        : (indirect string, offset: 0xe8c8c): RESERVED5
    <491>   DW_AT_decl_file   : 8
    <491>   DW_AT_decl_line   : 716
    <493>   DW_AT_decl_column : 17
    <493>   DW_AT_type        : <0x1d6>
    <497>   DW_AT_data_member_location: 116
 <2><498>: Abbrev Number: 1 (DW_TAG_member)
    <499>   DW_AT_name        : (indirect string, offset: 0xe88dc): APB1SMENR1
    <49d>   DW_AT_decl_file   : 8
    <49d>   DW_AT_decl_line   : 717
    <49f>   DW_AT_decl_column : 17
    <49f>   DW_AT_type        : <0x1e2>
    <4a3>   DW_AT_data_member_location: 120
 <2><4a4>: Abbrev Number: 1 (DW_TAG_member)
    <4a5>   DW_AT_name        : (indirect string, offset: 0xe88e7): APB1SMENR2
    <4a9>   DW_AT_decl_file   : 8
    <4a9>   DW_AT_decl_line   : 718
    <4ab>   DW_AT_decl_column : 17
    <4ab>   DW_AT_type        : <0x1e2>
    <4af>   DW_AT_data_member_location: 124
 <2><4b0>: Abbrev Number: 1 (DW_TAG_member)
    <4b1>   DW_AT_name        : (indirect string, offset: 0xe8bb0): APB2SMENR
    <4b5>   DW_AT_decl_file   : 8
    <4b5>   DW_AT_decl_line   : 719
    <4b7>   DW_AT_decl_column : 17
    <4b7>   DW_AT_type        : <0x1e2>
    <4bb>   DW_AT_data_member_location: 128
 <2><4bc>: Abbrev Number: 1 (DW_TAG_member)
    <4bd>   DW_AT_name        : (indirect string, offset: 0xe8af2): RESERVED6
    <4c1>   DW_AT_decl_file   : 8
    <4c1>   DW_AT_decl_line   : 720
    <4c3>   DW_AT_decl_column : 17
    <4c3>   DW_AT_type        : <0x1d6>
    <4c7>   DW_AT_data_member_location: 132
 <2><4c8>: Abbrev Number: 1 (DW_TAG_member)
    <4c9>   DW_AT_name        : (indirect string, offset: 0xe89bc): CCIPR
    <4cd>   DW_AT_decl_file   : 8
    <4cd>   DW_AT_decl_line   : 721
    <4cf>   DW_AT_decl_column : 17
    <4cf>   DW_AT_type        : <0x1e2>
    <4d3>   DW_AT_data_member_location: 136
 <2><4d4>: Abbrev Number: 1 (DW_TAG_member)
    <4d5>   DW_AT_name        : (indirect string, offset: 0xe8c96): RESERVED7
    <4d9>   DW_AT_decl_file   : 8
    <4d9>   DW_AT_decl_line   : 722
    <4db>   DW_AT_decl_column : 17
    <4db>   DW_AT_type        : <0x1d6>
    <4df>   DW_AT_data_member_location: 140
 <2><4e0>: Abbrev Number: 1 (DW_TAG_member)
    <4e1>   DW_AT_name        : (indirect string, offset: 0xe898f): BDCR
    <4e5>   DW_AT_decl_file   : 8
    <4e5>   DW_AT_decl_line   : 723
    <4e7>   DW_AT_decl_column : 17
    <4e7>   DW_AT_type        : <0x1e2>
    <4eb>   DW_AT_data_member_location: 144
 <2><4ec>: Abbrev Number: 8 (DW_TAG_member)
    <4ed>   DW_AT_name        : CSR
    <4f1>   DW_AT_decl_file   : 8
    <4f1>   DW_AT_decl_line   : 724
    <4f3>   DW_AT_decl_column : 17
    <4f3>   DW_AT_type        : <0x1e2>
    <4f7>   DW_AT_data_member_location: 148
 <2><4f8>: Abbrev Number: 0
 <1><4f9>: Abbrev Number: 17 (DW_TAG_typedef)
    <4fa>   DW_AT_name        : (indirect string, offset: 0xe8a7e): RCC_TypeDef
    <4fe>   DW_AT_decl_file   : 8
    <4fe>   DW_AT_decl_line   : 725
    <500>   DW_AT_decl_column : 3
    <500>   DW_AT_type        : <0x329>
 <1><504>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <505>   DW_AT_encoding    : 7	(unsigned)
    <506>   DW_AT_byte_size   : 1
    <507>   DW_AT_type        : <0x183>
    <50b>   DW_AT_decl_file   : 9
    <50c>   DW_AT_decl_line   : 39
    <50d>   DW_AT_decl_column : 1
    <50e>   DW_AT_sibling     : <0x52b>
 <2><512>: Abbrev Number: 10 (DW_TAG_enumerator)
    <513>   DW_AT_name        : (indirect string, offset: 0xe89f4): HAL_OK
    <517>   DW_AT_const_value : 0
 <2><518>: Abbrev Number: 10 (DW_TAG_enumerator)
    <519>   DW_AT_name        : (indirect string, offset: 0xe8b33): HAL_ERROR
    <51d>   DW_AT_const_value : 1
 <2><51e>: Abbrev Number: 10 (DW_TAG_enumerator)
    <51f>   DW_AT_name        : (indirect string, offset: 0xe894c): HAL_BUSY
    <523>   DW_AT_const_value : 2
 <2><524>: Abbrev Number: 10 (DW_TAG_enumerator)
    <525>   DW_AT_name        : (indirect string, offset: 0xe899c): HAL_TIMEOUT
    <529>   DW_AT_const_value : 3
 <2><52a>: Abbrev Number: 0
 <1><52b>: Abbrev Number: 3 (DW_TAG_typedef)
    <52c>   DW_AT_name        : (indirect string, offset: 0xe8ca0): HAL_StatusTypeDef
    <530>   DW_AT_decl_file   : 9
    <531>   DW_AT_decl_line   : 44
    <532>   DW_AT_decl_column : 3
    <533>   DW_AT_type        : <0x504>
 <1><537>: Abbrev Number: 12 (DW_TAG_structure_type)
    <538>   DW_AT_byte_size   : 28
    <539>   DW_AT_decl_file   : 10
    <539>   DW_AT_decl_line   : 45
    <53a>   DW_AT_decl_column : 9
    <53a>   DW_AT_sibling     : <0x58c>
 <2><53e>: Abbrev Number: 2 (DW_TAG_member)
    <53f>   DW_AT_name        : (indirect string, offset: 0xe8b6f): PLLState
    <543>   DW_AT_decl_file   : 10
    <543>   DW_AT_decl_line   : 47
    <544>   DW_AT_decl_column : 12
    <544>   DW_AT_type        : <0x1d6>
    <548>   DW_AT_data_member_location: 0
 <2><549>: Abbrev Number: 2 (DW_TAG_member)
    <54a>   DW_AT_name        : (indirect string, offset: 0xe8b93): PLLSource
    <54e>   DW_AT_decl_file   : 10
    <54e>   DW_AT_decl_line   : 50
    <54f>   DW_AT_decl_column : 12
    <54f>   DW_AT_type        : <0x1d6>
    <553>   DW_AT_data_member_location: 4
 <2><554>: Abbrev Number: 2 (DW_TAG_member)
    <555>   DW_AT_name        : (indirect string, offset: 0xe8b5e): PLLM
    <559>   DW_AT_decl_file   : 10
    <559>   DW_AT_decl_line   : 53
    <55a>   DW_AT_decl_column : 12
    <55a>   DW_AT_type        : <0x1d6>
    <55e>   DW_AT_data_member_location: 8
 <2><55f>: Abbrev Number: 2 (DW_TAG_member)
    <560>   DW_AT_name        : (indirect string, offset: 0xe8be7): PLLN
    <564>   DW_AT_decl_file   : 10
    <564>   DW_AT_decl_line   : 57
    <565>   DW_AT_decl_column : 12
    <565>   DW_AT_type        : <0x1d6>
    <569>   DW_AT_data_member_location: 12
 <2><56a>: Abbrev Number: 2 (DW_TAG_member)
    <56b>   DW_AT_name        : (indirect string, offset: 0xe8bec): PLLP
    <56f>   DW_AT_decl_file   : 10
    <56f>   DW_AT_decl_line   : 61
    <570>   DW_AT_decl_column : 12
    <570>   DW_AT_type        : <0x1d6>
    <574>   DW_AT_data_member_location: 16
 <2><575>: Abbrev Number: 2 (DW_TAG_member)
    <576>   DW_AT_name        : (indirect string, offset: 0xa839d): PLLQ
    <57a>   DW_AT_decl_file   : 10
    <57a>   DW_AT_decl_line   : 65
    <57b>   DW_AT_decl_column : 12
    <57b>   DW_AT_type        : <0x1d6>
    <57f>   DW_AT_data_member_location: 20
 <2><580>: Abbrev Number: 2 (DW_TAG_member)
    <581>   DW_AT_name        : (indirect string, offset: 0xe8bf1): PLLR
    <585>   DW_AT_decl_file   : 10
    <585>   DW_AT_decl_line   : 68
    <586>   DW_AT_decl_column : 12
    <586>   DW_AT_type        : <0x1d6>
    <58a>   DW_AT_data_member_location: 24
 <2><58b>: Abbrev Number: 0
 <1><58c>: Abbrev Number: 3 (DW_TAG_typedef)
    <58d>   DW_AT_name        : (indirect string, offset: 0xe8b20): RCC_PLLInitTypeDef
    <591>   DW_AT_decl_file   : 10
    <592>   DW_AT_decl_line   : 73
    <593>   DW_AT_decl_column : 2
    <594>   DW_AT_type        : <0x537>
 <1><598>: Abbrev Number: 12 (DW_TAG_structure_type)
    <599>   DW_AT_byte_size   : 68
    <59a>   DW_AT_decl_file   : 10
    <59a>   DW_AT_decl_line   : 78
    <59b>   DW_AT_decl_column : 9
    <59b>   DW_AT_sibling     : <0x61b>
 <2><59f>: Abbrev Number: 2 (DW_TAG_member)
    <5a0>   DW_AT_name        : (indirect string, offset: 0xe8bca): OscillatorType
    <5a4>   DW_AT_decl_file   : 10
    <5a4>   DW_AT_decl_line   : 80
    <5a5>   DW_AT_decl_column : 12
    <5a5>   DW_AT_type        : <0x1d6>
    <5a9>   DW_AT_data_member_location: 0
 <2><5aa>: Abbrev Number: 2 (DW_TAG_member)
    <5ab>   DW_AT_name        : (indirect string, offset: 0xe8b78): HSEState
    <5af>   DW_AT_decl_file   : 10
    <5af>   DW_AT_decl_line   : 83
    <5b0>   DW_AT_decl_column : 12
    <5b0>   DW_AT_type        : <0x1d6>
    <5b4>   DW_AT_data_member_location: 4
 <2><5b5>: Abbrev Number: 2 (DW_TAG_member)
    <5b6>   DW_AT_name        : (indirect string, offset: 0xe8a29): LSEState
    <5ba>   DW_AT_decl_file   : 10
    <5ba>   DW_AT_decl_line   : 86
    <5bb>   DW_AT_decl_column : 12
    <5bb>   DW_AT_type        : <0x1d6>
    <5bf>   DW_AT_data_member_location: 8
 <2><5c0>: Abbrev Number: 2 (DW_TAG_member)
    <5c1>   DW_AT_name        : (indirect string, offset: 0xe8a49): HSIState
    <5c5>   DW_AT_decl_file   : 10
    <5c5>   DW_AT_decl_line   : 89
    <5c6>   DW_AT_decl_column : 12
    <5c6>   DW_AT_type        : <0x1d6>
    <5ca>   DW_AT_data_member_location: 12
 <2><5cb>: Abbrev Number: 2 (DW_TAG_member)
    <5cc>   DW_AT_name        : (indirect string, offset: 0xe8c0f): HSICalibrationValue
    <5d0>   DW_AT_decl_file   : 10
    <5d0>   DW_AT_decl_line   : 92
    <5d1>   DW_AT_decl_column : 12
    <5d1>   DW_AT_type        : <0x1d6>
    <5d5>   DW_AT_data_member_location: 16
 <2><5d6>: Abbrev Number: 2 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0xe8a04): LSIState
    <5db>   DW_AT_decl_file   : 10
    <5db>   DW_AT_decl_line   : 98
    <5dc>   DW_AT_decl_column : 12
    <5dc>   DW_AT_type        : <0x1d6>
    <5e0>   DW_AT_data_member_location: 20
 <2><5e1>: Abbrev Number: 2 (DW_TAG_member)
    <5e2>   DW_AT_name        : (indirect string, offset: 0xe89fb): MSIState
    <5e6>   DW_AT_decl_file   : 10
    <5e6>   DW_AT_decl_line   : 106
    <5e7>   DW_AT_decl_column : 12
    <5e7>   DW_AT_type        : <0x1d6>
    <5eb>   DW_AT_data_member_location: 24
 <2><5ec>: Abbrev Number: 2 (DW_TAG_member)
    <5ed>   DW_AT_name        : (indirect string, offset: 0xe89a8): MSICalibrationValue
    <5f1>   DW_AT_decl_file   : 10
    <5f1>   DW_AT_decl_line   : 109
    <5f2>   DW_AT_decl_column : 12
    <5f2>   DW_AT_type        : <0x1d6>
    <5f6>   DW_AT_data_member_location: 28
 <2><5f7>: Abbrev Number: 2 (DW_TAG_member)
    <5f8>   DW_AT_name        : (indirect string, offset: 0xe8a94): MSIClockRange
    <5fc>   DW_AT_decl_file   : 10
    <5fc>   DW_AT_decl_line   : 112
    <5fd>   DW_AT_decl_column : 12
    <5fd>   DW_AT_type        : <0x1d6>
    <601>   DW_AT_data_member_location: 32
 <2><602>: Abbrev Number: 2 (DW_TAG_member)
    <603>   DW_AT_name        : (indirect string, offset: 0xe8ba5): HSI48State
    <607>   DW_AT_decl_file   : 10
    <607>   DW_AT_decl_line   : 115
    <608>   DW_AT_decl_column : 12
    <608>   DW_AT_type        : <0x1d6>
    <60c>   DW_AT_data_member_location: 36
 <2><60d>: Abbrev Number: 26 (DW_TAG_member)
    <60e>   DW_AT_name        : PLL
    <612>   DW_AT_decl_file   : 10
    <613>   DW_AT_decl_line   : 118
    <614>   DW_AT_decl_column : 22
    <615>   DW_AT_type        : <0x58c>
    <619>   DW_AT_data_member_location: 40
 <2><61a>: Abbrev Number: 0
 <1><61b>: Abbrev Number: 3 (DW_TAG_typedef)
    <61c>   DW_AT_name        : (indirect string, offset: 0xe8aa2): RCC_OscInitTypeDef
    <620>   DW_AT_decl_file   : 10
    <621>   DW_AT_decl_line   : 120
    <622>   DW_AT_decl_column : 2
    <623>   DW_AT_type        : <0x598>
 <1><627>: Abbrev Number: 12 (DW_TAG_structure_type)
    <628>   DW_AT_byte_size   : 20
    <629>   DW_AT_decl_file   : 10
    <629>   DW_AT_decl_line   : 125
    <62a>   DW_AT_decl_column : 9
    <62a>   DW_AT_sibling     : <0x666>
 <2><62e>: Abbrev Number: 2 (DW_TAG_member)
    <62f>   DW_AT_name        : (indirect string, offset: 0xe89c2): ClockType
    <633>   DW_AT_decl_file   : 10
    <633>   DW_AT_decl_line   : 127
    <634>   DW_AT_decl_column : 12
    <634>   DW_AT_type        : <0x1d6>
    <638>   DW_AT_data_member_location: 0
 <2><639>: Abbrev Number: 2 (DW_TAG_member)
    <63a>   DW_AT_name        : (indirect string, offset: 0xe8b08): SYSCLKSource
    <63e>   DW_AT_decl_file   : 10
    <63e>   DW_AT_decl_line   : 130
    <63f>   DW_AT_decl_column : 12
    <63f>   DW_AT_type        : <0x1d6>
    <643>   DW_AT_data_member_location: 4
 <2><644>: Abbrev Number: 2 (DW_TAG_member)
    <645>   DW_AT_name        : (indirect string, offset: 0xe8bd9): AHBCLKDivider
    <649>   DW_AT_decl_file   : 10
    <649>   DW_AT_decl_line   : 133
    <64a>   DW_AT_decl_column : 12
    <64a>   DW_AT_type        : <0x1d6>
    <64e>   DW_AT_data_member_location: 8
 <2><64f>: Abbrev Number: 2 (DW_TAG_member)
    <650>   DW_AT_name        : (indirect string, offset: 0xe891d): APB1CLKDivider
    <654>   DW_AT_decl_file   : 10
    <654>   DW_AT_decl_line   : 136
    <655>   DW_AT_decl_column : 12
    <655>   DW_AT_type        : <0x1d6>
    <659>   DW_AT_data_member_location: 12
 <2><65a>: Abbrev Number: 2 (DW_TAG_member)
    <65b>   DW_AT_name        : (indirect string, offset: 0xe8a5a): APB2CLKDivider
    <65f>   DW_AT_decl_file   : 10
    <65f>   DW_AT_decl_line   : 139
    <660>   DW_AT_decl_column : 12
    <660>   DW_AT_type        : <0x1d6>
    <664>   DW_AT_data_member_location: 16
 <2><665>: Abbrev Number: 0
 <1><666>: Abbrev Number: 3 (DW_TAG_typedef)
    <667>   DW_AT_name        : (indirect string, offset: 0xe89cc): RCC_ClkInitTypeDef
    <66b>   DW_AT_decl_file   : 10
    <66c>   DW_AT_decl_line   : 142
    <66d>   DW_AT_decl_column : 2
    <66e>   DW_AT_type        : <0x627>
 <1><672>: Abbrev Number: 6 (DW_TAG_const_type)
    <673>   DW_AT_type        : <0x666>
 <1><677>: Abbrev Number: 15 (DW_TAG_array_type)
    <678>   DW_AT_type        : <0x1d1>
    <67c>   DW_AT_sibling     : <0x687>
 <2><680>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <681>   DW_AT_type        : <0x15b>
    <685>   DW_AT_upper_bound : 6
 <2><686>: Abbrev Number: 0
 <1><687>: Abbrev Number: 6 (DW_TAG_const_type)
    <688>   DW_AT_type        : <0x677>
 <1><68c>: Abbrev Number: 9 (DW_TAG_variable)
    <68d>   DW_AT_name        : (indirect string, offset: 0x2d6ad): CHANNEL_OFFSET_TAB
    <691>   DW_AT_decl_file   : 12
    <692>   DW_AT_decl_line   : 49
    <693>   DW_AT_decl_column : 22
    <694>   DW_AT_type        : <0x687>
    <698>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><69e>: Abbrev Number: 11 (DW_TAG_subprogram)
    <69f>   DW_AT_external    : 1
    <69f>   DW_AT_name        : (indirect string, offset: 0xe8bf6): HAL_RCC_ClockConfig
    <6a3>   DW_AT_decl_file   : 10
    <6a4>   DW_AT_decl_line   : 4837
    <6a6>   DW_AT_decl_column : 19
    <6a7>   DW_AT_prototyped  : 1
    <6a7>   DW_AT_type        : <0x52b>
    <6ab>   DW_AT_declaration : 1
    <6ab>   DW_AT_sibling     : <0x6ba>
 <2><6af>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <6b0>   DW_AT_type        : <0x6ba>
 <2><6b4>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <6b5>   DW_AT_type        : <0x1d6>
 <2><6b9>: Abbrev Number: 0
 <1><6ba>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6bb>   DW_AT_byte_size   : 4
    <6bb>   DW_AT_type        : <0x672>
 <1><6bf>: Abbrev Number: 11 (DW_TAG_subprogram)
    <6c0>   DW_AT_external    : 1
    <6c0>   DW_AT_name        : (indirect string, offset: 0xe8b81): HAL_RCC_OscConfig
    <6c4>   DW_AT_decl_file   : 10
    <6c5>   DW_AT_decl_line   : 4836
    <6c7>   DW_AT_decl_column : 19
    <6c8>   DW_AT_prototyped  : 1
    <6c8>   DW_AT_type        : <0x52b>
    <6cc>   DW_AT_declaration : 1
    <6cc>   DW_AT_sibling     : <0x6d6>
 <2><6d0>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <6d1>   DW_AT_type        : <0x6d6>
 <2><6d5>: Abbrev Number: 0
 <1><6d6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6d7>   DW_AT_byte_size   : 4
    <6d7>   DW_AT_type        : <0x61b>
 <1><6db>: Abbrev Number: 11 (DW_TAG_subprogram)
    <6dc>   DW_AT_external    : 1
    <6dc>   DW_AT_name        : (indirect string, offset: 0xe892c): HAL_PWREx_ControlVoltageScaling
    <6e0>   DW_AT_decl_file   : 11
    <6e1>   DW_AT_decl_line   : 837
    <6e3>   DW_AT_decl_column : 19
    <6e4>   DW_AT_prototyped  : 1
    <6e4>   DW_AT_type        : <0x52b>
    <6e8>   DW_AT_declaration : 1
    <6e8>   DW_AT_sibling     : <0x6f2>
 <2><6ec>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <6ed>   DW_AT_type        : <0x1d6>
 <2><6f1>: Abbrev Number: 0
 <1><6f2>: Abbrev Number: 27 (DW_TAG_subprogram)
    <6f3>   DW_AT_external    : 1
    <6f3>   DW_AT_name        : (indirect string, offset: 0xe8add): vTaskDelay
    <6f7>   DW_AT_decl_file   : 7
    <6f8>   DW_AT_decl_line   : 859
    <6fa>   DW_AT_decl_column : 6
    <6fb>   DW_AT_prototyped  : 1
    <6fb>   DW_AT_declaration : 1
    <6fb>   DW_AT_sibling     : <0x705>
 <2><6ff>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <700>   DW_AT_type        : <0x24b>
 <2><704>: Abbrev Number: 0
 <1><705>: Abbrev Number: 11 (DW_TAG_subprogram)
    <706>   DW_AT_external    : 1
    <706>   DW_AT_name        : (indirect string, offset: 0xe8afc): xTaskCreate
    <70a>   DW_AT_decl_file   : 7
    <70b>   DW_AT_decl_line   : 385
    <70d>   DW_AT_decl_column : 16
    <70e>   DW_AT_prototyped  : 1
    <70e>   DW_AT_type        : <0x227>
    <712>   DW_AT_declaration : 1
    <712>   DW_AT_sibling     : <0x735>
 <2><716>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <717>   DW_AT_type        : <0x1f3>
 <2><71b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <71c>   DW_AT_type        : <0x26b>
 <2><720>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <721>   DW_AT_type        : <0x222>
 <2><725>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <726>   DW_AT_type        : <0x211>
 <2><72a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <72b>   DW_AT_type        : <0x233>
 <2><72f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <730>   DW_AT_type        : <0x73a>
 <2><734>: Abbrev Number: 0
 <1><735>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <736>   DW_AT_byte_size   : 4
    <736>   DW_AT_type        : <0x250>
 <1><73a>: Abbrev Number: 6 (DW_TAG_const_type)
    <73b>   DW_AT_type        : <0x735>
 <1><73f>: Abbrev Number: 18 (DW_TAG_subprogram)
    <740>   DW_AT_external    : 1
    <740>   DW_AT_name        : (indirect string, offset: 0x6454e): vApplicationTickHook
    <744>   DW_AT_decl_file   : 7
    <744>   DW_AT_decl_line   : 1986
    <746>   DW_AT_decl_column : 10
    <747>   DW_AT_prototyped  : 1
    <747>   DW_AT_declaration : 1
 <1><747>: Abbrev Number: 18 (DW_TAG_subprogram)
    <748>   DW_AT_external    : 1
    <748>   DW_AT_name        : (indirect string, offset: 0xe8ac9): vTaskStartScheduler
    <74c>   DW_AT_decl_file   : 7
    <74c>   DW_AT_decl_line   : 1520
    <74e>   DW_AT_decl_column : 6
    <74f>   DW_AT_prototyped  : 1
    <74f>   DW_AT_declaration : 1
 <1><74f>: Abbrev Number: 28 (DW_TAG_subprogram)
    <750>   DW_AT_external    : 1
    <750>   DW_AT_name        : (indirect string, offset: 0xe8c5b): HAL_Init
    <754>   DW_AT_decl_file   : 13
    <755>   DW_AT_decl_line   : 636
    <757>   DW_AT_decl_column : 19
    <758>   DW_AT_prototyped  : 1
    <758>   DW_AT_type        : <0x52b>
    <75c>   DW_AT_declaration : 1
 <1><75c>: Abbrev Number: 29 (DW_TAG_subprogram)
    <75d>   DW_AT_external    : 1
    <75d>   DW_AT_name        : (indirect string, offset: 0xe8a3b): Error_Handler
    <761>   DW_AT_decl_file   : 1
    <762>   DW_AT_decl_line   : 92
    <763>   DW_AT_decl_column : 6
    <764>   DW_AT_prototyped  : 1
    <764>   DW_AT_low_pc      : 0x8000744
    <768>   DW_AT_high_pc     : 0xc
    <76c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <76e>   DW_AT_call_all_calls: 1
    <76e>   DW_AT_sibling     : <0x783>
 <2><772>: Abbrev Number: 30 (DW_TAG_inlined_subroutine)
    <773>   DW_AT_abstract_origin: <0x841>
    <777>   DW_AT_low_pc      : 0x8000748
    <77b>   DW_AT_high_pc     : 0x4
    <77f>   DW_AT_call_file   : 1
    <780>   DW_AT_call_line   : 94
    <781>   DW_AT_call_column : 3
 <2><782>: Abbrev Number: 0
 <1><783>: Abbrev Number: 19 (DW_TAG_subprogram)
    <784>   DW_AT_external    : 1
    <784>   DW_AT_name        : (indirect string, offset: 0xe8c2b): SystemClock_Config
    <788>   DW_AT_decl_file   : 1
    <788>   DW_AT_decl_line   : 51
    <789>   DW_AT_decl_column : 6
    <789>   DW_AT_prototyped  : 1
    <789>   DW_AT_low_pc      : 0x80006a0
    <78d>   DW_AT_high_pc     : 0xa4
    <791>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <793>   DW_AT_call_all_tail_calls: 1
    <793>   DW_AT_sibling     : <0x7b8>
 <2><797>: Abbrev Number: 9 (DW_TAG_variable)
    <798>   DW_AT_name        : (indirect string, offset: 0xe8969): RCC_OscInitStruct
    <79c>   DW_AT_decl_file   : 1
    <79d>   DW_AT_decl_line   : 53
    <79e>   DW_AT_decl_column : 22
    <79f>   DW_AT_type        : <0x61b>
    <7a3>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><7a7>: Abbrev Number: 9 (DW_TAG_variable)
    <7a8>   DW_AT_name        : (indirect string, offset: 0xe8a17): RCC_ClkInitStruct
    <7ac>   DW_AT_decl_file   : 1
    <7ad>   DW_AT_decl_line   : 54
    <7ae>   DW_AT_decl_column : 22
    <7af>   DW_AT_type        : <0x666>
    <7b3>   DW_AT_location    : 3 byte block: 91 a0 7f 	(DW_OP_fbreg: -96)
 <2><7b7>: Abbrev Number: 0
 <1><7b8>: Abbrev Number: 31 (DW_TAG_subprogram)
    <7b9>   DW_AT_external    : 1
    <7b9>   DW_AT_name        : (indirect string, offset: 0xe8b3d): GPIOPortAConfig
    <7bd>   DW_AT_decl_file   : 1
    <7be>   DW_AT_decl_line   : 45
    <7bf>   DW_AT_decl_column : 6
    <7c0>   DW_AT_prototyped  : 1
    <7c0>   DW_AT_low_pc      : 0x8000660
    <7c4>   DW_AT_high_pc     : 0x40
    <7c8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7ca>   DW_AT_call_all_calls: 1
 <1><7ca>: Abbrev Number: 19 (DW_TAG_subprogram)
    <7cb>   DW_AT_external    : 1
    <7cb>   DW_AT_name        : (indirect string, offset: 0xe8b15): vHeartbeat
    <7cf>   DW_AT_decl_file   : 1
    <7cf>   DW_AT_decl_line   : 34
    <7d0>   DW_AT_decl_column : 6
    <7d0>   DW_AT_prototyped  : 1
    <7d0>   DW_AT_low_pc      : 0x800051c
    <7d4>   DW_AT_high_pc     : 0x142
    <7d8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7da>   DW_AT_call_all_tail_calls: 1
    <7da>   DW_AT_sibling     : <0x7fd>
 <2><7de>: Abbrev Number: 32 (DW_TAG_formal_parameter)
    <7df>   DW_AT_name        : (indirect string, offset: 0xe88f2): pvParameters
    <7e3>   DW_AT_decl_file   : 1
    <7e4>   DW_AT_decl_line   : 34
    <7e5>   DW_AT_decl_column : 23
    <7e6>   DW_AT_type        : <0x20f>
    <7ea>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><7ed>: Abbrev Number: 9 (DW_TAG_variable)
    <7ee>   DW_AT_name        : (indirect string, offset: 0xe8ccb): rate
    <7f2>   DW_AT_decl_file   : 1
    <7f3>   DW_AT_decl_line   : 35
    <7f4>   DW_AT_decl_column : 12
    <7f5>   DW_AT_type        : <0x7fd>
    <7f9>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><7fc>: Abbrev Number: 0
 <1><7fd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <7fe>   DW_AT_byte_size   : 4
    <7fe>   DW_AT_type        : <0x1d6>
 <1><802>: Abbrev Number: 33 (DW_TAG_subprogram)
    <803>   DW_AT_name        : (indirect string, offset: 0xe8980): prvCreateTasks
    <807>   DW_AT_decl_file   : 1
    <808>   DW_AT_decl_line   : 28
    <809>   DW_AT_decl_column : 13
    <80a>   DW_AT_prototyped  : 1
    <80a>   DW_AT_low_pc      : 0x80004f0
    <80e>   DW_AT_high_pc     : 0x2c
    <812>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <814>   DW_AT_call_all_tail_calls: 1
    <814>   DW_AT_sibling     : <0x82b>
 <2><818>: Abbrev Number: 9 (DW_TAG_variable)
    <819>   DW_AT_name        : (indirect string, offset: 0xe8ccb): rate
    <81d>   DW_AT_decl_file   : 1
    <81e>   DW_AT_decl_line   : 29
    <81f>   DW_AT_decl_column : 18
    <820>   DW_AT_type        : <0x1d6>
    <824>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <2><82a>: Abbrev Number: 0
 <1><82b>: Abbrev Number: 34 (DW_TAG_subprogram)
    <82c>   DW_AT_external    : 1
    <82c>   DW_AT_name        : (indirect string, offset: 0xe8907): main
    <830>   DW_AT_decl_file   : 1
    <831>   DW_AT_decl_line   : 13
    <832>   DW_AT_decl_column : 5
    <833>   DW_AT_prototyped  : 1
    <833>   DW_AT_type        : <0x154>
    <837>   DW_AT_low_pc      : 0x80004d2
    <83b>   DW_AT_high_pc     : 0x1e
    <83f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <841>   DW_AT_call_all_tail_calls: 1
 <1><841>: Abbrev Number: 35 (DW_TAG_subprogram)
    <842>   DW_AT_name        : (indirect string, offset: 0xe8ab5): __disable_irq
    <846>   DW_AT_decl_file   : 2
    <847>   DW_AT_decl_line   : 207
    <848>   DW_AT_decl_column : 27
    <849>   DW_AT_prototyped  : 1
    <849>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><84a>: Abbrev Number: 0
  Compilation Unit @ offset 0x84b:
   Length:        0x2fd (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x30e
   Pointer Size:  4
 <0><857>: Abbrev Number: 7 (DW_TAG_compile_unit)
    <858>   DW_AT_producer    : (indirect string, offset: 0x3c767): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <85c>   DW_AT_language    : 29	(C11)
    <85d>   DW_AT_name        : (indirect string, offset: 0xe8ce3): ../Core/Src/stm32l4xx_hal_msp.c
    <861>   DW_AT_comp_dir    : (indirect string, offset: 0x7fb10): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <865>   DW_AT_ranges      : 0x58
    <869>   DW_AT_low_pc      : 0
    <86d>   DW_AT_stmt_list   : 0x1086
    <871>   DW_AT_macros      : 0x25088
 <1><875>: Abbrev Number: 2 (DW_TAG_base_type)
    <876>   DW_AT_byte_size   : 1
    <877>   DW_AT_encoding    : 6	(signed char)
    <878>   DW_AT_name        : (indirect string, offset: 0x751ec): signed char
 <1><87c>: Abbrev Number: 3 (DW_TAG_typedef)
    <87d>   DW_AT_name        : (indirect string, offset: 0x4354d): __uint8_t
    <881>   DW_AT_decl_file   : 2
    <882>   DW_AT_decl_line   : 43
    <883>   DW_AT_decl_column : 24
    <884>   DW_AT_type        : <0x888>
 <1><888>: Abbrev Number: 2 (DW_TAG_base_type)
    <889>   DW_AT_byte_size   : 1
    <88a>   DW_AT_encoding    : 8	(unsigned char)
    <88b>   DW_AT_name        : (indirect string, offset: 0xdfda1): unsigned char
 <1><88f>: Abbrev Number: 2 (DW_TAG_base_type)
    <890>   DW_AT_byte_size   : 2
    <891>   DW_AT_encoding    : 5	(signed)
    <892>   DW_AT_name        : (indirect string, offset: 0xac250): short int
 <1><896>: Abbrev Number: 2 (DW_TAG_base_type)
    <897>   DW_AT_byte_size   : 2
    <898>   DW_AT_encoding    : 7	(unsigned)
    <899>   DW_AT_name        : (indirect string, offset: 0xde34b): short unsigned int
 <1><89d>: Abbrev Number: 2 (DW_TAG_base_type)
    <89e>   DW_AT_byte_size   : 4
    <89f>   DW_AT_encoding    : 5	(signed)
    <8a0>   DW_AT_name        : (indirect string, offset: 0x135b8): long int
 <1><8a4>: Abbrev Number: 3 (DW_TAG_typedef)
    <8a5>   DW_AT_name        : (indirect string, offset: 0xe8b4d): __uint32_t
    <8a9>   DW_AT_decl_file   : 2
    <8aa>   DW_AT_decl_line   : 79
    <8ab>   DW_AT_decl_column : 25
    <8ac>   DW_AT_type        : <0x8b0>
 <1><8b0>: Abbrev Number: 2 (DW_TAG_base_type)
    <8b1>   DW_AT_byte_size   : 4
    <8b2>   DW_AT_encoding    : 7	(unsigned)
    <8b3>   DW_AT_name        : (indirect string, offset: 0x58285): long unsigned int
 <1><8b7>: Abbrev Number: 2 (DW_TAG_base_type)
    <8b8>   DW_AT_byte_size   : 8
    <8b9>   DW_AT_encoding    : 5	(signed)
    <8ba>   DW_AT_name        : (indirect string, offset: 0x69985): long long int
 <1><8be>: Abbrev Number: 2 (DW_TAG_base_type)
    <8bf>   DW_AT_byte_size   : 8
    <8c0>   DW_AT_encoding    : 7	(unsigned)
    <8c1>   DW_AT_name        : (indirect string, offset: 0x3004c): long long unsigned int
 <1><8c5>: Abbrev Number: 8 (DW_TAG_base_type)
    <8c6>   DW_AT_byte_size   : 4
    <8c7>   DW_AT_encoding    : 5	(signed)
    <8c8>   DW_AT_name        : int
 <1><8cc>: Abbrev Number: 2 (DW_TAG_base_type)
    <8cd>   DW_AT_byte_size   : 4
    <8ce>   DW_AT_encoding    : 7	(unsigned)
    <8cf>   DW_AT_name        : (indirect string, offset: 0x12ac1): unsigned int
 <1><8d3>: Abbrev Number: 3 (DW_TAG_typedef)
    <8d4>   DW_AT_name        : (indirect string, offset: 0x4354f): uint8_t
    <8d8>   DW_AT_decl_file   : 3
    <8d9>   DW_AT_decl_line   : 24
    <8da>   DW_AT_decl_column : 19
    <8db>   DW_AT_type        : <0x87c>
 <1><8df>: Abbrev Number: 5 (DW_TAG_const_type)
    <8e0>   DW_AT_type        : <0x8d3>
 <1><8e4>: Abbrev Number: 3 (DW_TAG_typedef)
    <8e5>   DW_AT_name        : (indirect string, offset: 0xa82d1): uint32_t
    <8e9>   DW_AT_decl_file   : 3
    <8ea>   DW_AT_decl_line   : 48
    <8eb>   DW_AT_decl_column : 20
    <8ec>   DW_AT_type        : <0x8a4>
 <1><8f0>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <8f1>   DW_AT_type        : <0x8e4>
 <1><8f5>: Abbrev Number: 10 (DW_TAG_structure_type)
    <8f6>   DW_AT_byte_size   : 152
    <8f7>   DW_AT_decl_file   : 4
    <8f8>   DW_AT_decl_line   : 685
    <8fa>   DW_AT_decl_column : 9
    <8fb>   DW_AT_sibling     : <0xac7>
 <2><8ff>: Abbrev Number: 6 (DW_TAG_member)
    <900>   DW_AT_name        : CR
    <903>   DW_AT_decl_file   : 4
    <903>   DW_AT_decl_line   : 687
    <905>   DW_AT_decl_column : 17
    <905>   DW_AT_type        : <0x8f0>
    <909>   DW_AT_data_member_location: 0
 <2><90a>: Abbrev Number: 1 (DW_TAG_member)
    <90b>   DW_AT_name        : (indirect string, offset: 0xe8ac3): ICSCR
    <90f>   DW_AT_decl_file   : 4
    <90f>   DW_AT_decl_line   : 688
    <911>   DW_AT_decl_column : 17
    <911>   DW_AT_type        : <0x8f0>
    <915>   DW_AT_data_member_location: 4
 <2><916>: Abbrev Number: 1 (DW_TAG_member)
    <917>   DW_AT_name        : (indirect string, offset: 0xe89ef): CFGR
    <91b>   DW_AT_decl_file   : 4
    <91b>   DW_AT_decl_line   : 689
    <91d>   DW_AT_decl_column : 17
    <91d>   DW_AT_type        : <0x8f0>
    <921>   DW_AT_data_member_location: 8
 <2><922>: Abbrev Number: 1 (DW_TAG_member)
    <923>   DW_AT_name        : (indirect string, offset: 0xe8b9d): PLLCFGR
    <927>   DW_AT_decl_file   : 4
    <927>   DW_AT_decl_line   : 690
    <929>   DW_AT_decl_column : 17
    <929>   DW_AT_type        : <0x8f0>
    <92d>   DW_AT_data_member_location: 12
 <2><92e>: Abbrev Number: 1 (DW_TAG_member)
    <92f>   DW_AT_name        : (indirect string, offset: 0xe89e8): PLLSAI1CFGR
    <933>   DW_AT_decl_file   : 4
    <933>   DW_AT_decl_line   : 691
    <935>   DW_AT_decl_column : 17
    <935>   DW_AT_type        : <0x8f0>
    <939>   DW_AT_data_member_location: 16
 <2><93a>: Abbrev Number: 1 (DW_TAG_member)
    <93b>   DW_AT_name        : (indirect string, offset: 0xe8b63): PLLSAI2CFGR
    <93f>   DW_AT_decl_file   : 4
    <93f>   DW_AT_decl_line   : 692
    <941>   DW_AT_decl_column : 17
    <941>   DW_AT_type        : <0x8f0>
    <945>   DW_AT_data_member_location: 20
 <2><946>: Abbrev Number: 1 (DW_TAG_member)
    <947>   DW_AT_name        : (indirect string, offset: 0xe88c5): CIER
    <94b>   DW_AT_decl_file   : 4
    <94b>   DW_AT_decl_line   : 693
    <94d>   DW_AT_decl_column : 17
    <94d>   DW_AT_type        : <0x8f0>
    <951>   DW_AT_data_member_location: 24
 <2><952>: Abbrev Number: 1 (DW_TAG_member)
    <953>   DW_AT_name        : (indirect string, offset: 0xe88c0): CIFR
    <957>   DW_AT_decl_file   : 4
    <957>   DW_AT_decl_line   : 694
    <959>   DW_AT_decl_column : 17
    <959>   DW_AT_type        : <0x8f0>
    <95d>   DW_AT_data_member_location: 28
 <2><95e>: Abbrev Number: 1 (DW_TAG_member)
    <95f>   DW_AT_name        : (indirect string, offset: 0xe88b6): CICR
    <963>   DW_AT_decl_file   : 4
    <963>   DW_AT_decl_line   : 695
    <965>   DW_AT_decl_column : 17
    <965>   DW_AT_type        : <0x8f0>
    <969>   DW_AT_data_member_location: 32
 <2><96a>: Abbrev Number: 1 (DW_TAG_member)
    <96b>   DW_AT_name        : (indirect string, offset: 0xe8c64): RESERVED0
    <96f>   DW_AT_decl_file   : 4
    <96f>   DW_AT_decl_line   : 696
    <971>   DW_AT_decl_column : 17
    <971>   DW_AT_type        : <0x8e4>
    <975>   DW_AT_data_member_location: 36
 <2><976>: Abbrev Number: 1 (DW_TAG_member)
    <977>   DW_AT_name        : (indirect string, offset: 0xe8bc1): AHB1RSTR
    <97b>   DW_AT_decl_file   : 4
    <97b>   DW_AT_decl_line   : 697
    <97d>   DW_AT_decl_column : 17
    <97d>   DW_AT_type        : <0x8f0>
    <981>   DW_AT_data_member_location: 40
 <2><982>: Abbrev Number: 1 (DW_TAG_member)
    <983>   DW_AT_name        : (indirect string, offset: 0xe890c): AHB2RSTR
    <987>   DW_AT_decl_file   : 4
    <987>   DW_AT_decl_line   : 698
    <989>   DW_AT_decl_column : 17
    <989>   DW_AT_type        : <0x8f0>
    <98d>   DW_AT_data_member_location: 44
 <2><98e>: Abbrev Number: 1 (DW_TAG_member)
    <98f>   DW_AT_name        : (indirect string, offset: 0xe89df): AHB3RSTR
    <993>   DW_AT_decl_file   : 4
    <993>   DW_AT_decl_line   : 699
    <995>   DW_AT_decl_column : 17
    <995>   DW_AT_type        : <0x8f0>
    <999>   DW_AT_data_member_location: 48
 <2><99a>: Abbrev Number: 1 (DW_TAG_member)
    <99b>   DW_AT_name        : (indirect string, offset: 0xe8c6e): RESERVED1
    <99f>   DW_AT_decl_file   : 4
    <99f>   DW_AT_decl_line   : 700
    <9a1>   DW_AT_decl_column : 17
    <9a1>   DW_AT_type        : <0x8e4>
    <9a5>   DW_AT_data_member_location: 52
 <2><9a6>: Abbrev Number: 1 (DW_TAG_member)
    <9a7>   DW_AT_name        : (indirect string, offset: 0xe8955): APB1RSTR1
    <9ab>   DW_AT_decl_file   : 4
    <9ab>   DW_AT_decl_line   : 701
    <9ad>   DW_AT_decl_column : 17
    <9ad>   DW_AT_type        : <0x8f0>
    <9b1>   DW_AT_data_member_location: 56
 <2><9b2>: Abbrev Number: 1 (DW_TAG_member)
    <9b3>   DW_AT_name        : (indirect string, offset: 0xe895f): APB1RSTR2
    <9b7>   DW_AT_decl_file   : 4
    <9b7>   DW_AT_decl_line   : 702
    <9b9>   DW_AT_decl_column : 17
    <9b9>   DW_AT_type        : <0x8f0>
    <9bd>   DW_AT_data_member_location: 60
 <2><9be>: Abbrev Number: 1 (DW_TAG_member)
    <9bf>   DW_AT_name        : (indirect string, offset: 0xe8a32): APB2RSTR
    <9c3>   DW_AT_decl_file   : 4
    <9c3>   DW_AT_decl_line   : 703
    <9c5>   DW_AT_decl_column : 17
    <9c5>   DW_AT_type        : <0x8f0>
    <9c9>   DW_AT_data_member_location: 64
 <2><9ca>: Abbrev Number: 1 (DW_TAG_member)
    <9cb>   DW_AT_name        : (indirect string, offset: 0xe8c78): RESERVED2
    <9cf>   DW_AT_decl_file   : 4
    <9cf>   DW_AT_decl_line   : 704
    <9d1>   DW_AT_decl_column : 17
    <9d1>   DW_AT_type        : <0x8e4>
    <9d5>   DW_AT_data_member_location: 68
 <2><9d6>: Abbrev Number: 1 (DW_TAG_member)
    <9d7>   DW_AT_name        : (indirect string, offset: 0xe88ff): AHB1ENR
    <9db>   DW_AT_decl_file   : 4
    <9db>   DW_AT_decl_line   : 705
    <9dd>   DW_AT_decl_column : 17
    <9dd>   DW_AT_type        : <0x8f0>
    <9e1>   DW_AT_data_member_location: 72
 <2><9e2>: Abbrev Number: 1 (DW_TAG_member)
    <9e3>   DW_AT_name        : (indirect string, offset: 0xe8994): AHB2ENR
    <9e7>   DW_AT_decl_file   : 4
    <9e7>   DW_AT_decl_line   : 706
    <9e9>   DW_AT_decl_column : 17
    <9e9>   DW_AT_type        : <0x8f0>
    <9ed>   DW_AT_data_member_location: 76
 <2><9ee>: Abbrev Number: 1 (DW_TAG_member)
    <9ef>   DW_AT_name        : (indirect string, offset: 0xe8a52): AHB3ENR
    <9f3>   DW_AT_decl_file   : 4
    <9f3>   DW_AT_decl_line   : 707
    <9f5>   DW_AT_decl_column : 17
    <9f5>   DW_AT_type        : <0x8f0>
    <9f9>   DW_AT_data_member_location: 80
 <2><9fa>: Abbrev Number: 1 (DW_TAG_member)
    <9fb>   DW_AT_name        : (indirect string, offset: 0xe8c82): RESERVED3
    <9ff>   DW_AT_decl_file   : 4
    <9ff>   DW_AT_decl_line   : 708
    <a01>   DW_AT_decl_column : 17
    <a01>   DW_AT_type        : <0x8e4>
    <a05>   DW_AT_data_member_location: 84
 <2><a06>: Abbrev Number: 1 (DW_TAG_member)
    <a07>   DW_AT_name        : (indirect string, offset: 0xe88ca): APB1ENR1
    <a0b>   DW_AT_decl_file   : 4
    <a0b>   DW_AT_decl_line   : 709
    <a0d>   DW_AT_decl_column : 17
    <a0d>   DW_AT_type        : <0x8f0>
    <a11>   DW_AT_data_member_location: 88
 <2><a12>: Abbrev Number: 1 (DW_TAG_member)
    <a13>   DW_AT_name        : (indirect string, offset: 0xe88d3): APB1ENR2
    <a17>   DW_AT_decl_file   : 4
    <a17>   DW_AT_decl_line   : 710
    <a19>   DW_AT_decl_column : 17
    <a19>   DW_AT_type        : <0x8f0>
    <a1d>   DW_AT_data_member_location: 92
 <2><a1e>: Abbrev Number: 1 (DW_TAG_member)
    <a1f>   DW_AT_name        : (indirect string, offset: 0xe8915): APB2ENR
    <a23>   DW_AT_decl_file   : 4
    <a23>   DW_AT_decl_line   : 711
    <a25>   DW_AT_decl_column : 17
    <a25>   DW_AT_type        : <0x8f0>
    <a29>   DW_AT_data_member_location: 96
 <2><a2a>: Abbrev Number: 1 (DW_TAG_member)
    <a2b>   DW_AT_name        : (indirect string, offset: 0xe8ae8): RESERVED4
    <a2f>   DW_AT_decl_file   : 4
    <a2f>   DW_AT_decl_line   : 712
    <a31>   DW_AT_decl_column : 17
    <a31>   DW_AT_type        : <0x8e4>
    <a35>   DW_AT_data_member_location: 100
 <2><a36>: Abbrev Number: 1 (DW_TAG_member)
    <a37>   DW_AT_name        : (indirect string, offset: 0xe8a69): AHB1SMENR
    <a3b>   DW_AT_decl_file   : 4
    <a3b>   DW_AT_decl_line   : 713
    <a3d>   DW_AT_decl_column : 17
    <a3d>   DW_AT_type        : <0x8f0>
    <a41>   DW_AT_data_member_location: 104
 <2><a42>: Abbrev Number: 1 (DW_TAG_member)
    <a43>   DW_AT_name        : (indirect string, offset: 0xe8c51): AHB2SMENR
    <a47>   DW_AT_decl_file   : 4
    <a47>   DW_AT_decl_line   : 714
    <a49>   DW_AT_decl_column : 17
    <a49>   DW_AT_type        : <0x8f0>
    <a4d>   DW_AT_data_member_location: 108
 <2><a4e>: Abbrev Number: 1 (DW_TAG_member)
    <a4f>   DW_AT_name        : (indirect string, offset: 0xe8a0d): AHB3SMENR
    <a53>   DW_AT_decl_file   : 4
    <a53>   DW_AT_decl_line   : 715
    <a55>   DW_AT_decl_column : 17
    <a55>   DW_AT_type        : <0x8f0>
    <a59>   DW_AT_data_member_location: 112
 <2><a5a>: Abbrev Number: 1 (DW_TAG_member)
    <a5b>   DW_AT_name        : (indirect string, offset: 0xe8c8c): RESERVED5
    <a5f>   DW_AT_decl_file   : 4
    <a5f>   DW_AT_decl_line   : 716
    <a61>   DW_AT_decl_column : 17
    <a61>   DW_AT_type        : <0x8e4>
    <a65>   DW_AT_data_member_location: 116
 <2><a66>: Abbrev Number: 1 (DW_TAG_member)
    <a67>   DW_AT_name        : (indirect string, offset: 0xe88dc): APB1SMENR1
    <a6b>   DW_AT_decl_file   : 4
    <a6b>   DW_AT_decl_line   : 717
    <a6d>   DW_AT_decl_column : 17
    <a6d>   DW_AT_type        : <0x8f0>
    <a71>   DW_AT_data_member_location: 120
 <2><a72>: Abbrev Number: 1 (DW_TAG_member)
    <a73>   DW_AT_name        : (indirect string, offset: 0xe88e7): APB1SMENR2
    <a77>   DW_AT_decl_file   : 4
    <a77>   DW_AT_decl_line   : 718
    <a79>   DW_AT_decl_column : 17
    <a79>   DW_AT_type        : <0x8f0>
    <a7d>   DW_AT_data_member_location: 124
 <2><a7e>: Abbrev Number: 1 (DW_TAG_member)
    <a7f>   DW_AT_name        : (indirect string, offset: 0xe8bb0): APB2SMENR
    <a83>   DW_AT_decl_file   : 4
    <a83>   DW_AT_decl_line   : 719
    <a85>   DW_AT_decl_column : 17
    <a85>   DW_AT_type        : <0x8f0>
    <a89>   DW_AT_data_member_location: 128
 <2><a8a>: Abbrev Number: 1 (DW_TAG_member)
    <a8b>   DW_AT_name        : (indirect string, offset: 0xe8af2): RESERVED6
    <a8f>   DW_AT_decl_file   : 4
    <a8f>   DW_AT_decl_line   : 720
    <a91>   DW_AT_decl_column : 17
    <a91>   DW_AT_type        : <0x8e4>
    <a95>   DW_AT_data_member_location: 132
 <2><a96>: Abbrev Number: 1 (DW_TAG_member)
    <a97>   DW_AT_name        : (indirect string, offset: 0xe89bc): CCIPR
    <a9b>   DW_AT_decl_file   : 4
    <a9b>   DW_AT_decl_line   : 721
    <a9d>   DW_AT_decl_column : 17
    <a9d>   DW_AT_type        : <0x8f0>
    <aa1>   DW_AT_data_member_location: 136
 <2><aa2>: Abbrev Number: 1 (DW_TAG_member)
    <aa3>   DW_AT_name        : (indirect string, offset: 0xe8c96): RESERVED7
    <aa7>   DW_AT_decl_file   : 4
    <aa7>   DW_AT_decl_line   : 722
    <aa9>   DW_AT_decl_column : 17
    <aa9>   DW_AT_type        : <0x8e4>
    <aad>   DW_AT_data_member_location: 140
 <2><aae>: Abbrev Number: 1 (DW_TAG_member)
    <aaf>   DW_AT_name        : (indirect string, offset: 0xe898f): BDCR
    <ab3>   DW_AT_decl_file   : 4
    <ab3>   DW_AT_decl_line   : 723
    <ab5>   DW_AT_decl_column : 17
    <ab5>   DW_AT_type        : <0x8f0>
    <ab9>   DW_AT_data_member_location: 144
 <2><aba>: Abbrev Number: 6 (DW_TAG_member)
    <abb>   DW_AT_name        : CSR
    <abf>   DW_AT_decl_file   : 4
    <abf>   DW_AT_decl_line   : 724
    <ac1>   DW_AT_decl_column : 17
    <ac1>   DW_AT_type        : <0x8f0>
    <ac5>   DW_AT_data_member_location: 148
 <2><ac6>: Abbrev Number: 0
 <1><ac7>: Abbrev Number: 11 (DW_TAG_typedef)
    <ac8>   DW_AT_name        : (indirect string, offset: 0xe8a7e): RCC_TypeDef
    <acc>   DW_AT_decl_file   : 4
    <acd>   DW_AT_decl_line   : 725
    <acf>   DW_AT_decl_column : 3
    <ad0>   DW_AT_type        : <0x8f5>
 <1><ad4>: Abbrev Number: 2 (DW_TAG_base_type)
    <ad5>   DW_AT_byte_size   : 8
    <ad6>   DW_AT_encoding    : 4	(float)
    <ad7>   DW_AT_name        : (indirect string, offset: 0xee3e4): long double
 <1><adb>: Abbrev Number: 12 (DW_TAG_array_type)
    <adc>   DW_AT_type        : <0x8df>
    <ae0>   DW_AT_sibling     : <0xaeb>
 <2><ae4>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <ae5>   DW_AT_type        : <0x8cc>
    <ae9>   DW_AT_upper_bound : 6
 <2><aea>: Abbrev Number: 0
 <1><aeb>: Abbrev Number: 5 (DW_TAG_const_type)
    <aec>   DW_AT_type        : <0xadb>
 <1><af0>: Abbrev Number: 4 (DW_TAG_variable)
    <af1>   DW_AT_name        : (indirect string, offset: 0x2d6ad): CHANNEL_OFFSET_TAB
    <af5>   DW_AT_decl_file   : 5
    <af6>   DW_AT_decl_line   : 49
    <af7>   DW_AT_decl_column : 22
    <af8>   DW_AT_type        : <0xaeb>
    <afc>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><b02>: Abbrev Number: 14 (DW_TAG_subprogram)
    <b03>   DW_AT_external    : 1
    <b03>   DW_AT_name        : (indirect string, offset: 0xe8cd0): HAL_MspInit
    <b07>   DW_AT_decl_file   : 1
    <b08>   DW_AT_decl_line   : 64
    <b09>   DW_AT_decl_column : 6
    <b0a>   DW_AT_prototyped  : 1
    <b0a>   DW_AT_low_pc      : 0x8000750
    <b0e>   DW_AT_high_pc     : 0x48
    <b12>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b14>   DW_AT_call_all_calls: 1
 <2><b14>: Abbrev Number: 15 (DW_TAG_lexical_block)
    <b15>   DW_AT_low_pc      : 0x8000756
    <b19>   DW_AT_high_pc     : 0x18
    <b1d>   DW_AT_sibling     : <0xb31>
 <3><b21>: Abbrev Number: 4 (DW_TAG_variable)
    <b22>   DW_AT_name        : (indirect string, offset: 0xe8cdc): tmpreg
    <b26>   DW_AT_decl_file   : 1
    <b27>   DW_AT_decl_line   : 71
    <b28>   DW_AT_decl_column : 3
    <b29>   DW_AT_type        : <0x8f0>
    <b2d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><b30>: Abbrev Number: 0
 <2><b31>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <b32>   DW_AT_low_pc      : 0x800076e
    <b36>   DW_AT_high_pc     : 0x18
 <3><b3a>: Abbrev Number: 4 (DW_TAG_variable)
    <b3b>   DW_AT_name        : (indirect string, offset: 0xe8cdc): tmpreg
    <b3f>   DW_AT_decl_file   : 1
    <b40>   DW_AT_decl_line   : 72
    <b41>   DW_AT_decl_column : 3
    <b42>   DW_AT_type        : <0x8f0>
    <b46>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><b49>: Abbrev Number: 0
 <2><b4a>: Abbrev Number: 0
 <1><b4b>: Abbrev Number: 0
  Compilation Unit @ offset 0xb4c:
   Length:        0x118 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x3eb
   Pointer Size:  4
 <0><b58>: Abbrev Number: 5 (DW_TAG_compile_unit)
    <b59>   DW_AT_producer    : (indirect string, offset: 0x3c767): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <b5d>   DW_AT_language    : 29	(C11)
    <b5e>   DW_AT_name        : (indirect string, offset: 0xe8d33): ../Core/Src/stm32l4xx_it.c
    <b62>   DW_AT_comp_dir    : (indirect string, offset: 0x7fb10): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <b66>   DW_AT_ranges      : 0x6b
    <b6a>   DW_AT_low_pc      : 0
    <b6e>   DW_AT_stmt_list   : 0x1788
    <b72>   DW_AT_macros      : 0x25239
 <1><b76>: Abbrev Number: 1 (DW_TAG_base_type)
    <b77>   DW_AT_byte_size   : 1
    <b78>   DW_AT_encoding    : 6	(signed char)
    <b79>   DW_AT_name        : (indirect string, offset: 0x751ec): signed char
 <1><b7d>: Abbrev Number: 3 (DW_TAG_typedef)
    <b7e>   DW_AT_name        : (indirect string, offset: 0x4354d): __uint8_t
    <b82>   DW_AT_decl_file   : 2
    <b83>   DW_AT_decl_line   : 43
    <b84>   DW_AT_decl_column : 24
    <b85>   DW_AT_type        : <0xb89>
 <1><b89>: Abbrev Number: 1 (DW_TAG_base_type)
    <b8a>   DW_AT_byte_size   : 1
    <b8b>   DW_AT_encoding    : 8	(unsigned char)
    <b8c>   DW_AT_name        : (indirect string, offset: 0xdfda1): unsigned char
 <1><b90>: Abbrev Number: 1 (DW_TAG_base_type)
    <b91>   DW_AT_byte_size   : 2
    <b92>   DW_AT_encoding    : 5	(signed)
    <b93>   DW_AT_name        : (indirect string, offset: 0xac250): short int
 <1><b97>: Abbrev Number: 1 (DW_TAG_base_type)
    <b98>   DW_AT_byte_size   : 2
    <b99>   DW_AT_encoding    : 7	(unsigned)
    <b9a>   DW_AT_name        : (indirect string, offset: 0xde34b): short unsigned int
 <1><b9e>: Abbrev Number: 1 (DW_TAG_base_type)
    <b9f>   DW_AT_byte_size   : 4
    <ba0>   DW_AT_encoding    : 5	(signed)
    <ba1>   DW_AT_name        : (indirect string, offset: 0x135b8): long int
 <1><ba5>: Abbrev Number: 1 (DW_TAG_base_type)
    <ba6>   DW_AT_byte_size   : 4
    <ba7>   DW_AT_encoding    : 7	(unsigned)
    <ba8>   DW_AT_name        : (indirect string, offset: 0x58285): long unsigned int
 <1><bac>: Abbrev Number: 1 (DW_TAG_base_type)
    <bad>   DW_AT_byte_size   : 8
    <bae>   DW_AT_encoding    : 5	(signed)
    <baf>   DW_AT_name        : (indirect string, offset: 0x69985): long long int
 <1><bb3>: Abbrev Number: 1 (DW_TAG_base_type)
    <bb4>   DW_AT_byte_size   : 8
    <bb5>   DW_AT_encoding    : 7	(unsigned)
    <bb6>   DW_AT_name        : (indirect string, offset: 0x3004c): long long unsigned int
 <1><bba>: Abbrev Number: 6 (DW_TAG_base_type)
    <bbb>   DW_AT_byte_size   : 4
    <bbc>   DW_AT_encoding    : 5	(signed)
    <bbd>   DW_AT_name        : int
 <1><bc1>: Abbrev Number: 1 (DW_TAG_base_type)
    <bc2>   DW_AT_byte_size   : 4
    <bc3>   DW_AT_encoding    : 7	(unsigned)
    <bc4>   DW_AT_name        : (indirect string, offset: 0x12ac1): unsigned int
 <1><bc8>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc9>   DW_AT_name        : (indirect string, offset: 0x4354f): uint8_t
    <bcd>   DW_AT_decl_file   : 3
    <bce>   DW_AT_decl_line   : 24
    <bcf>   DW_AT_decl_column : 19
    <bd0>   DW_AT_type        : <0xb7d>
 <1><bd4>: Abbrev Number: 4 (DW_TAG_const_type)
    <bd5>   DW_AT_type        : <0xbc8>
 <1><bd9>: Abbrev Number: 1 (DW_TAG_base_type)
    <bda>   DW_AT_byte_size   : 8
    <bdb>   DW_AT_encoding    : 4	(float)
    <bdc>   DW_AT_name        : (indirect string, offset: 0xee3e4): long double
 <1><be0>: Abbrev Number: 7 (DW_TAG_array_type)
    <be1>   DW_AT_type        : <0xbd4>
    <be5>   DW_AT_sibling     : <0xbf0>
 <2><be9>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <bea>   DW_AT_type        : <0xbc1>
    <bee>   DW_AT_upper_bound : 6
 <2><bef>: Abbrev Number: 0
 <1><bf0>: Abbrev Number: 4 (DW_TAG_const_type)
    <bf1>   DW_AT_type        : <0xbe0>
 <1><bf5>: Abbrev Number: 9 (DW_TAG_variable)
    <bf6>   DW_AT_name        : (indirect string, offset: 0x2d6ad): CHANNEL_OFFSET_TAB
    <bfa>   DW_AT_decl_file   : 4
    <bfb>   DW_AT_decl_line   : 49
    <bfc>   DW_AT_decl_column : 22
    <bfd>   DW_AT_type        : <0xbf0>
    <c01>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><c07>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c08>   DW_AT_external    : 1
    <c08>   DW_AT_name        : (indirect string, offset: 0xe8d22): DebugMon_Handler
    <c0c>   DW_AT_decl_file   : 1
    <c0c>   DW_AT_decl_line   : 159
    <c0d>   DW_AT_decl_column : 6
    <c0d>   DW_AT_prototyped  : 1
    <c0d>   DW_AT_low_pc      : 0x80007c0
    <c11>   DW_AT_high_pc     : 0xe
    <c15>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c17>   DW_AT_call_all_calls: 1
 <1><c17>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c18>   DW_AT_external    : 1
    <c18>   DW_AT_name        : (indirect string, offset: 0xe8d0f): UsageFault_Handler
    <c1c>   DW_AT_decl_file   : 1
    <c1c>   DW_AT_decl_line   : 129
    <c1d>   DW_AT_decl_column : 6
    <c1d>   DW_AT_prototyped  : 1
    <c1d>   DW_AT_low_pc      : 0x80007b8
    <c21>   DW_AT_high_pc     : 0x8
    <c25>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c27>   DW_AT_call_all_calls: 1
 <1><c27>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c28>   DW_AT_external    : 1
    <c28>   DW_AT_name        : (indirect string, offset: 0xe8d60): BusFault_Handler
    <c2c>   DW_AT_decl_file   : 1
    <c2c>   DW_AT_decl_line   : 114
    <c2d>   DW_AT_decl_column : 6
    <c2d>   DW_AT_prototyped  : 1
    <c2d>   DW_AT_low_pc      : 0x80007b0
    <c31>   DW_AT_high_pc     : 0x8
    <c35>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c37>   DW_AT_call_all_calls: 1
 <1><c37>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c38>   DW_AT_external    : 1
    <c38>   DW_AT_name        : (indirect string, offset: 0xe8d83): MemManage_Handler
    <c3c>   DW_AT_decl_file   : 1
    <c3c>   DW_AT_decl_line   : 99
    <c3d>   DW_AT_decl_column : 6
    <c3d>   DW_AT_prototyped  : 1
    <c3d>   DW_AT_low_pc      : 0x80007a8
    <c41>   DW_AT_high_pc     : 0x8
    <c45>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c47>   DW_AT_call_all_calls: 1
 <1><c47>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c48>   DW_AT_external    : 1
    <c48>   DW_AT_name        : (indirect string, offset: 0xe8d4e): HardFault_Handler
    <c4c>   DW_AT_decl_file   : 1
    <c4c>   DW_AT_decl_line   : 84
    <c4d>   DW_AT_decl_column : 6
    <c4d>   DW_AT_prototyped  : 1
    <c4d>   DW_AT_low_pc      : 0x80007a0
    <c51>   DW_AT_high_pc     : 0x8
    <c55>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c57>   DW_AT_call_all_calls: 1
 <1><c57>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c58>   DW_AT_external    : 1
    <c58>   DW_AT_name        : (indirect string, offset: 0xe8d03): NMI_Handler
    <c5c>   DW_AT_decl_file   : 1
    <c5c>   DW_AT_decl_line   : 69
    <c5d>   DW_AT_decl_column : 6
    <c5d>   DW_AT_prototyped  : 1
    <c5d>   DW_AT_low_pc      : 0x8000798
    <c61>   DW_AT_high_pc     : 0x8
    <c65>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c67>   DW_AT_call_all_calls: 1
 <1><c67>: Abbrev Number: 0
  Compilation Unit @ offset 0xc68:
   Length:        0x5de (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x46b
   Pointer Size:  4
 <0><c74>: Abbrev Number: 14 (DW_TAG_compile_unit)
    <c75>   DW_AT_producer    : (indirect string, offset: 0x3c767): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <c79>   DW_AT_language    : 29	(C11)
    <c7a>   DW_AT_name        : (indirect string, offset: 0xe8d95): ../Core/Src/system_stm32l4xx.c
    <c7e>   DW_AT_comp_dir    : (indirect string, offset: 0x7fb10): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <c82>   DW_AT_ranges      : 0x9c
    <c86>   DW_AT_low_pc      : 0
    <c8a>   DW_AT_stmt_list   : 0x1f0e
    <c8e>   DW_AT_macros      : 0x253f4
 <1><c92>: Abbrev Number: 2 (DW_TAG_base_type)
    <c93>   DW_AT_byte_size   : 1
    <c94>   DW_AT_encoding    : 6	(signed char)
    <c95>   DW_AT_name        : (indirect string, offset: 0x751ec): signed char
 <1><c99>: Abbrev Number: 9 (DW_TAG_typedef)
    <c9a>   DW_AT_name        : (indirect string, offset: 0x4354d): __uint8_t
    <c9e>   DW_AT_decl_file   : 2
    <c9f>   DW_AT_decl_line   : 43
    <ca0>   DW_AT_decl_column : 24
    <ca1>   DW_AT_type        : <0xca5>
 <1><ca5>: Abbrev Number: 2 (DW_TAG_base_type)
    <ca6>   DW_AT_byte_size   : 1
    <ca7>   DW_AT_encoding    : 8	(unsigned char)
    <ca8>   DW_AT_name        : (indirect string, offset: 0xdfda1): unsigned char
 <1><cac>: Abbrev Number: 2 (DW_TAG_base_type)
    <cad>   DW_AT_byte_size   : 2
    <cae>   DW_AT_encoding    : 5	(signed)
    <caf>   DW_AT_name        : (indirect string, offset: 0xac250): short int
 <1><cb3>: Abbrev Number: 2 (DW_TAG_base_type)
    <cb4>   DW_AT_byte_size   : 2
    <cb5>   DW_AT_encoding    : 7	(unsigned)
    <cb6>   DW_AT_name        : (indirect string, offset: 0xde34b): short unsigned int
 <1><cba>: Abbrev Number: 2 (DW_TAG_base_type)
    <cbb>   DW_AT_byte_size   : 4
    <cbc>   DW_AT_encoding    : 5	(signed)
    <cbd>   DW_AT_name        : (indirect string, offset: 0x135b8): long int
 <1><cc1>: Abbrev Number: 9 (DW_TAG_typedef)
    <cc2>   DW_AT_name        : (indirect string, offset: 0xe8b4d): __uint32_t
    <cc6>   DW_AT_decl_file   : 2
    <cc7>   DW_AT_decl_line   : 79
    <cc8>   DW_AT_decl_column : 25
    <cc9>   DW_AT_type        : <0xccd>
 <1><ccd>: Abbrev Number: 2 (DW_TAG_base_type)
    <cce>   DW_AT_byte_size   : 4
    <ccf>   DW_AT_encoding    : 7	(unsigned)
    <cd0>   DW_AT_name        : (indirect string, offset: 0x58285): long unsigned int
 <1><cd4>: Abbrev Number: 2 (DW_TAG_base_type)
    <cd5>   DW_AT_byte_size   : 8
    <cd6>   DW_AT_encoding    : 5	(signed)
    <cd7>   DW_AT_name        : (indirect string, offset: 0x69985): long long int
 <1><cdb>: Abbrev Number: 2 (DW_TAG_base_type)
    <cdc>   DW_AT_byte_size   : 8
    <cdd>   DW_AT_encoding    : 7	(unsigned)
    <cde>   DW_AT_name        : (indirect string, offset: 0x3004c): long long unsigned int
 <1><ce2>: Abbrev Number: 15 (DW_TAG_base_type)
    <ce3>   DW_AT_byte_size   : 4
    <ce4>   DW_AT_encoding    : 5	(signed)
    <ce5>   DW_AT_name        : int
 <1><ce9>: Abbrev Number: 2 (DW_TAG_base_type)
    <cea>   DW_AT_byte_size   : 4
    <ceb>   DW_AT_encoding    : 7	(unsigned)
    <cec>   DW_AT_name        : (indirect string, offset: 0x12ac1): unsigned int
 <1><cf0>: Abbrev Number: 9 (DW_TAG_typedef)
    <cf1>   DW_AT_name        : (indirect string, offset: 0x4354f): uint8_t
    <cf5>   DW_AT_decl_file   : 3
    <cf6>   DW_AT_decl_line   : 24
    <cf7>   DW_AT_decl_column : 19
    <cf8>   DW_AT_type        : <0xc99>
 <1><cfc>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <cfd>   DW_AT_type        : <0xcf0>
 <1><d01>: Abbrev Number: 3 (DW_TAG_const_type)
    <d02>   DW_AT_type        : <0xcf0>
 <1><d06>: Abbrev Number: 9 (DW_TAG_typedef)
    <d07>   DW_AT_name        : (indirect string, offset: 0xa82d1): uint32_t
    <d0b>   DW_AT_decl_file   : 3
    <d0c>   DW_AT_decl_line   : 48
    <d0d>   DW_AT_decl_column : 20
    <d0e>   DW_AT_type        : <0xcc1>
 <1><d12>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <d13>   DW_AT_type        : <0xd06>
 <1><d17>: Abbrev Number: 3 (DW_TAG_const_type)
    <d18>   DW_AT_type        : <0xd12>
 <1><d1c>: Abbrev Number: 3 (DW_TAG_const_type)
    <d1d>   DW_AT_type        : <0xd06>
 <1><d21>: Abbrev Number: 12 (DW_TAG_structure_type)
    <d22>   DW_AT_byte_size   : 140
    <d23>   DW_AT_decl_file   : 4
    <d24>   DW_AT_decl_line   : 440
    <d26>   DW_AT_decl_column : 9
    <d26>   DW_AT_sibling     : <0xe51>
 <2><d2a>: Abbrev Number: 1 (DW_TAG_member)
    <d2b>   DW_AT_name        : (indirect string, offset: 0xe8dcd): CPUID
    <d2f>   DW_AT_decl_file   : 4
    <d30>   DW_AT_decl_line   : 442
    <d32>   DW_AT_decl_column : 18
    <d33>   DW_AT_type        : <0xd17>
    <d37>   DW_AT_data_member_location: 0
 <2><d38>: Abbrev Number: 1 (DW_TAG_member)
    <d39>   DW_AT_name        : (indirect string, offset: 0xe8dc8): ICSR
    <d3d>   DW_AT_decl_file   : 4
    <d3e>   DW_AT_decl_line   : 443
    <d40>   DW_AT_decl_column : 18
    <d41>   DW_AT_type        : <0xd12>
    <d45>   DW_AT_data_member_location: 4
 <2><d46>: Abbrev Number: 1 (DW_TAG_member)
    <d47>   DW_AT_name        : (indirect string, offset: 0xe8db4): VTOR
    <d4b>   DW_AT_decl_file   : 4
    <d4c>   DW_AT_decl_line   : 444
    <d4e>   DW_AT_decl_column : 18
    <d4f>   DW_AT_type        : <0xd12>
    <d53>   DW_AT_data_member_location: 8
 <2><d54>: Abbrev Number: 1 (DW_TAG_member)
    <d55>   DW_AT_name        : (indirect string, offset: 0xe8e81): AIRCR
    <d59>   DW_AT_decl_file   : 4
    <d5a>   DW_AT_decl_line   : 445
    <d5c>   DW_AT_decl_column : 18
    <d5d>   DW_AT_type        : <0xd12>
    <d61>   DW_AT_data_member_location: 12
 <2><d62>: Abbrev Number: 6 (DW_TAG_member)
    <d63>   DW_AT_name        : SCR
    <d67>   DW_AT_decl_file   : 4
    <d68>   DW_AT_decl_line   : 446
    <d6a>   DW_AT_decl_column : 18
    <d6b>   DW_AT_type        : <0xd12>
    <d6f>   DW_AT_data_member_location: 16
 <2><d70>: Abbrev Number: 6 (DW_TAG_member)
    <d71>   DW_AT_name        : CCR
    <d75>   DW_AT_decl_file   : 4
    <d76>   DW_AT_decl_line   : 447
    <d78>   DW_AT_decl_column : 18
    <d79>   DW_AT_type        : <0xd12>
    <d7d>   DW_AT_data_member_location: 20
 <2><d7e>: Abbrev Number: 6 (DW_TAG_member)
    <d7f>   DW_AT_name        : SHP
    <d83>   DW_AT_decl_file   : 4
    <d84>   DW_AT_decl_line   : 448
    <d86>   DW_AT_decl_column : 18
    <d87>   DW_AT_type        : <0xe61>
    <d8b>   DW_AT_data_member_location: 24
 <2><d8c>: Abbrev Number: 1 (DW_TAG_member)
    <d8d>   DW_AT_name        : (indirect string, offset: 0xe8dfb): SHCSR
    <d91>   DW_AT_decl_file   : 4
    <d92>   DW_AT_decl_line   : 449
    <d94>   DW_AT_decl_column : 18
    <d95>   DW_AT_type        : <0xd12>
    <d99>   DW_AT_data_member_location: 36
 <2><d9a>: Abbrev Number: 1 (DW_TAG_member)
    <d9b>   DW_AT_name        : (indirect string, offset: 0xe8e22): CFSR
    <d9f>   DW_AT_decl_file   : 4
    <da0>   DW_AT_decl_line   : 450
    <da2>   DW_AT_decl_column : 18
    <da3>   DW_AT_type        : <0xd12>
    <da7>   DW_AT_data_member_location: 40
 <2><da8>: Abbrev Number: 1 (DW_TAG_member)
    <da9>   DW_AT_name        : (indirect string, offset: 0xe8e01): HFSR
    <dad>   DW_AT_decl_file   : 4
    <dae>   DW_AT_decl_line   : 451
    <db0>   DW_AT_decl_column : 18
    <db1>   DW_AT_type        : <0xd12>
    <db5>   DW_AT_data_member_location: 44
 <2><db6>: Abbrev Number: 1 (DW_TAG_member)
    <db7>   DW_AT_name        : (indirect string, offset: 0xe8e6e): DFSR
    <dbb>   DW_AT_decl_file   : 4
    <dbc>   DW_AT_decl_line   : 452
    <dbe>   DW_AT_decl_column : 18
    <dbf>   DW_AT_type        : <0xd12>
    <dc3>   DW_AT_data_member_location: 48
 <2><dc4>: Abbrev Number: 1 (DW_TAG_member)
    <dc5>   DW_AT_name        : (indirect string, offset: 0xe8df0): MMFAR
    <dc9>   DW_AT_decl_file   : 4
    <dca>   DW_AT_decl_line   : 453
    <dcc>   DW_AT_decl_column : 18
    <dcd>   DW_AT_type        : <0xd12>
    <dd1>   DW_AT_data_member_location: 52
 <2><dd2>: Abbrev Number: 1 (DW_TAG_member)
    <dd3>   DW_AT_name        : (indirect string, offset: 0xe8deb): BFAR
    <dd7>   DW_AT_decl_file   : 4
    <dd8>   DW_AT_decl_line   : 454
    <dda>   DW_AT_decl_column : 18
    <ddb>   DW_AT_type        : <0xd12>
    <ddf>   DW_AT_data_member_location: 56
 <2><de0>: Abbrev Number: 1 (DW_TAG_member)
    <de1>   DW_AT_name        : (indirect string, offset: 0xe8dc3): AFSR
    <de5>   DW_AT_decl_file   : 4
    <de6>   DW_AT_decl_line   : 455
    <de8>   DW_AT_decl_column : 18
    <de9>   DW_AT_type        : <0xd12>
    <ded>   DW_AT_data_member_location: 60
 <2><dee>: Abbrev Number: 6 (DW_TAG_member)
    <def>   DW_AT_name        : PFR
    <df3>   DW_AT_decl_file   : 4
    <df4>   DW_AT_decl_line   : 456
    <df6>   DW_AT_decl_column : 18
    <df7>   DW_AT_type        : <0xe7b>
    <dfb>   DW_AT_data_member_location: 64
 <2><dfc>: Abbrev Number: 6 (DW_TAG_member)
    <dfd>   DW_AT_name        : DFR
    <e01>   DW_AT_decl_file   : 4
    <e02>   DW_AT_decl_line   : 457
    <e04>   DW_AT_decl_column : 18
    <e05>   DW_AT_type        : <0xd17>
    <e09>   DW_AT_data_member_location: 72
 <2><e0a>: Abbrev Number: 6 (DW_TAG_member)
    <e0b>   DW_AT_name        : ADR
    <e0f>   DW_AT_decl_file   : 4
    <e10>   DW_AT_decl_line   : 458
    <e12>   DW_AT_decl_column : 18
    <e13>   DW_AT_type        : <0xd17>
    <e17>   DW_AT_data_member_location: 76
 <2><e18>: Abbrev Number: 1 (DW_TAG_member)
    <e19>   DW_AT_name        : (indirect string, offset: 0xe8de6): MMFR
    <e1d>   DW_AT_decl_file   : 4
    <e1e>   DW_AT_decl_line   : 459
    <e20>   DW_AT_decl_column : 18
    <e21>   DW_AT_type        : <0xe95>
    <e25>   DW_AT_data_member_location: 80
 <2><e26>: Abbrev Number: 1 (DW_TAG_member)
    <e27>   DW_AT_name        : (indirect string, offset: 0xe8df6): ISAR
    <e2b>   DW_AT_decl_file   : 4
    <e2c>   DW_AT_decl_line   : 460
    <e2e>   DW_AT_decl_column : 18
    <e2f>   DW_AT_type        : <0xeaf>
    <e33>   DW_AT_data_member_location: 96
 <2><e34>: Abbrev Number: 1 (DW_TAG_member)
    <e35>   DW_AT_name        : (indirect string, offset: 0xe8c64): RESERVED0
    <e39>   DW_AT_decl_file   : 4
    <e3a>   DW_AT_decl_line   : 461
    <e3c>   DW_AT_decl_column : 18
    <e3d>   DW_AT_type        : <0xeb4>
    <e41>   DW_AT_data_member_location: 116
 <2><e42>: Abbrev Number: 1 (DW_TAG_member)
    <e43>   DW_AT_name        : (indirect string, offset: 0xe8e1c): CPACR
    <e47>   DW_AT_decl_file   : 4
    <e48>   DW_AT_decl_line   : 462
    <e4a>   DW_AT_decl_column : 18
    <e4b>   DW_AT_type        : <0xd12>
    <e4f>   DW_AT_data_member_location: 136
 <2><e50>: Abbrev Number: 0
 <1><e51>: Abbrev Number: 4 (DW_TAG_array_type)
    <e52>   DW_AT_type        : <0xcfc>
    <e56>   DW_AT_sibling     : <0xe61>
 <2><e5a>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <e5b>   DW_AT_type        : <0xce9>
    <e5f>   DW_AT_upper_bound : 11
 <2><e60>: Abbrev Number: 0
 <1><e61>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <e62>   DW_AT_type        : <0xe51>
 <1><e66>: Abbrev Number: 4 (DW_TAG_array_type)
    <e67>   DW_AT_type        : <0xd17>
    <e6b>   DW_AT_sibling     : <0xe76>
 <2><e6f>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <e70>   DW_AT_type        : <0xce9>
    <e74>   DW_AT_upper_bound : 1
 <2><e75>: Abbrev Number: 0
 <1><e76>: Abbrev Number: 3 (DW_TAG_const_type)
    <e77>   DW_AT_type        : <0xe66>
 <1><e7b>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <e7c>   DW_AT_type        : <0xe76>
 <1><e80>: Abbrev Number: 4 (DW_TAG_array_type)
    <e81>   DW_AT_type        : <0xd17>
    <e85>   DW_AT_sibling     : <0xe90>
 <2><e89>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <e8a>   DW_AT_type        : <0xce9>
    <e8e>   DW_AT_upper_bound : 3
 <2><e8f>: Abbrev Number: 0
 <1><e90>: Abbrev Number: 3 (DW_TAG_const_type)
    <e91>   DW_AT_type        : <0xe80>
 <1><e95>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <e96>   DW_AT_type        : <0xe90>
 <1><e9a>: Abbrev Number: 4 (DW_TAG_array_type)
    <e9b>   DW_AT_type        : <0xd17>
    <e9f>   DW_AT_sibling     : <0xeaa>
 <2><ea3>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <ea4>   DW_AT_type        : <0xce9>
    <ea8>   DW_AT_upper_bound : 4
 <2><ea9>: Abbrev Number: 0
 <1><eaa>: Abbrev Number: 3 (DW_TAG_const_type)
    <eab>   DW_AT_type        : <0xe9a>
 <1><eaf>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <eb0>   DW_AT_type        : <0xeaa>
 <1><eb4>: Abbrev Number: 4 (DW_TAG_array_type)
    <eb5>   DW_AT_type        : <0xd06>
    <eb9>   DW_AT_sibling     : <0xec4>
 <2><ebd>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <ebe>   DW_AT_type        : <0xce9>
    <ec2>   DW_AT_upper_bound : 4
 <2><ec3>: Abbrev Number: 0
 <1><ec4>: Abbrev Number: 13 (DW_TAG_typedef)
    <ec5>   DW_AT_name        : (indirect string, offset: 0xe8e3c): SCB_Type
    <ec9>   DW_AT_decl_file   : 4
    <eca>   DW_AT_decl_line   : 463
    <ecc>   DW_AT_decl_column : 3
    <ecc>   DW_AT_type        : <0xd21>
 <1><ed0>: Abbrev Number: 10 (DW_TAG_variable)
    <ed1>   DW_AT_name        : (indirect string, offset: 0xe8e45): SystemCoreClock
    <ed5>   DW_AT_decl_file   : 5
    <ed5>   DW_AT_decl_line   : 57
    <ed6>   DW_AT_decl_column : 17
    <ed7>   DW_AT_type        : <0xd06>
    <edb>   DW_AT_external    : 1
    <edb>   DW_AT_declaration : 1
 <1><edb>: Abbrev Number: 4 (DW_TAG_array_type)
    <edc>   DW_AT_type        : <0xd01>
    <ee0>   DW_AT_sibling     : <0xeeb>
 <2><ee4>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <ee5>   DW_AT_type        : <0xce9>
    <ee9>   DW_AT_upper_bound : 15
 <2><eea>: Abbrev Number: 0
 <1><eeb>: Abbrev Number: 3 (DW_TAG_const_type)
    <eec>   DW_AT_type        : <0xedb>
 <1><ef0>: Abbrev Number: 10 (DW_TAG_variable)
    <ef1>   DW_AT_name        : (indirect string, offset: 0xe8e73): AHBPrescTable
    <ef5>   DW_AT_decl_file   : 5
    <ef5>   DW_AT_decl_line   : 59
    <ef6>   DW_AT_decl_column : 23
    <ef7>   DW_AT_type        : <0xeeb>
    <efb>   DW_AT_external    : 1
    <efb>   DW_AT_declaration : 1
 <1><efb>: Abbrev Number: 4 (DW_TAG_array_type)
    <efc>   DW_AT_type        : <0xd01>
    <f00>   DW_AT_sibling     : <0xf0b>
 <2><f04>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <f05>   DW_AT_type        : <0xce9>
    <f09>   DW_AT_upper_bound : 7
 <2><f0a>: Abbrev Number: 0
 <1><f0b>: Abbrev Number: 3 (DW_TAG_const_type)
    <f0c>   DW_AT_type        : <0xefb>
 <1><f10>: Abbrev Number: 10 (DW_TAG_variable)
    <f11>   DW_AT_name        : (indirect string, offset: 0xe8e27): APBPrescTable
    <f15>   DW_AT_decl_file   : 5
    <f15>   DW_AT_decl_line   : 60
    <f16>   DW_AT_decl_column : 23
    <f17>   DW_AT_type        : <0xf0b>
    <f1b>   DW_AT_external    : 1
    <f1b>   DW_AT_declaration : 1
 <1><f1b>: Abbrev Number: 4 (DW_TAG_array_type)
    <f1c>   DW_AT_type        : <0xd1c>
    <f20>   DW_AT_sibling     : <0xf2b>
 <2><f24>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <f25>   DW_AT_type        : <0xce9>
    <f29>   DW_AT_upper_bound : 11
 <2><f2a>: Abbrev Number: 0
 <1><f2b>: Abbrev Number: 3 (DW_TAG_const_type)
    <f2c>   DW_AT_type        : <0xf1b>
 <1><f30>: Abbrev Number: 10 (DW_TAG_variable)
    <f31>   DW_AT_name        : (indirect string, offset: 0xe8e60): MSIRangeTable
    <f35>   DW_AT_decl_file   : 5
    <f35>   DW_AT_decl_line   : 61
    <f36>   DW_AT_decl_column : 23
    <f37>   DW_AT_type        : <0xf2b>
    <f3b>   DW_AT_external    : 1
    <f3b>   DW_AT_declaration : 1
 <1><f3b>: Abbrev Number: 12 (DW_TAG_structure_type)
    <f3c>   DW_AT_byte_size   : 152
    <f3d>   DW_AT_decl_file   : 6
    <f3e>   DW_AT_decl_line   : 685
    <f40>   DW_AT_decl_column : 9
    <f40>   DW_AT_sibling     : <0x1158>
 <2><f44>: Abbrev Number: 6 (DW_TAG_member)
    <f45>   DW_AT_name        : CR
    <f48>   DW_AT_decl_file   : 6
    <f49>   DW_AT_decl_line   : 687
    <f4b>   DW_AT_decl_column : 17
    <f4c>   DW_AT_type        : <0xd12>
    <f50>   DW_AT_data_member_location: 0
 <2><f51>: Abbrev Number: 1 (DW_TAG_member)
    <f52>   DW_AT_name        : (indirect string, offset: 0xe8ac3): ICSCR
    <f56>   DW_AT_decl_file   : 6
    <f57>   DW_AT_decl_line   : 688
    <f59>   DW_AT_decl_column : 17
    <f5a>   DW_AT_type        : <0xd12>
    <f5e>   DW_AT_data_member_location: 4
 <2><f5f>: Abbrev Number: 1 (DW_TAG_member)
    <f60>   DW_AT_name        : (indirect string, offset: 0xe89ef): CFGR
    <f64>   DW_AT_decl_file   : 6
    <f65>   DW_AT_decl_line   : 689
    <f67>   DW_AT_decl_column : 17
    <f68>   DW_AT_type        : <0xd12>
    <f6c>   DW_AT_data_member_location: 8
 <2><f6d>: Abbrev Number: 1 (DW_TAG_member)
    <f6e>   DW_AT_name        : (indirect string, offset: 0xe8b9d): PLLCFGR
    <f72>   DW_AT_decl_file   : 6
    <f73>   DW_AT_decl_line   : 690
    <f75>   DW_AT_decl_column : 17
    <f76>   DW_AT_type        : <0xd12>
    <f7a>   DW_AT_data_member_location: 12
 <2><f7b>: Abbrev Number: 1 (DW_TAG_member)
    <f7c>   DW_AT_name        : (indirect string, offset: 0xe89e8): PLLSAI1CFGR
    <f80>   DW_AT_decl_file   : 6
    <f81>   DW_AT_decl_line   : 691
    <f83>   DW_AT_decl_column : 17
    <f84>   DW_AT_type        : <0xd12>
    <f88>   DW_AT_data_member_location: 16
 <2><f89>: Abbrev Number: 1 (DW_TAG_member)
    <f8a>   DW_AT_name        : (indirect string, offset: 0xe8b63): PLLSAI2CFGR
    <f8e>   DW_AT_decl_file   : 6
    <f8f>   DW_AT_decl_line   : 692
    <f91>   DW_AT_decl_column : 17
    <f92>   DW_AT_type        : <0xd12>
    <f96>   DW_AT_data_member_location: 20
 <2><f97>: Abbrev Number: 1 (DW_TAG_member)
    <f98>   DW_AT_name        : (indirect string, offset: 0xe88c5): CIER
    <f9c>   DW_AT_decl_file   : 6
    <f9d>   DW_AT_decl_line   : 693
    <f9f>   DW_AT_decl_column : 17
    <fa0>   DW_AT_type        : <0xd12>
    <fa4>   DW_AT_data_member_location: 24
 <2><fa5>: Abbrev Number: 1 (DW_TAG_member)
    <fa6>   DW_AT_name        : (indirect string, offset: 0xe88c0): CIFR
    <faa>   DW_AT_decl_file   : 6
    <fab>   DW_AT_decl_line   : 694
    <fad>   DW_AT_decl_column : 17
    <fae>   DW_AT_type        : <0xd12>
    <fb2>   DW_AT_data_member_location: 28
 <2><fb3>: Abbrev Number: 1 (DW_TAG_member)
    <fb4>   DW_AT_name        : (indirect string, offset: 0xe88b6): CICR
    <fb8>   DW_AT_decl_file   : 6
    <fb9>   DW_AT_decl_line   : 695
    <fbb>   DW_AT_decl_column : 17
    <fbc>   DW_AT_type        : <0xd12>
    <fc0>   DW_AT_data_member_location: 32
 <2><fc1>: Abbrev Number: 1 (DW_TAG_member)
    <fc2>   DW_AT_name        : (indirect string, offset: 0xe8c64): RESERVED0
    <fc6>   DW_AT_decl_file   : 6
    <fc7>   DW_AT_decl_line   : 696
    <fc9>   DW_AT_decl_column : 17
    <fca>   DW_AT_type        : <0xd06>
    <fce>   DW_AT_data_member_location: 36
 <2><fcf>: Abbrev Number: 1 (DW_TAG_member)
    <fd0>   DW_AT_name        : (indirect string, offset: 0xe8bc1): AHB1RSTR
    <fd4>   DW_AT_decl_file   : 6
    <fd5>   DW_AT_decl_line   : 697
    <fd7>   DW_AT_decl_column : 17
    <fd8>   DW_AT_type        : <0xd12>
    <fdc>   DW_AT_data_member_location: 40
 <2><fdd>: Abbrev Number: 1 (DW_TAG_member)
    <fde>   DW_AT_name        : (indirect string, offset: 0xe890c): AHB2RSTR
    <fe2>   DW_AT_decl_file   : 6
    <fe3>   DW_AT_decl_line   : 698
    <fe5>   DW_AT_decl_column : 17
    <fe6>   DW_AT_type        : <0xd12>
    <fea>   DW_AT_data_member_location: 44
 <2><feb>: Abbrev Number: 1 (DW_TAG_member)
    <fec>   DW_AT_name        : (indirect string, offset: 0xe89df): AHB3RSTR
    <ff0>   DW_AT_decl_file   : 6
    <ff1>   DW_AT_decl_line   : 699
    <ff3>   DW_AT_decl_column : 17
    <ff4>   DW_AT_type        : <0xd12>
    <ff8>   DW_AT_data_member_location: 48
 <2><ff9>: Abbrev Number: 1 (DW_TAG_member)
    <ffa>   DW_AT_name        : (indirect string, offset: 0xe8c6e): RESERVED1
    <ffe>   DW_AT_decl_file   : 6
    <fff>   DW_AT_decl_line   : 700
    <1001>   DW_AT_decl_column : 17
    <1002>   DW_AT_type        : <0xd06>
    <1006>   DW_AT_data_member_location: 52
 <2><1007>: Abbrev Number: 1 (DW_TAG_member)
    <1008>   DW_AT_name        : (indirect string, offset: 0xe8955): APB1RSTR1
    <100c>   DW_AT_decl_file   : 6
    <100d>   DW_AT_decl_line   : 701
    <100f>   DW_AT_decl_column : 17
    <1010>   DW_AT_type        : <0xd12>
    <1014>   DW_AT_data_member_location: 56
 <2><1015>: Abbrev Number: 1 (DW_TAG_member)
    <1016>   DW_AT_name        : (indirect string, offset: 0xe895f): APB1RSTR2
    <101a>   DW_AT_decl_file   : 6
    <101b>   DW_AT_decl_line   : 702
    <101d>   DW_AT_decl_column : 17
    <101e>   DW_AT_type        : <0xd12>
    <1022>   DW_AT_data_member_location: 60
 <2><1023>: Abbrev Number: 1 (DW_TAG_member)
    <1024>   DW_AT_name        : (indirect string, offset: 0xe8a32): APB2RSTR
    <1028>   DW_AT_decl_file   : 6
    <1029>   DW_AT_decl_line   : 703
    <102b>   DW_AT_decl_column : 17
    <102c>   DW_AT_type        : <0xd12>
    <1030>   DW_AT_data_member_location: 64
 <2><1031>: Abbrev Number: 1 (DW_TAG_member)
    <1032>   DW_AT_name        : (indirect string, offset: 0xe8c78): RESERVED2
    <1036>   DW_AT_decl_file   : 6
    <1037>   DW_AT_decl_line   : 704
    <1039>   DW_AT_decl_column : 17
    <103a>   DW_AT_type        : <0xd06>
    <103e>   DW_AT_data_member_location: 68
 <2><103f>: Abbrev Number: 1 (DW_TAG_member)
    <1040>   DW_AT_name        : (indirect string, offset: 0xe88ff): AHB1ENR
    <1044>   DW_AT_decl_file   : 6
    <1045>   DW_AT_decl_line   : 705
    <1047>   DW_AT_decl_column : 17
    <1048>   DW_AT_type        : <0xd12>
    <104c>   DW_AT_data_member_location: 72
 <2><104d>: Abbrev Number: 1 (DW_TAG_member)
    <104e>   DW_AT_name        : (indirect string, offset: 0xe8994): AHB2ENR
    <1052>   DW_AT_decl_file   : 6
    <1053>   DW_AT_decl_line   : 706
    <1055>   DW_AT_decl_column : 17
    <1056>   DW_AT_type        : <0xd12>
    <105a>   DW_AT_data_member_location: 76
 <2><105b>: Abbrev Number: 1 (DW_TAG_member)
    <105c>   DW_AT_name        : (indirect string, offset: 0xe8a52): AHB3ENR
    <1060>   DW_AT_decl_file   : 6
    <1061>   DW_AT_decl_line   : 707
    <1063>   DW_AT_decl_column : 17
    <1064>   DW_AT_type        : <0xd12>
    <1068>   DW_AT_data_member_location: 80
 <2><1069>: Abbrev Number: 1 (DW_TAG_member)
    <106a>   DW_AT_name        : (indirect string, offset: 0xe8c82): RESERVED3
    <106e>   DW_AT_decl_file   : 6
    <106f>   DW_AT_decl_line   : 708
    <1071>   DW_AT_decl_column : 17
    <1072>   DW_AT_type        : <0xd06>
    <1076>   DW_AT_data_member_location: 84
 <2><1077>: Abbrev Number: 1 (DW_TAG_member)
    <1078>   DW_AT_name        : (indirect string, offset: 0xe88ca): APB1ENR1
    <107c>   DW_AT_decl_file   : 6
    <107d>   DW_AT_decl_line   : 709
    <107f>   DW_AT_decl_column : 17
    <1080>   DW_AT_type        : <0xd12>
    <1084>   DW_AT_data_member_location: 88
 <2><1085>: Abbrev Number: 1 (DW_TAG_member)
    <1086>   DW_AT_name        : (indirect string, offset: 0xe88d3): APB1ENR2
    <108a>   DW_AT_decl_file   : 6
    <108b>   DW_AT_decl_line   : 710
    <108d>   DW_AT_decl_column : 17
    <108e>   DW_AT_type        : <0xd12>
    <1092>   DW_AT_data_member_location: 92
 <2><1093>: Abbrev Number: 1 (DW_TAG_member)
    <1094>   DW_AT_name        : (indirect string, offset: 0xe8915): APB2ENR
    <1098>   DW_AT_decl_file   : 6
    <1099>   DW_AT_decl_line   : 711
    <109b>   DW_AT_decl_column : 17
    <109c>   DW_AT_type        : <0xd12>
    <10a0>   DW_AT_data_member_location: 96
 <2><10a1>: Abbrev Number: 1 (DW_TAG_member)
    <10a2>   DW_AT_name        : (indirect string, offset: 0xe8ae8): RESERVED4
    <10a6>   DW_AT_decl_file   : 6
    <10a7>   DW_AT_decl_line   : 712
    <10a9>   DW_AT_decl_column : 17
    <10aa>   DW_AT_type        : <0xd06>
    <10ae>   DW_AT_data_member_location: 100
 <2><10af>: Abbrev Number: 1 (DW_TAG_member)
    <10b0>   DW_AT_name        : (indirect string, offset: 0xe8a69): AHB1SMENR
    <10b4>   DW_AT_decl_file   : 6
    <10b5>   DW_AT_decl_line   : 713
    <10b7>   DW_AT_decl_column : 17
    <10b8>   DW_AT_type        : <0xd12>
    <10bc>   DW_AT_data_member_location: 104
 <2><10bd>: Abbrev Number: 1 (DW_TAG_member)
    <10be>   DW_AT_name        : (indirect string, offset: 0xe8c51): AHB2SMENR
    <10c2>   DW_AT_decl_file   : 6
    <10c3>   DW_AT_decl_line   : 714
    <10c5>   DW_AT_decl_column : 17
    <10c6>   DW_AT_type        : <0xd12>
    <10ca>   DW_AT_data_member_location: 108
 <2><10cb>: Abbrev Number: 1 (DW_TAG_member)
    <10cc>   DW_AT_name        : (indirect string, offset: 0xe8a0d): AHB3SMENR
    <10d0>   DW_AT_decl_file   : 6
    <10d1>   DW_AT_decl_line   : 715
    <10d3>   DW_AT_decl_column : 17
    <10d4>   DW_AT_type        : <0xd12>
    <10d8>   DW_AT_data_member_location: 112
 <2><10d9>: Abbrev Number: 1 (DW_TAG_member)
    <10da>   DW_AT_name        : (indirect string, offset: 0xe8c8c): RESERVED5
    <10de>   DW_AT_decl_file   : 6
    <10df>   DW_AT_decl_line   : 716
    <10e1>   DW_AT_decl_column : 17
    <10e2>   DW_AT_type        : <0xd06>
    <10e6>   DW_AT_data_member_location: 116
 <2><10e7>: Abbrev Number: 1 (DW_TAG_member)
    <10e8>   DW_AT_name        : (indirect string, offset: 0xe88dc): APB1SMENR1
    <10ec>   DW_AT_decl_file   : 6
    <10ed>   DW_AT_decl_line   : 717
    <10ef>   DW_AT_decl_column : 17
    <10f0>   DW_AT_type        : <0xd12>
    <10f4>   DW_AT_data_member_location: 120
 <2><10f5>: Abbrev Number: 1 (DW_TAG_member)
    <10f6>   DW_AT_name        : (indirect string, offset: 0xe88e7): APB1SMENR2
    <10fa>   DW_AT_decl_file   : 6
    <10fb>   DW_AT_decl_line   : 718
    <10fd>   DW_AT_decl_column : 17
    <10fe>   DW_AT_type        : <0xd12>
    <1102>   DW_AT_data_member_location: 124
 <2><1103>: Abbrev Number: 1 (DW_TAG_member)
    <1104>   DW_AT_name        : (indirect string, offset: 0xe8bb0): APB2SMENR
    <1108>   DW_AT_decl_file   : 6
    <1109>   DW_AT_decl_line   : 719
    <110b>   DW_AT_decl_column : 17
    <110c>   DW_AT_type        : <0xd12>
    <1110>   DW_AT_data_member_location: 128
 <2><1111>: Abbrev Number: 1 (DW_TAG_member)
    <1112>   DW_AT_name        : (indirect string, offset: 0xe8af2): RESERVED6
    <1116>   DW_AT_decl_file   : 6
    <1117>   DW_AT_decl_line   : 720
    <1119>   DW_AT_decl_column : 17
    <111a>   DW_AT_type        : <0xd06>
    <111e>   DW_AT_data_member_location: 132
 <2><111f>: Abbrev Number: 1 (DW_TAG_member)
    <1120>   DW_AT_name        : (indirect string, offset: 0xe89bc): CCIPR
    <1124>   DW_AT_decl_file   : 6
    <1125>   DW_AT_decl_line   : 721
    <1127>   DW_AT_decl_column : 17
    <1128>   DW_AT_type        : <0xd12>
    <112c>   DW_AT_data_member_location: 136
 <2><112d>: Abbrev Number: 1 (DW_TAG_member)
    <112e>   DW_AT_name        : (indirect string, offset: 0xe8c96): RESERVED7
    <1132>   DW_AT_decl_file   : 6
    <1133>   DW_AT_decl_line   : 722
    <1135>   DW_AT_decl_column : 17
    <1136>   DW_AT_type        : <0xd06>
    <113a>   DW_AT_data_member_location: 140
 <2><113b>: Abbrev Number: 1 (DW_TAG_member)
    <113c>   DW_AT_name        : (indirect string, offset: 0xe898f): BDCR
    <1140>   DW_AT_decl_file   : 6
    <1141>   DW_AT_decl_line   : 723
    <1143>   DW_AT_decl_column : 17
    <1144>   DW_AT_type        : <0xd12>
    <1148>   DW_AT_data_member_location: 144
 <2><1149>: Abbrev Number: 6 (DW_TAG_member)
    <114a>   DW_AT_name        : CSR
    <114e>   DW_AT_decl_file   : 6
    <114f>   DW_AT_decl_line   : 724
    <1151>   DW_AT_decl_column : 17
    <1152>   DW_AT_type        : <0xd12>
    <1156>   DW_AT_data_member_location: 148
 <2><1157>: Abbrev Number: 0
 <1><1158>: Abbrev Number: 13 (DW_TAG_typedef)
    <1159>   DW_AT_name        : (indirect string, offset: 0xe8a7e): RCC_TypeDef
    <115d>   DW_AT_decl_file   : 6
    <115e>   DW_AT_decl_line   : 725
    <1160>   DW_AT_decl_column : 3
    <1160>   DW_AT_type        : <0xf3b>
 <1><1164>: Abbrev Number: 2 (DW_TAG_base_type)
    <1165>   DW_AT_byte_size   : 8
    <1166>   DW_AT_encoding    : 4	(float)
    <1167>   DW_AT_name        : (indirect string, offset: 0xee3e4): long double
 <1><116b>: Abbrev Number: 4 (DW_TAG_array_type)
    <116c>   DW_AT_type        : <0xd01>
    <1170>   DW_AT_sibling     : <0x117b>
 <2><1174>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <1175>   DW_AT_type        : <0xce9>
    <1179>   DW_AT_upper_bound : 6
 <2><117a>: Abbrev Number: 0
 <1><117b>: Abbrev Number: 3 (DW_TAG_const_type)
    <117c>   DW_AT_type        : <0x116b>
 <1><1180>: Abbrev Number: 8 (DW_TAG_variable)
    <1181>   DW_AT_name        : (indirect string, offset: 0x2d6ad): CHANNEL_OFFSET_TAB
    <1185>   DW_AT_decl_file   : 7
    <1186>   DW_AT_decl_line   : 49
    <1187>   DW_AT_decl_column : 22
    <1188>   DW_AT_type        : <0x117b>
    <118c>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1192>: Abbrev Number: 11 (DW_TAG_variable)
    <1193>   DW_AT_specification: <0xed0>
