Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x4d3 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 11 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x299ef): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x9753d): ../Core/Src/Drivers/I2C.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x57523): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 3 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x4fce6): signed char
 <1><31>: Abbrev Number: 5 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x2e54f): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 3 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0x9827d): unsigned char
 <1><44>: Abbrev Number: 3 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x7583d): short int
 <1><4b>: Abbrev Number: 3 (DW_TAG_base_type)
    <4c>   DW_AT_byte_size   : 2
    <4d>   DW_AT_encoding    : 7	(unsigned)
    <4e>   DW_AT_name        : (indirect string, offset: 0x970ba): short unsigned int
 <1><52>: Abbrev Number: 3 (DW_TAG_base_type)
    <53>   DW_AT_byte_size   : 4
    <54>   DW_AT_encoding    : 5	(signed)
    <55>   DW_AT_name        : (indirect string, offset: 0xcd5a): long int
 <1><59>: Abbrev Number: 5 (DW_TAG_typedef)
    <5a>   DW_AT_name        : (indirect string, offset: 0x652d9): __uint32_t
    <5e>   DW_AT_decl_file   : 2
    <5f>   DW_AT_decl_line   : 79
    <60>   DW_AT_decl_column : 25
    <61>   DW_AT_type        : <0x65>
 <1><65>: Abbrev Number: 3 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 4
    <67>   DW_AT_encoding    : 7	(unsigned)
    <68>   DW_AT_name        : (indirect string, offset: 0x3ccb2): long unsigned int
 <1><6c>: Abbrev Number: 3 (DW_TAG_base_type)
    <6d>   DW_AT_byte_size   : 8
    <6e>   DW_AT_encoding    : 5	(signed)
    <6f>   DW_AT_name        : (indirect string, offset: 0x48957): long long int
 <1><73>: Abbrev Number: 3 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 8
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0x20f43): long long unsigned int
 <1><7a>: Abbrev Number: 12 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : int
 <1><81>: Abbrev Number: 3 (DW_TAG_base_type)
    <82>   DW_AT_byte_size   : 4
    <83>   DW_AT_encoding    : 7	(unsigned)
    <84>   DW_AT_name        : (indirect string, offset: 0xc591): unsigned int
 <1><88>: Abbrev Number: 5 (DW_TAG_typedef)
    <89>   DW_AT_name        : (indirect string, offset: 0x2e551): uint8_t
    <8d>   DW_AT_decl_file   : 3
    <8e>   DW_AT_decl_line   : 24
    <8f>   DW_AT_decl_column : 19
    <90>   DW_AT_type        : <0x31>
 <1><94>: Abbrev Number: 5 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0xd74e7): uint32_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 48
    <9b>   DW_AT_decl_column : 20
    <9c>   DW_AT_type        : <0x59>
 <1><a0>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 6 (DW_TAG_structure_type)
    <a6>   DW_AT_byte_size   : 48
    <a7>   DW_AT_decl_file   : 4
    <a7>   DW_AT_decl_line   : 531
    <a9>   DW_AT_decl_column : 9
    <a9>   DW_AT_sibling     : <0x132>
 <2><ad>: Abbrev Number: 1 (DW_TAG_member)
    <ae>   DW_AT_name        : (indirect string, offset: 0x10f4): MODER
    <b2>   DW_AT_decl_file   : 4
    <b2>   DW_AT_decl_line   : 533
    <b4>   DW_AT_decl_column : 17
    <b4>   DW_AT_type        : <0xa0>
    <b8>   DW_AT_data_member_location: 0
 <2><b9>: Abbrev Number: 1 (DW_TAG_member)
    <ba>   DW_AT_name        : (indirect string, offset: 0x7a54b): OTYPER
    <be>   DW_AT_decl_file   : 4
    <be>   DW_AT_decl_line   : 534
    <c0>   DW_AT_decl_column : 17
    <c0>   DW_AT_type        : <0xa0>
    <c4>   DW_AT_data_member_location: 4
 <2><c5>: Abbrev Number: 1 (DW_TAG_member)
    <c6>   DW_AT_name        : (indirect string, offset: 0x89434): OSPEEDR
    <ca>   DW_AT_decl_file   : 4
    <ca>   DW_AT_decl_line   : 535
    <cc>   DW_AT_decl_column : 17
    <cc>   DW_AT_type        : <0xa0>
    <d0>   DW_AT_data_member_location: 8
 <2><d1>: Abbrev Number: 1 (DW_TAG_member)
    <d2>   DW_AT_name        : (indirect string, offset: 0x66ac3): PUPDR
    <d6>   DW_AT_decl_file   : 4
    <d6>   DW_AT_decl_line   : 536
    <d8>   DW_AT_decl_column : 17
    <d8>   DW_AT_type        : <0xa0>
    <dc>   DW_AT_data_member_location: 12
 <2><dd>: Abbrev Number: 2 (DW_TAG_member)
    <de>   DW_AT_name        : IDR
    <e2>   DW_AT_decl_file   : 4
    <e2>   DW_AT_decl_line   : 537
    <e4>   DW_AT_decl_column : 17
    <e4>   DW_AT_type        : <0xa0>
    <e8>   DW_AT_data_member_location: 16
 <2><e9>: Abbrev Number: 2 (DW_TAG_member)
    <ea>   DW_AT_name        : ODR
    <ee>   DW_AT_decl_file   : 4
    <ee>   DW_AT_decl_line   : 538
    <f0>   DW_AT_decl_column : 17
    <f0>   DW_AT_type        : <0xa0>
    <f4>   DW_AT_data_member_location: 20
 <2><f5>: Abbrev Number: 1 (DW_TAG_member)
    <f6>   DW_AT_name        : (indirect string, offset: 0x239c6): BSRR
    <fa>   DW_AT_decl_file   : 4
    <fa>   DW_AT_decl_line   : 539
    <fc>   DW_AT_decl_column : 17
    <fc>   DW_AT_type        : <0xa0>
    <100>   DW_AT_data_member_location: 24
 <2><101>: Abbrev Number: 1 (DW_TAG_member)
    <102>   DW_AT_name        : (indirect string, offset: 0x877c4): LCKR
    <106>   DW_AT_decl_file   : 4
    <106>   DW_AT_decl_line   : 540
    <108>   DW_AT_decl_column : 17
    <108>   DW_AT_type        : <0xa0>
    <10c>   DW_AT_data_member_location: 28
 <2><10d>: Abbrev Number: 2 (DW_TAG_member)
    <10e>   DW_AT_name        : AFR
    <112>   DW_AT_decl_file   : 4
    <112>   DW_AT_decl_line   : 541
    <114>   DW_AT_decl_column : 17
    <114>   DW_AT_type        : <0x142>
    <118>   DW_AT_data_member_location: 32
 <2><119>: Abbrev Number: 2 (DW_TAG_member)
    <11a>   DW_AT_name        : BRR
    <11e>   DW_AT_decl_file   : 4
    <11e>   DW_AT_decl_line   : 542
    <120>   DW_AT_decl_column : 17
    <120>   DW_AT_type        : <0xa0>
    <124>   DW_AT_data_member_location: 40
 <2><125>: Abbrev Number: 1 (DW_TAG_member)
    <126>   DW_AT_name        : (indirect string, offset: 0x1b92): ASCR
    <12a>   DW_AT_decl_file   : 4
    <12a>   DW_AT_decl_line   : 543
    <12c>   DW_AT_decl_column : 17
    <12c>   DW_AT_type        : <0xa0>
    <130>   DW_AT_data_member_location: 44
 <2><131>: Abbrev Number: 0
 <1><132>: Abbrev Number: 13 (DW_TAG_array_type)
    <133>   DW_AT_type        : <0xa0>
    <137>   DW_AT_sibling     : <0x142>
 <2><13b>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <13c>   DW_AT_type        : <0x81>
    <140>   DW_AT_upper_bound : 1
 <2><141>: Abbrev Number: 0
 <1><142>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <143>   DW_AT_type        : <0x132>
 <1><147>: Abbrev Number: 7 (DW_TAG_typedef)
    <148>   DW_AT_name        : (indirect string, offset: 0x991cb): GPIO_TypeDef
    <14c>   DW_AT_decl_file   : 4
    <14c>   DW_AT_decl_line   : 545
    <14e>   DW_AT_decl_column : 3
    <14e>   DW_AT_type        : <0xa5>
 <1><152>: Abbrev Number: 6 (DW_TAG_structure_type)
    <153>   DW_AT_byte_size   : 44
    <154>   DW_AT_decl_file   : 4
    <154>   DW_AT_decl_line   : 552
    <156>   DW_AT_decl_column : 9
    <156>   DW_AT_sibling     : <0x1df>
 <2><15a>: Abbrev Number: 2 (DW_TAG_member)
    <15b>   DW_AT_name        : CR1
    <15f>   DW_AT_decl_file   : 4
    <15f>   DW_AT_decl_line   : 554
    <161>   DW_AT_decl_column : 17
    <161>   DW_AT_type        : <0xa0>
    <165>   DW_AT_data_member_location: 0
 <2><166>: Abbrev Number: 2 (DW_TAG_member)
    <167>   DW_AT_name        : CR2
    <16b>   DW_AT_decl_file   : 4
    <16b>   DW_AT_decl_line   : 555
    <16d>   DW_AT_decl_column : 17
    <16d>   DW_AT_type        : <0xa0>
    <171>   DW_AT_data_member_location: 4
 <2><172>: Abbrev Number: 1 (DW_TAG_member)
    <173>   DW_AT_name        : (indirect string, offset: 0x173b9): OAR1
    <177>   DW_AT_decl_file   : 4
    <177>   DW_AT_decl_line   : 556
    <179>   DW_AT_decl_column : 17
    <179>   DW_AT_type        : <0xa0>
    <17d>   DW_AT_data_member_location: 8
 <2><17e>: Abbrev Number: 1 (DW_TAG_member)
    <17f>   DW_AT_name        : (indirect string, offset: 0x434eb): OAR2
    <183>   DW_AT_decl_file   : 4
    <183>   DW_AT_decl_line   : 557
    <185>   DW_AT_decl_column : 17
    <185>   DW_AT_type        : <0xa0>
    <189>   DW_AT_data_member_location: 12
 <2><18a>: Abbrev Number: 1 (DW_TAG_member)
    <18b>   DW_AT_name        : (indirect string, offset: 0x5d94b): TIMINGR
    <18f>   DW_AT_decl_file   : 4
    <18f>   DW_AT_decl_line   : 558
    <191>   DW_AT_decl_column : 17
    <191>   DW_AT_type        : <0xa0>
    <195>   DW_AT_data_member_location: 16
 <2><196>: Abbrev Number: 1 (DW_TAG_member)
    <197>   DW_AT_name        : (indirect string, offset: 0x80bf2): TIMEOUTR
    <19b>   DW_AT_decl_file   : 4
    <19b>   DW_AT_decl_line   : 559
    <19d>   DW_AT_decl_column : 17
    <19d>   DW_AT_type        : <0xa0>
    <1a1>   DW_AT_data_member_location: 20
 <2><1a2>: Abbrev Number: 2 (DW_TAG_member)
    <1a3>   DW_AT_name        : ISR
    <1a7>   DW_AT_decl_file   : 4
    <1a7>   DW_AT_decl_line   : 560
    <1a9>   DW_AT_decl_column : 17
    <1a9>   DW_AT_type        : <0xa0>
    <1ad>   DW_AT_data_member_location: 24
 <2><1ae>: Abbrev Number: 2 (DW_TAG_member)
    <1af>   DW_AT_name        : ICR
    <1b3>   DW_AT_decl_file   : 4
    <1b3>   DW_AT_decl_line   : 561
    <1b5>   DW_AT_decl_column : 17
    <1b5>   DW_AT_type        : <0xa0>
    <1b9>   DW_AT_data_member_location: 28
 <2><1ba>: Abbrev Number: 1 (DW_TAG_member)
    <1bb>   DW_AT_name        : (indirect string, offset: 0x6d8ef): PECR
    <1bf>   DW_AT_decl_file   : 4
    <1bf>   DW_AT_decl_line   : 562
    <1c1>   DW_AT_decl_column : 17
    <1c1>   DW_AT_type        : <0xa0>
    <1c5>   DW_AT_data_member_location: 32
 <2><1c6>: Abbrev Number: 1 (DW_TAG_member)
    <1c7>   DW_AT_name        : (indirect string, offset: 0x827d2): RXDR
    <1cb>   DW_AT_decl_file   : 4
    <1cb>   DW_AT_decl_line   : 563
    <1cd>   DW_AT_decl_column : 17
    <1cd>   DW_AT_type        : <0xa0>
    <1d1>   DW_AT_data_member_location: 36
 <2><1d2>: Abbrev Number: 1 (DW_TAG_member)
    <1d3>   DW_AT_name        : (indirect string, offset: 0x1e746): TXDR
    <1d7>   DW_AT_decl_file   : 4
    <1d7>   DW_AT_decl_line   : 564
    <1d9>   DW_AT_decl_column : 17
    <1d9>   DW_AT_type        : <0xa0>
    <1dd>   DW_AT_data_member_location: 40
 <2><1de>: Abbrev Number: 0
 <1><1df>: Abbrev Number: 7 (DW_TAG_typedef)
    <1e0>   DW_AT_name        : (indirect string, offset: 0x7c6f4): I2C_TypeDef
    <1e4>   DW_AT_decl_file   : 4
    <1e4>   DW_AT_decl_line   : 565
    <1e6>   DW_AT_decl_column : 3
    <1e6>   DW_AT_type        : <0x152>
 <1><1ea>: Abbrev Number: 6 (DW_TAG_structure_type)
    <1eb>   DW_AT_byte_size   : 152
    <1ec>   DW_AT_decl_file   : 4
    <1ec>   DW_AT_decl_line   : 685
    <1ee>   DW_AT_decl_column : 9
    <1ee>   DW_AT_sibling     : <0x3ba>
 <2><1f2>: Abbrev Number: 2 (DW_TAG_member)
    <1f3>   DW_AT_name        : CR
    <1f6>   DW_AT_decl_file   : 4
    <1f6>   DW_AT_decl_line   : 687
    <1f8>   DW_AT_decl_column : 17
    <1f8>   DW_AT_type        : <0xa0>
    <1fc>   DW_AT_data_member_location: 0
 <2><1fd>: Abbrev Number: 1 (DW_TAG_member)
    <1fe>   DW_AT_name        : (indirect string, offset: 0x6af01): ICSCR
    <202>   DW_AT_decl_file   : 4
    <202>   DW_AT_decl_line   : 688
    <204>   DW_AT_decl_column : 17
    <204>   DW_AT_type        : <0xa0>
    <208>   DW_AT_data_member_location: 4
 <2><209>: Abbrev Number: 1 (DW_TAG_member)
    <20a>   DW_AT_name        : (indirect string, offset: 0x34674): CFGR
    <20e>   DW_AT_decl_file   : 4
    <20e>   DW_AT_decl_line   : 689
    <210>   DW_AT_decl_column : 17
    <210>   DW_AT_type        : <0xa0>
    <214>   DW_AT_data_member_location: 8
 <2><215>: Abbrev Number: 1 (DW_TAG_member)
    <216>   DW_AT_name        : (indirect string, offset: 0x6f093): PLLCFGR
    <21a>   DW_AT_decl_file   : 4
    <21a>   DW_AT_decl_line   : 690
    <21c>   DW_AT_decl_column : 17
    <21c>   DW_AT_type        : <0xa0>
    <220>   DW_AT_data_member_location: 12
 <2><221>: Abbrev Number: 1 (DW_TAG_member)
    <222>   DW_AT_name        : (indirect string, offset: 0x3466d): PLLSAI1CFGR
    <226>   DW_AT_decl_file   : 4
    <226>   DW_AT_decl_line   : 691
    <228>   DW_AT_decl_column : 17
    <228>   DW_AT_type        : <0xa0>
    <22c>   DW_AT_data_member_location: 16
 <2><22d>: Abbrev Number: 1 (DW_TAG_member)
    <22e>   DW_AT_name        : (indirect string, offset: 0x6750c): PLLSAI2CFGR
    <232>   DW_AT_decl_file   : 4
    <232>   DW_AT_decl_line   : 692
    <234>   DW_AT_decl_column : 17
    <234>   DW_AT_type        : <0xa0>
    <238>   DW_AT_data_member_location: 20
 <2><239>: Abbrev Number: 1 (DW_TAG_member)
    <23a>   DW_AT_name        : (indirect string, offset: 0x1e2c): CIER
    <23e>   DW_AT_decl_file   : 4
    <23e>   DW_AT_decl_line   : 693
    <240>   DW_AT_decl_column : 17
    <240>   DW_AT_type        : <0xa0>
    <244>   DW_AT_data_member_location: 24
 <2><245>: Abbrev Number: 1 (DW_TAG_member)
    <246>   DW_AT_name        : (indirect string, offset: 0x21bc): CIFR
    <24a>   DW_AT_decl_file   : 4
    <24a>   DW_AT_decl_line   : 694
    <24c>   DW_AT_decl_column : 17
    <24c>   DW_AT_type        : <0xa0>
    <250>   DW_AT_data_member_location: 28
 <2><251>: Abbrev Number: 1 (DW_TAG_member)
    <252>   DW_AT_name        : (indirect string, offset: 0x14c7): CICR
    <256>   DW_AT_decl_file   : 4
    <256>   DW_AT_decl_line   : 695
    <258>   DW_AT_decl_column : 17
    <258>   DW_AT_type        : <0xa0>
    <25c>   DW_AT_data_member_location: 32
 <2><25d>: Abbrev Number: 1 (DW_TAG_member)
    <25e>   DW_AT_name        : (indirect string, offset: 0x94934): RESERVED0
    <262>   DW_AT_decl_file   : 4
    <262>   DW_AT_decl_line   : 696
    <264>   DW_AT_decl_column : 17
    <264>   DW_AT_type        : <0x94>
    <268>   DW_AT_data_member_location: 36
 <2><269>: Abbrev Number: 1 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0x7df1e): AHB1RSTR
    <26e>   DW_AT_decl_file   : 4
    <26e>   DW_AT_decl_line   : 697
    <270>   DW_AT_decl_column : 17
    <270>   DW_AT_type        : <0xa0>
    <274>   DW_AT_data_member_location: 40
 <2><275>: Abbrev Number: 1 (DW_TAG_member)
    <276>   DW_AT_name        : (indirect string, offset: 0x1d1de): AHB2RSTR
    <27a>   DW_AT_decl_file   : 4
    <27a>   DW_AT_decl_line   : 698
    <27c>   DW_AT_decl_column : 17
    <27c>   DW_AT_type        : <0xa0>
    <280>   DW_AT_data_member_location: 44
 <2><281>: Abbrev Number: 1 (DW_TAG_member)
    <282>   DW_AT_name        : (indirect string, offset: 0x342f4): AHB3RSTR
    <286>   DW_AT_decl_file   : 4
    <286>   DW_AT_decl_line   : 699
    <288>   DW_AT_decl_column : 17
    <288>   DW_AT_type        : <0xa0>
    <28c>   DW_AT_data_member_location: 48
 <2><28d>: Abbrev Number: 1 (DW_TAG_member)
    <28e>   DW_AT_name        : (indirect string, offset: 0x9493e): RESERVED1
    <292>   DW_AT_decl_file   : 4
    <292>   DW_AT_decl_line   : 700
    <294>   DW_AT_decl_column : 17
    <294>   DW_AT_type        : <0x94>
    <298>   DW_AT_data_member_location: 52
 <2><299>: Abbrev Number: 1 (DW_TAG_member)
    <29a>   DW_AT_name        : (indirect string, offset: 0x2025f): APB1RSTR1
    <29e>   DW_AT_decl_file   : 4
    <29e>   DW_AT_decl_line   : 701
    <2a0>   DW_AT_decl_column : 17
    <2a0>   DW_AT_type        : <0xa0>
    <2a4>   DW_AT_data_member_location: 56
 <2><2a5>: Abbrev Number: 1 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x20269): APB1RSTR2
    <2aa>   DW_AT_decl_file   : 4
    <2aa>   DW_AT_decl_line   : 702
    <2ac>   DW_AT_decl_column : 17
    <2ac>   DW_AT_type        : <0xa0>
    <2b0>   DW_AT_data_member_location: 60
 <2><2b1>: Abbrev Number: 1 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0x452d5): APB2RSTR
    <2b6>   DW_AT_decl_file   : 4
    <2b6>   DW_AT_decl_line   : 703
    <2b8>   DW_AT_decl_column : 17
    <2b8>   DW_AT_type        : <0xa0>
    <2bc>   DW_AT_data_member_location: 64
 <2><2bd>: Abbrev Number: 1 (DW_TAG_member)
    <2be>   DW_AT_name        : (indirect string, offset: 0x94948): RESERVED2
    <2c2>   DW_AT_decl_file   : 4
    <2c2>   DW_AT_decl_line   : 704
    <2c4>   DW_AT_decl_column : 17
    <2c4>   DW_AT_type        : <0x94>
    <2c8>   DW_AT_data_member_location: 68
 <2><2c9>: Abbrev Number: 1 (DW_TAG_member)
    <2ca>   DW_AT_name        : (indirect string, offset: 0xc557): AHB1ENR
    <2ce>   DW_AT_decl_file   : 4
    <2ce>   DW_AT_decl_line   : 705
    <2d0>   DW_AT_decl_column : 17
    <2d0>   DW_AT_type        : <0xa0>
    <2d4>   DW_AT_data_member_location: 72
 <2><2d5>: Abbrev Number: 1 (DW_TAG_member)
    <2d6>   DW_AT_name        : (indirect string, offset: 0x2a2be): AHB2ENR
    <2da>   DW_AT_decl_file   : 4
    <2da>   DW_AT_decl_line   : 706
    <2dc>   DW_AT_decl_column : 17
    <2dc>   DW_AT_type        : <0xa0>
    <2e0>   DW_AT_data_member_location: 76
 <2><2e1>: Abbrev Number: 1 (DW_TAG_member)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x477be): AHB3ENR
    <2e6>   DW_AT_decl_file   : 4
    <2e6>   DW_AT_decl_line   : 707
    <2e8>   DW_AT_decl_column : 17
    <2e8>   DW_AT_type        : <0xa0>
    <2ec>   DW_AT_data_member_location: 80
 <2><2ed>: Abbrev Number: 1 (DW_TAG_member)
    <2ee>   DW_AT_name        : (indirect string, offset: 0x94952): RESERVED3
    <2f2>   DW_AT_decl_file   : 4
    <2f2>   DW_AT_decl_line   : 708
    <2f4>   DW_AT_decl_column : 17
    <2f4>   DW_AT_type        : <0x94>
    <2f8>   DW_AT_data_member_location: 84
 <2><2f9>: Abbrev Number: 1 (DW_TAG_member)
    <2fa>   DW_AT_name        : (indirect string, offset: 0x5148): APB1ENR1
    <2fe>   DW_AT_decl_file   : 4
    <2fe>   DW_AT_decl_line   : 709
    <300>   DW_AT_decl_column : 17
    <300>   DW_AT_type        : <0xa0>
    <304>   DW_AT_data_member_location: 88
 <2><305>: Abbrev Number: 1 (DW_TAG_member)
    <306>   DW_AT_name        : (indirect string, offset: 0x5151): APB1ENR2
    <30a>   DW_AT_decl_file   : 4
    <30a>   DW_AT_decl_line   : 710
    <30c>   DW_AT_decl_column : 17
    <30c>   DW_AT_type        : <0xa0>
    <310>   DW_AT_data_member_location: 92
 <2><311>: Abbrev Number: 1 (DW_TAG_member)
    <312>   DW_AT_name        : (indirect string, offset: 0x12839): APB2ENR
    <316>   DW_AT_decl_file   : 4
    <316>   DW_AT_decl_line   : 711
    <318>   DW_AT_decl_column : 17
    <318>   DW_AT_type        : <0xa0>
    <31c>   DW_AT_data_member_location: 96
 <2><31d>: Abbrev Number: 1 (DW_TAG_member)
    <31e>   DW_AT_name        : (indirect string, offset: 0x58712): RESERVED4
    <322>   DW_AT_decl_file   : 4
    <322>   DW_AT_decl_line   : 712
    <324>   DW_AT_decl_column : 17
    <324>   DW_AT_type        : <0x94>
    <328>   DW_AT_data_member_location: 100
 <2><329>: Abbrev Number: 1 (DW_TAG_member)
    <32a>   DW_AT_name        : (indirect string, offset: 0x4921d): AHB1SMENR
    <32e>   DW_AT_decl_file   : 4
    <32e>   DW_AT_decl_line   : 713
    <330>   DW_AT_decl_column : 17
    <330>   DW_AT_type        : <0xa0>
    <334>   DW_AT_data_member_location: 104
 <2><335>: Abbrev Number: 1 (DW_TAG_member)
    <336>   DW_AT_name        : (indirect string, offset: 0x908da): AHB2SMENR
    <33a>   DW_AT_decl_file   : 4
    <33a>   DW_AT_decl_line   : 714
    <33c>   DW_AT_decl_column : 17
    <33c>   DW_AT_type        : <0xa0>
    <340>   DW_AT_data_member_location: 108
 <2><341>: Abbrev Number: 1 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0x3a543): AHB3SMENR
    <346>   DW_AT_decl_file   : 4
    <346>   DW_AT_decl_line   : 715
    <348>   DW_AT_decl_column : 17
    <348>   DW_AT_type        : <0xa0>
    <34c>   DW_AT_data_member_location: 112
 <2><34d>: Abbrev Number: 1 (DW_TAG_member)
    <34e>   DW_AT_name        : (indirect string, offset: 0x94980): RESERVED5
    <352>   DW_AT_decl_file   : 4
    <352>   DW_AT_decl_line   : 716
    <354>   DW_AT_decl_column : 17
    <354>   DW_AT_type        : <0x94>
    <358>   DW_AT_data_member_location: 116
 <2><359>: Abbrev Number: 1 (DW_TAG_member)
    <35a>   DW_AT_name        : (indirect string, offset: 0x59da): APB1SMENR1
    <35e>   DW_AT_decl_file   : 4
    <35e>   DW_AT_decl_line   : 717
    <360>   DW_AT_decl_column : 17
    <360>   DW_AT_type        : <0xa0>
    <364>   DW_AT_data_member_location: 120
 <2><365>: Abbrev Number: 1 (DW_TAG_member)
    <366>   DW_AT_name        : (indirect string, offset: 0x59e5): APB1SMENR2
    <36a>   DW_AT_decl_file   : 4
    <36a>   DW_AT_decl_line   : 718
    <36c>   DW_AT_decl_column : 17
    <36c>   DW_AT_type        : <0xa0>
    <370>   DW_AT_data_member_location: 124
 <2><371>: Abbrev Number: 1 (DW_TAG_member)
    <372>   DW_AT_name        : (indirect string, offset: 0x7f70a): APB2SMENR
    <376>   DW_AT_decl_file   : 4
    <376>   DW_AT_decl_line   : 719
    <378>   DW_AT_decl_column : 17
    <378>   DW_AT_type        : <0xa0>
    <37c>   DW_AT_data_member_location: 128
 <2><37d>: Abbrev Number: 1 (DW_TAG_member)
    <37e>   DW_AT_name        : (indirect string, offset: 0x9498a): RESERVED6
    <382>   DW_AT_decl_file   : 4
    <382>   DW_AT_decl_line   : 720
    <384>   DW_AT_decl_column : 17
    <384>   DW_AT_type        : <0x94>
    <388>   DW_AT_data_member_location: 132
 <2><389>: Abbrev Number: 1 (DW_TAG_member)
    <38a>   DW_AT_name        : (indirect string, offset: 0x30a10): CCIPR
    <38e>   DW_AT_decl_file   : 4
    <38e>   DW_AT_decl_line   : 721
    <390>   DW_AT_decl_column : 17
    <390>   DW_AT_type        : <0xa0>
    <394>   DW_AT_data_member_location: 136
 <2><395>: Abbrev Number: 1 (DW_TAG_member)
    <396>   DW_AT_name        : (indirect string, offset: 0x94994): RESERVED7
    <39a>   DW_AT_decl_file   : 4
    <39a>   DW_AT_decl_line   : 722
    <39c>   DW_AT_decl_column : 17
    <39c>   DW_AT_type        : <0x94>
    <3a0>   DW_AT_data_member_location: 140
 <2><3a1>: Abbrev Number: 1 (DW_TAG_member)
    <3a2>   DW_AT_name        : (indirect string, offset: 0x2950e): BDCR
    <3a6>   DW_AT_decl_file   : 4
    <3a6>   DW_AT_decl_line   : 723
    <3a8>   DW_AT_decl_column : 17
    <3a8>   DW_AT_type        : <0xa0>
    <3ac>   DW_AT_data_member_location: 144
 <2><3ad>: Abbrev Number: 2 (DW_TAG_member)
    <3ae>   DW_AT_name        : CSR
    <3b2>   DW_AT_decl_file   : 4
    <3b2>   DW_AT_decl_line   : 724
    <3b4>   DW_AT_decl_column : 17
    <3b4>   DW_AT_type        : <0xa0>
    <3b8>   DW_AT_data_member_location: 148
 <2><3b9>: Abbrev Number: 0
 <1><3ba>: Abbrev Number: 7 (DW_TAG_typedef)
    <3bb>   DW_AT_name        : (indirect string, offset: 0x49a7b): RCC_TypeDef
    <3bf>   DW_AT_decl_file   : 4
    <3bf>   DW_AT_decl_line   : 725
    <3c1>   DW_AT_decl_column : 3
    <3c1>   DW_AT_type        : <0x1ea>
 <1><3c5>: Abbrev Number: 15 (DW_TAG_variable)
    <3c6>   DW_AT_name        : (indirect string, offset: 0x8293a): tmpreg
    <3ca>   DW_AT_decl_file   : 1
    <3cb>   DW_AT_decl_line   : 5
    <3cc>   DW_AT_decl_column : 19
    <3cd>   DW_AT_type        : <0xa0>
    <3d1>   DW_AT_external    : 1
    <3d1>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><3d7>: Abbrev Number: 16 (DW_TAG_subprogram)
    <3d8>   DW_AT_external    : 1
    <3d8>   DW_AT_name        : (indirect string, offset: 0x293ad): I2C1_Config
    <3dc>   DW_AT_decl_file   : 1
    <3dd>   DW_AT_decl_line   : 98
    <3de>   DW_AT_decl_column : 6
    <3df>   DW_AT_prototyped  : 1
    <3df>   DW_AT_low_pc      : 0x8000770
    <3e3>   DW_AT_high_pc     : 0x144
    <3e7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3e9>   DW_AT_call_all_calls: 1
 <1><3e9>: Abbrev Number: 9 (DW_TAG_subprogram)
    <3ea>   DW_AT_external    : 1
    <3ea>   DW_AT_name        : (indirect string, offset: 0x6dc7): I2C1_Write
    <3ee>   DW_AT_decl_file   : 1
    <3ee>   DW_AT_decl_line   : 75
    <3ef>   DW_AT_decl_column : 6
    <3ef>   DW_AT_prototyped  : 1
    <3ef>   DW_AT_low_pc      : 0x80006e4
    <3f3>   DW_AT_high_pc     : 0x8c
    <3f7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3f9>   DW_AT_call_all_calls: 1
    <3f9>   DW_AT_sibling     : <0x428>
 <2><3fd>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <3fe>   DW_AT_name        : (indirect string, offset: 0x2dac0): devAddr
    <402>   DW_AT_decl_file   : 1
    <402>   DW_AT_decl_line   : 75
    <403>   DW_AT_decl_column : 25
    <404>   DW_AT_type        : <0x88>
    <408>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><40b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <40c>   DW_AT_name        : (indirect string, offset: 0x59d8b): regAddr
    <410>   DW_AT_decl_file   : 1
    <410>   DW_AT_decl_line   : 75
    <411>   DW_AT_decl_column : 42
    <412>   DW_AT_type        : <0x88>
    <416>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><419>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <41a>   DW_AT_name        : (indirect string, offset: 0x4a1e0): data
    <41e>   DW_AT_decl_file   : 1
    <41e>   DW_AT_decl_line   : 75
    <41f>   DW_AT_decl_column : 59
    <420>   DW_AT_type        : <0x88>
    <424>   DW_AT_location    : 2 byte block: 91 75 	(DW_OP_fbreg: -11)
 <2><427>: Abbrev Number: 0
 <1><428>: Abbrev Number: 17 (DW_TAG_subprogram)
    <429>   DW_AT_external    : 1
    <429>   DW_AT_name        : (indirect string, offset: 0x6dde5): I2C1_Read
    <42d>   DW_AT_decl_file   : 1
    <42e>   DW_AT_decl_line   : 35
    <42f>   DW_AT_decl_column : 9
    <430>   DW_AT_prototyped  : 1
    <430>   DW_AT_type        : <0x88>
    <434>   DW_AT_low_pc      : 0x8000634
    <438>   DW_AT_high_pc     : 0xb0
    <43c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <43e>   DW_AT_call_all_calls: 1
    <43e>   DW_AT_sibling     : <0x46e>
 <2><442>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <443>   DW_AT_name        : (indirect string, offset: 0x2dac0): devAddr
    <447>   DW_AT_decl_file   : 1
    <447>   DW_AT_decl_line   : 35
    <448>   DW_AT_decl_column : 27
    <449>   DW_AT_type        : <0x88>
    <44d>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><450>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <451>   DW_AT_name        : (indirect string, offset: 0x59d8b): regAddr
    <455>   DW_AT_decl_file   : 1
    <455>   DW_AT_decl_line   : 35
    <456>   DW_AT_decl_column : 44
    <457>   DW_AT_type        : <0x88>
    <45b>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><45e>: Abbrev Number: 18 (DW_TAG_variable)
    <45f>   DW_AT_name        : (indirect string, offset: 0x4a1e0): data
    <463>   DW_AT_decl_file   : 1
    <464>   DW_AT_decl_line   : 36
    <465>   DW_AT_decl_column : 10
    <466>   DW_AT_type        : <0x88>
    <46a>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><46d>: Abbrev Number: 0
 <1><46e>: Abbrev Number: 9 (DW_TAG_subprogram)
    <46f>   DW_AT_external    : 1
    <46f>   DW_AT_name        : (indirect string, offset: 0x3bfaa): I2C1_MultiRead
    <473>   DW_AT_decl_file   : 1
    <473>   DW_AT_decl_line   : 8
    <474>   DW_AT_decl_column : 6
    <474>   DW_AT_prototyped  : 1
    <474>   DW_AT_low_pc      : 0x8000560
    <478>   DW_AT_high_pc     : 0xd4
    <47c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <47e>   DW_AT_call_all_calls: 1
    <47e>   DW_AT_sibling     : <0x4d0>
 <2><482>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <483>   DW_AT_name        : (indirect string, offset: 0x2dac0): devAddr
    <487>   DW_AT_decl_file   : 1
    <487>   DW_AT_decl_line   : 8
    <488>   DW_AT_decl_column : 29
    <489>   DW_AT_type        : <0x88>
    <48d>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><490>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <491>   DW_AT_name        : (indirect string, offset: 0x59d8b): regAddr
    <495>   DW_AT_decl_file   : 1
    <495>   DW_AT_decl_line   : 8
    <496>   DW_AT_decl_column : 46
    <497>   DW_AT_type        : <0x88>
    <49b>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><49e>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <49f>   DW_AT_name        : buf
    <4a3>   DW_AT_decl_file   : 1
    <4a3>   DW_AT_decl_line   : 8
    <4a3>   DW_AT_decl_column : 64
    <4a4>   DW_AT_type        : <0x4d0>
    <4a8>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><4ab>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <4ac>   DW_AT_name        : len
    <4b0>   DW_AT_decl_file   : 1
    <4b0>   DW_AT_decl_line   : 8
    <4b0>   DW_AT_decl_column : 77
    <4b1>   DW_AT_type        : <0x88>
    <4b5>   DW_AT_location    : 2 byte block: 91 6d 	(DW_OP_fbreg: -19)
 <2><4b8>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <4b9>   DW_AT_low_pc      : 0x80005e0
    <4bd>   DW_AT_high_pc     : 0x30
 <3><4c1>: Abbrev Number: 20 (DW_TAG_variable)
    <4c2>   DW_AT_name        : i
    <4c4>   DW_AT_decl_file   : 1
    <4c5>   DW_AT_decl_line   : 25
    <4c6>   DW_AT_decl_column : 17
    <4c7>   DW_AT_type        : <0x88>
    <4cb>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <3><4ce>: Abbrev Number: 0
 <2><4cf>: Abbrev Number: 0
 <1><4d0>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <4d1>   DW_AT_byte_size   : 4
    <4d2>   DW_AT_type        : <0x88>
 <1><4d6>: Abbrev Number: 0
  Compilation Unit @ offset 0x4d7:
   Length:        0x201 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x15b
   Pointer Size:  4
 <0><4e3>: Abbrev Number: 8 (DW_TAG_compile_unit)
    <4e4>   DW_AT_producer    : (indirect string, offset: 0x299ef): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <4e8>   DW_AT_language    : 29	(C11)
    <4e9>   DW_AT_name        : (indirect string, offset: 0xa012f): ../Core/Src/Drivers/LSM6DS3.c
    <4ed>   DW_AT_comp_dir    : (indirect string, offset: 0x57523): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <4f1>   DW_AT_ranges      : 0x35
    <4f5>   DW_AT_low_pc      : 0
    <4f9>   DW_AT_stmt_list   : 0x7dd
    <4fd>   DW_AT_macros      : 0x1c406
 <1><501>: Abbrev Number: 1 (DW_TAG_base_type)
    <502>   DW_AT_byte_size   : 1
    <503>   DW_AT_encoding    : 6	(signed char)
    <504>   DW_AT_name        : (indirect string, offset: 0x4fce6): signed char
 <1><508>: Abbrev Number: 3 (DW_TAG_typedef)
    <509>   DW_AT_name        : (indirect string, offset: 0x2e54f): __uint8_t
    <50d>   DW_AT_decl_file   : 2
    <50e>   DW_AT_decl_line   : 43
    <50f>   DW_AT_decl_column : 24
    <510>   DW_AT_type        : <0x514>
 <1><514>: Abbrev Number: 1 (DW_TAG_base_type)
    <515>   DW_AT_byte_size   : 1
    <516>   DW_AT_encoding    : 8	(unsigned char)
    <517>   DW_AT_name        : (indirect string, offset: 0x9827d): unsigned char
 <1><51b>: Abbrev Number: 3 (DW_TAG_typedef)
    <51c>   DW_AT_name        : (indirect string, offset: 0x9ed39): __int16_t
    <520>   DW_AT_decl_file   : 2
    <521>   DW_AT_decl_line   : 55
    <522>   DW_AT_decl_column : 24
    <523>   DW_AT_type        : <0x527>
 <1><527>: Abbrev Number: 1 (DW_TAG_base_type)
    <528>   DW_AT_byte_size   : 2
    <529>   DW_AT_encoding    : 5	(signed)
    <52a>   DW_AT_name        : (indirect string, offset: 0x7583d): short int
 <1><52e>: Abbrev Number: 3 (DW_TAG_typedef)
    <52f>   DW_AT_name        : (indirect string, offset: 0xa145a): __uint16_t
    <533>   DW_AT_decl_file   : 2
    <534>   DW_AT_decl_line   : 57
    <535>   DW_AT_decl_column : 25
    <536>   DW_AT_type        : <0x53a>
 <1><53a>: Abbrev Number: 1 (DW_TAG_base_type)
    <53b>   DW_AT_byte_size   : 2
    <53c>   DW_AT_encoding    : 7	(unsigned)
    <53d>   DW_AT_name        : (indirect string, offset: 0x970ba): short unsigned int
 <1><541>: Abbrev Number: 1 (DW_TAG_base_type)
    <542>   DW_AT_byte_size   : 4
    <543>   DW_AT_encoding    : 5	(signed)
    <544>   DW_AT_name        : (indirect string, offset: 0xcd5a): long int
 <1><548>: Abbrev Number: 1 (DW_TAG_base_type)
    <549>   DW_AT_byte_size   : 4
    <54a>   DW_AT_encoding    : 7	(unsigned)
    <54b>   DW_AT_name        : (indirect string, offset: 0x3ccb2): long unsigned int
 <1><54f>: Abbrev Number: 1 (DW_TAG_base_type)
    <550>   DW_AT_byte_size   : 8
    <551>   DW_AT_encoding    : 5	(signed)
    <552>   DW_AT_name        : (indirect string, offset: 0x48957): long long int
 <1><556>: Abbrev Number: 1 (DW_TAG_base_type)
    <557>   DW_AT_byte_size   : 8
    <558>   DW_AT_encoding    : 7	(unsigned)
    <559>   DW_AT_name        : (indirect string, offset: 0x20f43): long long unsigned int
 <1><55d>: Abbrev Number: 9 (DW_TAG_base_type)
    <55e>   DW_AT_byte_size   : 4
    <55f>   DW_AT_encoding    : 5	(signed)
    <560>   DW_AT_name        : int
 <1><564>: Abbrev Number: 1 (DW_TAG_base_type)
    <565>   DW_AT_byte_size   : 4
    <566>   DW_AT_encoding    : 7	(unsigned)
    <567>   DW_AT_name        : (indirect string, offset: 0xc591): unsigned int
 <1><56b>: Abbrev Number: 1 (DW_TAG_base_type)
    <56c>   DW_AT_byte_size   : 8
    <56d>   DW_AT_encoding    : 4	(float)
    <56e>   DW_AT_name        : (indirect string, offset: 0x9e78c): long double
 <1><572>: Abbrev Number: 1 (DW_TAG_base_type)
    <573>   DW_AT_byte_size   : 1
    <574>   DW_AT_encoding    : 8	(unsigned char)
    <575>   DW_AT_name        : (indirect string, offset: 0xb96a0): char
 <1><579>: Abbrev Number: 10 (DW_TAG_const_type)
    <57a>   DW_AT_type        : <0x572>
 <1><57e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <57f>   DW_AT_byte_size   : 4
    <57f>   DW_AT_type        : <0x579>
 <1><583>: Abbrev Number: 3 (DW_TAG_typedef)
    <584>   DW_AT_name        : (indirect string, offset: 0x2e551): uint8_t
    <588>   DW_AT_decl_file   : 3
    <589>   DW_AT_decl_line   : 24
    <58a>   DW_AT_decl_column : 19
    <58b>   DW_AT_type        : <0x508>
 <1><58f>: Abbrev Number: 3 (DW_TAG_typedef)
    <590>   DW_AT_name        : (indirect string, offset: 0x9ed3b): int16_t
    <594>   DW_AT_decl_file   : 3
    <595>   DW_AT_decl_line   : 32
    <596>   DW_AT_decl_column : 19
    <597>   DW_AT_type        : <0x51b>
 <1><59b>: Abbrev Number: 3 (DW_TAG_typedef)
    <59c>   DW_AT_name        : (indirect string, offset: 0xa145c): uint16_t
    <5a0>   DW_AT_decl_file   : 3
    <5a1>   DW_AT_decl_line   : 36
    <5a2>   DW_AT_decl_column : 20
    <5a3>   DW_AT_type        : <0x52e>
 <1><5a7>: Abbrev Number: 11 (DW_TAG_structure_type)
    <5a8>   DW_AT_byte_size   : 12
    <5a9>   DW_AT_decl_file   : 4
    <5aa>   DW_AT_decl_line   : 35
    <5ab>   DW_AT_decl_column : 9
    <5ac>   DW_AT_sibling     : <0x5f3>
 <2><5b0>: Abbrev Number: 4 (DW_TAG_member)
    <5b1>   DW_AT_name        : gx
    <5b4>   DW_AT_decl_file   : 4
    <5b4>   DW_AT_decl_line   : 36
    <5b5>   DW_AT_decl_column : 10
    <5b6>   DW_AT_type        : <0x58f>
    <5ba>   DW_AT_data_member_location: 0
 <2><5bb>: Abbrev Number: 4 (DW_TAG_member)
    <5bc>   DW_AT_name        : gy
    <5bf>   DW_AT_decl_file   : 4
    <5bf>   DW_AT_decl_line   : 36
    <5c0>   DW_AT_decl_column : 14
    <5c1>   DW_AT_type        : <0x58f>
    <5c5>   DW_AT_data_member_location: 2
 <2><5c6>: Abbrev Number: 4 (DW_TAG_member)
    <5c7>   DW_AT_name        : gz
    <5ca>   DW_AT_decl_file   : 4
    <5ca>   DW_AT_decl_line   : 36
    <5cb>   DW_AT_decl_column : 18
    <5cc>   DW_AT_type        : <0x58f>
    <5d0>   DW_AT_data_member_location: 4
 <2><5d1>: Abbrev Number: 4 (DW_TAG_member)
    <5d2>   DW_AT_name        : ax
    <5d5>   DW_AT_decl_file   : 4
    <5d5>   DW_AT_decl_line   : 37
    <5d6>   DW_AT_decl_column : 10
    <5d7>   DW_AT_type        : <0x58f>
    <5db>   DW_AT_data_member_location: 6
 <2><5dc>: Abbrev Number: 4 (DW_TAG_member)
    <5dd>   DW_AT_name        : ay
    <5e0>   DW_AT_decl_file   : 4
    <5e0>   DW_AT_decl_line   : 37
    <5e1>   DW_AT_decl_column : 14
    <5e2>   DW_AT_type        : <0x58f>
    <5e6>   DW_AT_data_member_location: 8
 <2><5e7>: Abbrev Number: 4 (DW_TAG_member)
    <5e8>   DW_AT_name        : az
    <5eb>   DW_AT_decl_file   : 4
    <5eb>   DW_AT_decl_line   : 37
    <5ec>   DW_AT_decl_column : 18
    <5ed>   DW_AT_type        : <0x58f>
    <5f1>   DW_AT_data_member_location: 10
 <2><5f2>: Abbrev Number: 0
 <1><5f3>: Abbrev Number: 3 (DW_TAG_typedef)
    <5f4>   DW_AT_name        : (indirect string, offset: 0xa09d0): LSM6DS3_Sample
    <5f8>   DW_AT_decl_file   : 4
    <5f9>   DW_AT_decl_line   : 38
    <5fa>   DW_AT_decl_column : 2
    <5fb>   DW_AT_type        : <0x5a7>
 <1><5ff>: Abbrev Number: 6 (DW_TAG_subprogram)
    <600>   DW_AT_external    : 1
    <600>   DW_AT_name        : (indirect string, offset: 0x3bfaa): I2C1_MultiRead
    <604>   DW_AT_decl_file   : 5
    <604>   DW_AT_decl_line   : 11
    <605>   DW_AT_decl_column : 6
    <605>   DW_AT_prototyped  : 1
    <605>   DW_AT_declaration : 1
    <605>   DW_AT_sibling     : <0x61e>
 <2><609>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <60a>   DW_AT_type        : <0x583>
 <2><60e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <60f>   DW_AT_type        : <0x583>
 <2><613>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <614>   DW_AT_type        : <0x61e>
 <2><618>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <619>   DW_AT_type        : <0x583>
 <2><61d>: Abbrev Number: 0
 <1><61e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <61f>   DW_AT_byte_size   : 4
    <61f>   DW_AT_type        : <0x583>
 <1><623>: Abbrev Number: 7 (DW_TAG_subprogram)
    <624>   DW_AT_external    : 1
    <624>   DW_AT_name        : (indirect string, offset: 0x9e4da): printf
    <628>   DW_AT_decl_file   : 6
    <629>   DW_AT_decl_line   : 206
    <62a>   DW_AT_decl_column : 5
    <62b>   DW_AT_prototyped  : 1
    <62b>   DW_AT_type        : <0x55d>
    <62f>   DW_AT_declaration : 1
    <62f>   DW_AT_sibling     : <0x63a>
 <2><633>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <634>   DW_AT_type        : <0x57e>
 <2><638>: Abbrev Number: 12 (DW_TAG_unspecified_parameters)
 <2><639>: Abbrev Number: 0
 <1><63a>: Abbrev Number: 6 (DW_TAG_subprogram)
    <63b>   DW_AT_external    : 1
    <63b>   DW_AT_name        : (indirect string, offset: 0x6dc7): I2C1_Write
    <63f>   DW_AT_decl_file   : 5
    <63f>   DW_AT_decl_line   : 13
    <640>   DW_AT_decl_column : 6
    <640>   DW_AT_prototyped  : 1
    <640>   DW_AT_declaration : 1
    <640>   DW_AT_sibling     : <0x654>
 <2><644>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <645>   DW_AT_type        : <0x583>
 <2><649>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <64a>   DW_AT_type        : <0x583>
 <2><64e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <64f>   DW_AT_type        : <0x583>
 <2><653>: Abbrev Number: 0
 <1><654>: Abbrev Number: 7 (DW_TAG_subprogram)
    <655>   DW_AT_external    : 1
    <655>   DW_AT_name        : (indirect string, offset: 0x6dde5): I2C1_Read
    <659>   DW_AT_decl_file   : 5
    <65a>   DW_AT_decl_line   : 12
    <65b>   DW_AT_decl_column : 9
    <65c>   DW_AT_prototyped  : 1
    <65c>   DW_AT_type        : <0x583>
    <660>   DW_AT_declaration : 1
    <660>   DW_AT_sibling     : <0x66f>
 <2><664>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <665>   DW_AT_type        : <0x583>
 <2><669>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <66a>   DW_AT_type        : <0x583>
 <2><66e>: Abbrev Number: 0
 <1><66f>: Abbrev Number: 13 (DW_TAG_subprogram)
    <670>   DW_AT_external    : 1
    <670>   DW_AT_name        : (indirect string, offset: 0x9f0f9): LSM6DS3_GyroAccelRead
    <674>   DW_AT_decl_file   : 1
    <675>   DW_AT_decl_line   : 23
    <676>   DW_AT_decl_column : 6
    <677>   DW_AT_prototyped  : 1
    <677>   DW_AT_low_pc      : 0x8000908
    <67b>   DW_AT_high_pc     : 0x8a
    <67f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <681>   DW_AT_call_all_tail_calls: 1
    <681>   DW_AT_sibling     : <0x6a4>
 <2><685>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <686>   DW_AT_name        : (indirect string, offset: 0x4a1e0): data
    <68a>   DW_AT_decl_file   : 1
    <68b>   DW_AT_decl_line   : 23
    <68c>   DW_AT_decl_column : 44
    <68d>   DW_AT_type        : <0x6a4>
    <691>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><694>: Abbrev Number: 15 (DW_TAG_variable)
    <695>   DW_AT_name        : buf
    <699>   DW_AT_decl_file   : 1
    <69a>   DW_AT_decl_line   : 24
    <69b>   DW_AT_decl_column : 10
    <69c>   DW_AT_type        : <0x6a9>
    <6a0>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><6a3>: Abbrev Number: 0
 <1><6a4>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <6a5>   DW_AT_byte_size   : 4
    <6a5>   DW_AT_type        : <0x5f3>
 <1><6a9>: Abbrev Number: 16 (DW_TAG_array_type)
    <6aa>   DW_AT_type        : <0x583>
    <6ae>   DW_AT_sibling     : <0x6b9>
 <2><6b2>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <6b3>   DW_AT_type        : <0x564>
    <6b7>   DW_AT_upper_bound : 11
 <2><6b8>: Abbrev Number: 0
 <1><6b9>: Abbrev Number: 18 (DW_TAG_subprogram)
    <6ba>   DW_AT_external    : 1
    <6ba>   DW_AT_name        : (indirect string, offset: 0x9f35d): LSM6DS3_Init
    <6be>   DW_AT_decl_file   : 1
    <6bf>   DW_AT_decl_line   : 7
    <6c0>   DW_AT_decl_column : 6
    <6c1>   DW_AT_prototyped  : 1
    <6c1>   DW_AT_low_pc      : 0x80008b4
    <6c5>   DW_AT_high_pc     : 0x54
    <6c9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6cb>   DW_AT_call_all_tail_calls: 1
 <2><6cb>: Abbrev Number: 19 (DW_TAG_variable)
    <6cc>   DW_AT_name        : (indirect string, offset: 0xa0179): result
    <6d0>   DW_AT_decl_file   : 1
    <6d1>   DW_AT_decl_line   : 8
    <6d2>   DW_AT_decl_column : 10
    <6d3>   DW_AT_type        : <0x583>
    <6d7>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><6da>: Abbrev Number: 0
 <1><6db>: Abbrev Number: 0
  Compilation Unit @ offset 0x6dc:
   Length:        0x435 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x27b
   Pointer Size:  4
 <0><6e8>: Abbrev Number: 11 (DW_TAG_compile_unit)
    <6e9>   DW_AT_producer    : (indirect string, offset: 0x299ef): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <6ed>   DW_AT_language    : 29	(C11)
    <6ee>   DW_AT_name        : (indirect string, offset: 0xa1e9d): ../Core/Src/Drivers/USART.c
    <6f2>   DW_AT_comp_dir    : (indirect string, offset: 0x57523): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <6f6>   DW_AT_ranges      : 0x4f
    <6fa>   DW_AT_low_pc      : 0
    <6fe>   DW_AT_stmt_list   : 0xed2
    <702>   DW_AT_macros      : 0x1d1cb
 <1><706>: Abbrev Number: 3 (DW_TAG_base_type)
    <707>   DW_AT_byte_size   : 1
    <708>   DW_AT_encoding    : 6	(signed char)
    <709>   DW_AT_name        : (indirect string, offset: 0x4fce6): signed char
 <1><70d>: Abbrev Number: 4 (DW_TAG_typedef)
    <70e>   DW_AT_name        : (indirect string, offset: 0x2e54f): __uint8_t
    <712>   DW_AT_decl_file   : 2
    <713>   DW_AT_decl_line   : 43
    <714>   DW_AT_decl_column : 24
    <715>   DW_AT_type        : <0x719>
 <1><719>: Abbrev Number: 3 (DW_TAG_base_type)
    <71a>   DW_AT_byte_size   : 1
    <71b>   DW_AT_encoding    : 8	(unsigned char)
    <71c>   DW_AT_name        : (indirect string, offset: 0x9827d): unsigned char
 <1><720>: Abbrev Number: 3 (DW_TAG_base_type)
    <721>   DW_AT_byte_size   : 2
    <722>   DW_AT_encoding    : 5	(signed)
    <723>   DW_AT_name        : (indirect string, offset: 0x7583d): short int
 <1><727>: Abbrev Number: 3 (DW_TAG_base_type)
    <728>   DW_AT_byte_size   : 2
    <729>   DW_AT_encoding    : 7	(unsigned)
    <72a>   DW_AT_name        : (indirect string, offset: 0x970ba): short unsigned int
 <1><72e>: Abbrev Number: 3 (DW_TAG_base_type)
    <72f>   DW_AT_byte_size   : 4
    <730>   DW_AT_encoding    : 5	(signed)
    <731>   DW_AT_name        : (indirect string, offset: 0xcd5a): long int
 <1><735>: Abbrev Number: 4 (DW_TAG_typedef)
    <736>   DW_AT_name        : (indirect string, offset: 0x652d9): __uint32_t
    <73a>   DW_AT_decl_file   : 2
    <73b>   DW_AT_decl_line   : 79
    <73c>   DW_AT_decl_column : 25
    <73d>   DW_AT_type        : <0x741>
 <1><741>: Abbrev Number: 3 (DW_TAG_base_type)
    <742>   DW_AT_byte_size   : 4
    <743>   DW_AT_encoding    : 7	(unsigned)
    <744>   DW_AT_name        : (indirect string, offset: 0x3ccb2): long unsigned int
 <1><748>: Abbrev Number: 3 (DW_TAG_base_type)
    <749>   DW_AT_byte_size   : 8
    <74a>   DW_AT_encoding    : 5	(signed)
    <74b>   DW_AT_name        : (indirect string, offset: 0x48957): long long int
 <1><74f>: Abbrev Number: 3 (DW_TAG_base_type)
    <750>   DW_AT_byte_size   : 8
    <751>   DW_AT_encoding    : 7	(unsigned)
    <752>   DW_AT_name        : (indirect string, offset: 0x20f43): long long unsigned int
 <1><756>: Abbrev Number: 12 (DW_TAG_base_type)
    <757>   DW_AT_byte_size   : 4
    <758>   DW_AT_encoding    : 5	(signed)
    <759>   DW_AT_name        : int
 <1><75d>: Abbrev Number: 3 (DW_TAG_base_type)
    <75e>   DW_AT_byte_size   : 4
    <75f>   DW_AT_encoding    : 7	(unsigned)
    <760>   DW_AT_name        : (indirect string, offset: 0xc591): unsigned int
 <1><764>: Abbrev Number: 3 (DW_TAG_base_type)
    <765>   DW_AT_byte_size   : 8
    <766>   DW_AT_encoding    : 4	(float)
    <767>   DW_AT_name        : (indirect string, offset: 0x9e78c): long double
 <1><76b>: Abbrev Number: 3 (DW_TAG_base_type)
    <76c>   DW_AT_byte_size   : 1
    <76d>   DW_AT_encoding    : 8	(unsigned char)
    <76e>   DW_AT_name        : (indirect string, offset: 0xb96a0): char
 <1><772>: Abbrev Number: 13 (DW_TAG_const_type)
    <773>   DW_AT_type        : <0x76b>
 <1><777>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <778>   DW_AT_byte_size   : 4
    <778>   DW_AT_type        : <0x772>
 <1><77c>: Abbrev Number: 4 (DW_TAG_typedef)
    <77d>   DW_AT_name        : (indirect string, offset: 0x2e551): uint8_t
    <781>   DW_AT_decl_file   : 3
    <782>   DW_AT_decl_line   : 24
    <783>   DW_AT_decl_column : 19
    <784>   DW_AT_type        : <0x70d>
 <1><788>: Abbrev Number: 4 (DW_TAG_typedef)
    <789>   DW_AT_name        : (indirect string, offset: 0xd74e7): uint32_t
    <78d>   DW_AT_decl_file   : 3
    <78e>   DW_AT_decl_line   : 48
    <78f>   DW_AT_decl_column : 20
    <790>   DW_AT_type        : <0x735>
 <1><794>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <795>   DW_AT_type        : <0x788>
 <1><799>: Abbrev Number: 5 (DW_TAG_structure_type)
    <79a>   DW_AT_byte_size   : 48
    <79b>   DW_AT_decl_file   : 4
    <79b>   DW_AT_decl_line   : 531
    <79d>   DW_AT_decl_column : 9
    <79d>   DW_AT_sibling     : <0x826>
 <2><7a1>: Abbrev Number: 1 (DW_TAG_member)
    <7a2>   DW_AT_name        : (indirect string, offset: 0x10f4): MODER
    <7a6>   DW_AT_decl_file   : 4
    <7a6>   DW_AT_decl_line   : 533
    <7a8>   DW_AT_decl_column : 17
    <7a8>   DW_AT_type        : <0x794>
    <7ac>   DW_AT_data_member_location: 0
 <2><7ad>: Abbrev Number: 1 (DW_TAG_member)
    <7ae>   DW_AT_name        : (indirect string, offset: 0x7a54b): OTYPER
    <7b2>   DW_AT_decl_file   : 4
    <7b2>   DW_AT_decl_line   : 534
    <7b4>   DW_AT_decl_column : 17
    <7b4>   DW_AT_type        : <0x794>
    <7b8>   DW_AT_data_member_location: 4
 <2><7b9>: Abbrev Number: 1 (DW_TAG_member)
    <7ba>   DW_AT_name        : (indirect string, offset: 0x89434): OSPEEDR
    <7be>   DW_AT_decl_file   : 4
    <7be>   DW_AT_decl_line   : 535
    <7c0>   DW_AT_decl_column : 17
    <7c0>   DW_AT_type        : <0x794>
    <7c4>   DW_AT_data_member_location: 8
 <2><7c5>: Abbrev Number: 1 (DW_TAG_member)
    <7c6>   DW_AT_name        : (indirect string, offset: 0x66ac3): PUPDR
    <7ca>   DW_AT_decl_file   : 4
    <7ca>   DW_AT_decl_line   : 536
    <7cc>   DW_AT_decl_column : 17
    <7cc>   DW_AT_type        : <0x794>
    <7d0>   DW_AT_data_member_location: 12
 <2><7d1>: Abbrev Number: 2 (DW_TAG_member)
    <7d2>   DW_AT_name        : IDR
    <7d6>   DW_AT_decl_file   : 4
    <7d6>   DW_AT_decl_line   : 537
    <7d8>   DW_AT_decl_column : 17
    <7d8>   DW_AT_type        : <0x794>
    <7dc>   DW_AT_data_member_location: 16
 <2><7dd>: Abbrev Number: 2 (DW_TAG_member)
    <7de>   DW_AT_name        : ODR
    <7e2>   DW_AT_decl_file   : 4
    <7e2>   DW_AT_decl_line   : 538
    <7e4>   DW_AT_decl_column : 17
    <7e4>   DW_AT_type        : <0x794>
    <7e8>   DW_AT_data_member_location: 20
 <2><7e9>: Abbrev Number: 1 (DW_TAG_member)
    <7ea>   DW_AT_name        : (indirect string, offset: 0x239c6): BSRR
    <7ee>   DW_AT_decl_file   : 4
    <7ee>   DW_AT_decl_line   : 539
    <7f0>   DW_AT_decl_column : 17
    <7f0>   DW_AT_type        : <0x794>
    <7f4>   DW_AT_data_member_location: 24
 <2><7f5>: Abbrev Number: 1 (DW_TAG_member)
    <7f6>   DW_AT_name        : (indirect string, offset: 0x877c4): LCKR
    <7fa>   DW_AT_decl_file   : 4
    <7fa>   DW_AT_decl_line   : 540
    <7fc>   DW_AT_decl_column : 17
    <7fc>   DW_AT_type        : <0x794>
    <800>   DW_AT_data_member_location: 28
 <2><801>: Abbrev Number: 2 (DW_TAG_member)
    <802>   DW_AT_name        : AFR
    <806>   DW_AT_decl_file   : 4
    <806>   DW_AT_decl_line   : 541
    <808>   DW_AT_decl_column : 17
    <808>   DW_AT_type        : <0x836>
    <80c>   DW_AT_data_member_location: 32
 <2><80d>: Abbrev Number: 2 (DW_TAG_member)
    <80e>   DW_AT_name        : BRR
    <812>   DW_AT_decl_file   : 4
    <812>   DW_AT_decl_line   : 542
    <814>   DW_AT_decl_column : 17
    <814>   DW_AT_type        : <0x794>
    <818>   DW_AT_data_member_location: 40
 <2><819>: Abbrev Number: 1 (DW_TAG_member)
    <81a>   DW_AT_name        : (indirect string, offset: 0x1b92): ASCR
    <81e>   DW_AT_decl_file   : 4
    <81e>   DW_AT_decl_line   : 543
    <820>   DW_AT_decl_column : 17
    <820>   DW_AT_type        : <0x794>
    <824>   DW_AT_data_member_location: 44
 <2><825>: Abbrev Number: 0
 <1><826>: Abbrev Number: 14 (DW_TAG_array_type)
    <827>   DW_AT_type        : <0x794>
    <82b>   DW_AT_sibling     : <0x836>
 <2><82f>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <830>   DW_AT_type        : <0x75d>
    <834>   DW_AT_upper_bound : 1
 <2><835>: Abbrev Number: 0
 <1><836>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <837>   DW_AT_type        : <0x826>
 <1><83b>: Abbrev Number: 6 (DW_TAG_typedef)
    <83c>   DW_AT_name        : (indirect string, offset: 0x991cb): GPIO_TypeDef
    <840>   DW_AT_decl_file   : 4
    <840>   DW_AT_decl_line   : 545
    <842>   DW_AT_decl_column : 3
    <842>   DW_AT_type        : <0x799>
 <1><846>: Abbrev Number: 5 (DW_TAG_structure_type)
    <847>   DW_AT_byte_size   : 152
    <848>   DW_AT_decl_file   : 4
    <848>   DW_AT_decl_line   : 685
    <84a>   DW_AT_decl_column : 9
    <84a>   DW_AT_sibling     : <0xa16>
 <2><84e>: Abbrev Number: 2 (DW_TAG_member)
    <84f>   DW_AT_name        : CR
    <852>   DW_AT_decl_file   : 4
    <852>   DW_AT_decl_line   : 687
    <854>   DW_AT_decl_column : 17
    <854>   DW_AT_type        : <0x794>
    <858>   DW_AT_data_member_location: 0
 <2><859>: Abbrev Number: 1 (DW_TAG_member)
    <85a>   DW_AT_name        : (indirect string, offset: 0x6af01): ICSCR
    <85e>   DW_AT_decl_file   : 4
    <85e>   DW_AT_decl_line   : 688
    <860>   DW_AT_decl_column : 17
    <860>   DW_AT_type        : <0x794>
    <864>   DW_AT_data_member_location: 4
 <2><865>: Abbrev Number: 1 (DW_TAG_member)
    <866>   DW_AT_name        : (indirect string, offset: 0x34674): CFGR
    <86a>   DW_AT_decl_file   : 4
    <86a>   DW_AT_decl_line   : 689
    <86c>   DW_AT_decl_column : 17
    <86c>   DW_AT_type        : <0x794>
    <870>   DW_AT_data_member_location: 8
 <2><871>: Abbrev Number: 1 (DW_TAG_member)
    <872>   DW_AT_name        : (indirect string, offset: 0x6f093): PLLCFGR
    <876>   DW_AT_decl_file   : 4
    <876>   DW_AT_decl_line   : 690
    <878>   DW_AT_decl_column : 17
    <878>   DW_AT_type        : <0x794>
    <87c>   DW_AT_data_member_location: 12
 <2><87d>: Abbrev Number: 1 (DW_TAG_member)
    <87e>   DW_AT_name        : (indirect string, offset: 0x3466d): PLLSAI1CFGR
    <882>   DW_AT_decl_file   : 4
    <882>   DW_AT_decl_line   : 691
    <884>   DW_AT_decl_column : 17
    <884>   DW_AT_type        : <0x794>
    <888>   DW_AT_data_member_location: 16
 <2><889>: Abbrev Number: 1 (DW_TAG_member)
    <88a>   DW_AT_name        : (indirect string, offset: 0x6750c): PLLSAI2CFGR
    <88e>   DW_AT_decl_file   : 4
    <88e>   DW_AT_decl_line   : 692
    <890>   DW_AT_decl_column : 17
    <890>   DW_AT_type        : <0x794>
    <894>   DW_AT_data_member_location: 20
 <2><895>: Abbrev Number: 1 (DW_TAG_member)
    <896>   DW_AT_name        : (indirect string, offset: 0x1e2c): CIER
    <89a>   DW_AT_decl_file   : 4
    <89a>   DW_AT_decl_line   : 693
    <89c>   DW_AT_decl_column : 17
    <89c>   DW_AT_type        : <0x794>
    <8a0>   DW_AT_data_member_location: 24
 <2><8a1>: Abbrev Number: 1 (DW_TAG_member)
    <8a2>   DW_AT_name        : (indirect string, offset: 0x21bc): CIFR
    <8a6>   DW_AT_decl_file   : 4
    <8a6>   DW_AT_decl_line   : 694
    <8a8>   DW_AT_decl_column : 17
    <8a8>   DW_AT_type        : <0x794>
    <8ac>   DW_AT_data_member_location: 28
 <2><8ad>: Abbrev Number: 1 (DW_TAG_member)
    <8ae>   DW_AT_name        : (indirect string, offset: 0x14c7): CICR
    <8b2>   DW_AT_decl_file   : 4
    <8b2>   DW_AT_decl_line   : 695
    <8b4>   DW_AT_decl_column : 17
    <8b4>   DW_AT_type        : <0x794>
    <8b8>   DW_AT_data_member_location: 32
 <2><8b9>: Abbrev Number: 1 (DW_TAG_member)
    <8ba>   DW_AT_name        : (indirect string, offset: 0x94934): RESERVED0
    <8be>   DW_AT_decl_file   : 4
    <8be>   DW_AT_decl_line   : 696
    <8c0>   DW_AT_decl_column : 17
    <8c0>   DW_AT_type        : <0x788>
    <8c4>   DW_AT_data_member_location: 36
 <2><8c5>: Abbrev Number: 1 (DW_TAG_member)
    <8c6>   DW_AT_name        : (indirect string, offset: 0x7df1e): AHB1RSTR
    <8ca>   DW_AT_decl_file   : 4
    <8ca>   DW_AT_decl_line   : 697
    <8cc>   DW_AT_decl_column : 17
    <8cc>   DW_AT_type        : <0x794>
    <8d0>   DW_AT_data_member_location: 40
 <2><8d1>: Abbrev Number: 1 (DW_TAG_member)
    <8d2>   DW_AT_name        : (indirect string, offset: 0x1d1de): AHB2RSTR
    <8d6>   DW_AT_decl_file   : 4
    <8d6>   DW_AT_decl_line   : 698
    <8d8>   DW_AT_decl_column : 17
    <8d8>   DW_AT_type        : <0x794>
    <8dc>   DW_AT_data_member_location: 44
 <2><8dd>: Abbrev Number: 1 (DW_TAG_member)
    <8de>   DW_AT_name        : (indirect string, offset: 0x342f4): AHB3RSTR
    <8e2>   DW_AT_decl_file   : 4
    <8e2>   DW_AT_decl_line   : 699
    <8e4>   DW_AT_decl_column : 17
    <8e4>   DW_AT_type        : <0x794>
    <8e8>   DW_AT_data_member_location: 48
 <2><8e9>: Abbrev Number: 1 (DW_TAG_member)
    <8ea>   DW_AT_name        : (indirect string, offset: 0x9493e): RESERVED1
    <8ee>   DW_AT_decl_file   : 4
    <8ee>   DW_AT_decl_line   : 700
    <8f0>   DW_AT_decl_column : 17
    <8f0>   DW_AT_type        : <0x788>
    <8f4>   DW_AT_data_member_location: 52
 <2><8f5>: Abbrev Number: 1 (DW_TAG_member)
    <8f6>   DW_AT_name        : (indirect string, offset: 0x2025f): APB1RSTR1
    <8fa>   DW_AT_decl_file   : 4
    <8fa>   DW_AT_decl_line   : 701
    <8fc>   DW_AT_decl_column : 17
    <8fc>   DW_AT_type        : <0x794>
    <900>   DW_AT_data_member_location: 56
 <2><901>: Abbrev Number: 1 (DW_TAG_member)
    <902>   DW_AT_name        : (indirect string, offset: 0x20269): APB1RSTR2
    <906>   DW_AT_decl_file   : 4
    <906>   DW_AT_decl_line   : 702
    <908>   DW_AT_decl_column : 17
    <908>   DW_AT_type        : <0x794>
    <90c>   DW_AT_data_member_location: 60
 <2><90d>: Abbrev Number: 1 (DW_TAG_member)
    <90e>   DW_AT_name        : (indirect string, offset: 0x452d5): APB2RSTR
    <912>   DW_AT_decl_file   : 4
    <912>   DW_AT_decl_line   : 703
    <914>   DW_AT_decl_column : 17
    <914>   DW_AT_type        : <0x794>
    <918>   DW_AT_data_member_location: 64
 <2><919>: Abbrev Number: 1 (DW_TAG_member)
    <91a>   DW_AT_name        : (indirect string, offset: 0x94948): RESERVED2
    <91e>   DW_AT_decl_file   : 4
    <91e>   DW_AT_decl_line   : 704
    <920>   DW_AT_decl_column : 17
    <920>   DW_AT_type        : <0x788>
    <924>   DW_AT_data_member_location: 68
 <2><925>: Abbrev Number: 1 (DW_TAG_member)
    <926>   DW_AT_name        : (indirect string, offset: 0xc557): AHB1ENR
    <92a>   DW_AT_decl_file   : 4
    <92a>   DW_AT_decl_line   : 705
    <92c>   DW_AT_decl_column : 17
    <92c>   DW_AT_type        : <0x794>
    <930>   DW_AT_data_member_location: 72
 <2><931>: Abbrev Number: 1 (DW_TAG_member)
    <932>   DW_AT_name        : (indirect string, offset: 0x2a2be): AHB2ENR
    <936>   DW_AT_decl_file   : 4
    <936>   DW_AT_decl_line   : 706
    <938>   DW_AT_decl_column : 17
    <938>   DW_AT_type        : <0x794>
    <93c>   DW_AT_data_member_location: 76
 <2><93d>: Abbrev Number: 1 (DW_TAG_member)
    <93e>   DW_AT_name        : (indirect string, offset: 0x477be): AHB3ENR
    <942>   DW_AT_decl_file   : 4
    <942>   DW_AT_decl_line   : 707
    <944>   DW_AT_decl_column : 17
    <944>   DW_AT_type        : <0x794>
    <948>   DW_AT_data_member_location: 80
 <2><949>: Abbrev Number: 1 (DW_TAG_member)
    <94a>   DW_AT_name        : (indirect string, offset: 0x94952): RESERVED3
    <94e>   DW_AT_decl_file   : 4
    <94e>   DW_AT_decl_line   : 708
    <950>   DW_AT_decl_column : 17
    <950>   DW_AT_type        : <0x788>
    <954>   DW_AT_data_member_location: 84
 <2><955>: Abbrev Number: 1 (DW_TAG_member)
    <956>   DW_AT_name        : (indirect string, offset: 0x5148): APB1ENR1
    <95a>   DW_AT_decl_file   : 4
    <95a>   DW_AT_decl_line   : 709
    <95c>   DW_AT_decl_column : 17
    <95c>   DW_AT_type        : <0x794>
    <960>   DW_AT_data_member_location: 88
 <2><961>: Abbrev Number: 1 (DW_TAG_member)
    <962>   DW_AT_name        : (indirect string, offset: 0x5151): APB1ENR2
    <966>   DW_AT_decl_file   : 4
    <966>   DW_AT_decl_line   : 710
    <968>   DW_AT_decl_column : 17
    <968>   DW_AT_type        : <0x794>
    <96c>   DW_AT_data_member_location: 92
 <2><96d>: Abbrev Number: 1 (DW_TAG_member)
    <96e>   DW_AT_name        : (indirect string, offset: 0x12839): APB2ENR
    <972>   DW_AT_decl_file   : 4
    <972>   DW_AT_decl_line   : 711
    <974>   DW_AT_decl_column : 17
    <974>   DW_AT_type        : <0x794>
    <978>   DW_AT_data_member_location: 96
 <2><979>: Abbrev Number: 1 (DW_TAG_member)
    <97a>   DW_AT_name        : (indirect string, offset: 0x58712): RESERVED4
    <97e>   DW_AT_decl_file   : 4
    <97e>   DW_AT_decl_line   : 712
    <980>   DW_AT_decl_column : 17
    <980>   DW_AT_type        : <0x788>
    <984>   DW_AT_data_member_location: 100
 <2><985>: Abbrev Number: 1 (DW_TAG_member)
    <986>   DW_AT_name        : (indirect string, offset: 0x4921d): AHB1SMENR
    <98a>   DW_AT_decl_file   : 4
    <98a>   DW_AT_decl_line   : 713
    <98c>   DW_AT_decl_column : 17
    <98c>   DW_AT_type        : <0x794>
    <990>   DW_AT_data_member_location: 104
 <2><991>: Abbrev Number: 1 (DW_TAG_member)
    <992>   DW_AT_name        : (indirect string, offset: 0x908da): AHB2SMENR
    <996>   DW_AT_decl_file   : 4
    <996>   DW_AT_decl_line   : 714
    <998>   DW_AT_decl_column : 17
    <998>   DW_AT_type        : <0x794>
    <99c>   DW_AT_data_member_location: 108
 <2><99d>: Abbrev Number: 1 (DW_TAG_member)
    <99e>   DW_AT_name        : (indirect string, offset: 0x3a543): AHB3SMENR
    <9a2>   DW_AT_decl_file   : 4
    <9a2>   DW_AT_decl_line   : 715
    <9a4>   DW_AT_decl_column : 17
    <9a4>   DW_AT_type        : <0x794>
    <9a8>   DW_AT_data_member_location: 112
 <2><9a9>: Abbrev Number: 1 (DW_TAG_member)
    <9aa>   DW_AT_name        : (indirect string, offset: 0x94980): RESERVED5
    <9ae>   DW_AT_decl_file   : 4
    <9ae>   DW_AT_decl_line   : 716
    <9b0>   DW_AT_decl_column : 17
    <9b0>   DW_AT_type        : <0x788>
    <9b4>   DW_AT_data_member_location: 116
 <2><9b5>: Abbrev Number: 1 (DW_TAG_member)
    <9b6>   DW_AT_name        : (indirect string, offset: 0x59da): APB1SMENR1
    <9ba>   DW_AT_decl_file   : 4
    <9ba>   DW_AT_decl_line   : 717
    <9bc>   DW_AT_decl_column : 17
    <9bc>   DW_AT_type        : <0x794>
    <9c0>   DW_AT_data_member_location: 120
 <2><9c1>: Abbrev Number: 1 (DW_TAG_member)
    <9c2>   DW_AT_name        : (indirect string, offset: 0x59e5): APB1SMENR2
    <9c6>   DW_AT_decl_file   : 4
    <9c6>   DW_AT_decl_line   : 718
    <9c8>   DW_AT_decl_column : 17
    <9c8>   DW_AT_type        : <0x794>
    <9cc>   DW_AT_data_member_location: 124
 <2><9cd>: Abbrev Number: 1 (DW_TAG_member)
    <9ce>   DW_AT_name        : (indirect string, offset: 0x7f70a): APB2SMENR
    <9d2>   DW_AT_decl_file   : 4
    <9d2>   DW_AT_decl_line   : 719
    <9d4>   DW_AT_decl_column : 17
    <9d4>   DW_AT_type        : <0x794>
    <9d8>   DW_AT_data_member_location: 128
 <2><9d9>: Abbrev Number: 1 (DW_TAG_member)
    <9da>   DW_AT_name        : (indirect string, offset: 0x9498a): RESERVED6
    <9de>   DW_AT_decl_file   : 4
    <9de>   DW_AT_decl_line   : 720
    <9e0>   DW_AT_decl_column : 17
    <9e0>   DW_AT_type        : <0x788>
    <9e4>   DW_AT_data_member_location: 132
 <2><9e5>: Abbrev Number: 1 (DW_TAG_member)
    <9e6>   DW_AT_name        : (indirect string, offset: 0x30a10): CCIPR
    <9ea>   DW_AT_decl_file   : 4
    <9ea>   DW_AT_decl_line   : 721
    <9ec>   DW_AT_decl_column : 17
    <9ec>   DW_AT_type        : <0x794>
    <9f0>   DW_AT_data_member_location: 136
 <2><9f1>: Abbrev Number: 1 (DW_TAG_member)
    <9f2>   DW_AT_name        : (indirect string, offset: 0x94994): RESERVED7
    <9f6>   DW_AT_decl_file   : 4
    <9f6>   DW_AT_decl_line   : 722
    <9f8>   DW_AT_decl_column : 17
    <9f8>   DW_AT_type        : <0x788>
    <9fc>   DW_AT_data_member_location: 140
 <2><9fd>: Abbrev Number: 1 (DW_TAG_member)
    <9fe>   DW_AT_name        : (indirect string, offset: 0x2950e): BDCR
    <a02>   DW_AT_decl_file   : 4
    <a02>   DW_AT_decl_line   : 723
    <a04>   DW_AT_decl_column : 17
    <a04>   DW_AT_type        : <0x794>
    <a08>   DW_AT_data_member_location: 144
 <2><a09>: Abbrev Number: 2 (DW_TAG_member)
    <a0a>   DW_AT_name        : CSR
    <a0e>   DW_AT_decl_file   : 4
    <a0e>   DW_AT_decl_line   : 724
    <a10>   DW_AT_decl_column : 17
    <a10>   DW_AT_type        : <0x794>
    <a14>   DW_AT_data_member_location: 148
 <2><a15>: Abbrev Number: 0
 <1><a16>: Abbrev Number: 6 (DW_TAG_typedef)
    <a17>   DW_AT_name        : (indirect string, offset: 0x49a7b): RCC_TypeDef
    <a1b>   DW_AT_decl_file   : 4
    <a1b>   DW_AT_decl_line   : 725
    <a1d>   DW_AT_decl_column : 3
    <a1d>   DW_AT_type        : <0x846>
 <1><a21>: Abbrev Number: 5 (DW_TAG_structure_type)
    <a22>   DW_AT_byte_size   : 44
    <a23>   DW_AT_decl_file   : 4
    <a23>   DW_AT_decl_line   : 950
    <a25>   DW_AT_decl_column : 9
    <a25>   DW_AT_sibling     : <0xaae>
 <2><a29>: Abbrev Number: 2 (DW_TAG_member)
    <a2a>   DW_AT_name        : CR1
    <a2e>   DW_AT_decl_file   : 4
    <a2e>   DW_AT_decl_line   : 952
    <a30>   DW_AT_decl_column : 17
    <a30>   DW_AT_type        : <0x794>
    <a34>   DW_AT_data_member_location: 0
 <2><a35>: Abbrev Number: 2 (DW_TAG_member)
    <a36>   DW_AT_name        : CR2
    <a3a>   DW_AT_decl_file   : 4
    <a3a>   DW_AT_decl_line   : 953
    <a3c>   DW_AT_decl_column : 17
    <a3c>   DW_AT_type        : <0x794>
    <a40>   DW_AT_data_member_location: 4
 <2><a41>: Abbrev Number: 2 (DW_TAG_member)
    <a42>   DW_AT_name        : CR3
    <a46>   DW_AT_decl_file   : 4
    <a46>   DW_AT_decl_line   : 954
    <a48>   DW_AT_decl_column : 17
    <a48>   DW_AT_type        : <0x794>
    <a4c>   DW_AT_data_member_location: 8
 <2><a4d>: Abbrev Number: 2 (DW_TAG_member)
    <a4e>   DW_AT_name        : BRR
    <a52>   DW_AT_decl_file   : 4
    <a52>   DW_AT_decl_line   : 955
    <a54>   DW_AT_decl_column : 17
    <a54>   DW_AT_type        : <0x794>
    <a58>   DW_AT_data_member_location: 12
 <2><a59>: Abbrev Number: 1 (DW_TAG_member)
    <a5a>   DW_AT_name        : (indirect string, offset: 0xa1eb9): GTPR
    <a5e>   DW_AT_decl_file   : 4
    <a5e>   DW_AT_decl_line   : 956
    <a60>   DW_AT_decl_column : 17
    <a60>   DW_AT_type        : <0x794>
    <a64>   DW_AT_data_member_location: 16
 <2><a65>: Abbrev Number: 1 (DW_TAG_member)
    <a66>   DW_AT_name        : (indirect string, offset: 0xa1ecb): RTOR
    <a6a>   DW_AT_decl_file   : 4
    <a6a>   DW_AT_decl_line   : 957
    <a6c>   DW_AT_decl_column : 17
    <a6c>   DW_AT_type        : <0x794>
    <a70>   DW_AT_data_member_location: 20
 <2><a71>: Abbrev Number: 2 (DW_TAG_member)
    <a72>   DW_AT_name        : RQR
    <a76>   DW_AT_decl_file   : 4
    <a76>   DW_AT_decl_line   : 958
    <a78>   DW_AT_decl_column : 17
    <a78>   DW_AT_type        : <0x794>
    <a7c>   DW_AT_data_member_location: 24
 <2><a7d>: Abbrev Number: 2 (DW_TAG_member)
    <a7e>   DW_AT_name        : ISR
    <a82>   DW_AT_decl_file   : 4
    <a82>   DW_AT_decl_line   : 959
    <a84>   DW_AT_decl_column : 17
    <a84>   DW_AT_type        : <0x794>
    <a88>   DW_AT_data_member_location: 28
 <2><a89>: Abbrev Number: 2 (DW_TAG_member)
    <a8a>   DW_AT_name        : ICR
    <a8e>   DW_AT_decl_file   : 4
    <a8e>   DW_AT_decl_line   : 960
    <a90>   DW_AT_decl_column : 17
    <a90>   DW_AT_type        : <0x794>
    <a94>   DW_AT_data_member_location: 32
 <2><a95>: Abbrev Number: 2 (DW_TAG_member)
    <a96>   DW_AT_name        : RDR
    <a9a>   DW_AT_decl_file   : 4
    <a9a>   DW_AT_decl_line   : 961
    <a9c>   DW_AT_decl_column : 17
    <a9c>   DW_AT_type        : <0x794>
    <aa0>   DW_AT_data_member_location: 36
 <2><aa1>: Abbrev Number: 2 (DW_TAG_member)
    <aa2>   DW_AT_name        : TDR
    <aa6>   DW_AT_decl_file   : 4
    <aa6>   DW_AT_decl_line   : 962
    <aa8>   DW_AT_decl_column : 17
    <aa8>   DW_AT_type        : <0x794>
    <aac>   DW_AT_data_member_location: 40
 <2><aad>: Abbrev Number: 0
 <1><aae>: Abbrev Number: 6 (DW_TAG_typedef)
    <aaf>   DW_AT_name        : (indirect string, offset: 0xa1ed0): USART_TypeDef
    <ab3>   DW_AT_decl_file   : 4
    <ab3>   DW_AT_decl_line   : 963
    <ab5>   DW_AT_decl_column : 3
    <ab5>   DW_AT_type        : <0xa21>
 <1><ab9>: Abbrev Number: 9 (DW_TAG_subprogram)
    <aba>   DW_AT_external    : 1
    <aba>   DW_AT_name        : (indirect string, offset: 0xa1e8a): USART2_StringPrint
    <abe>   DW_AT_decl_file   : 1
    <abe>   DW_AT_decl_line   : 57
    <abf>   DW_AT_decl_column : 6
    <abf>   DW_AT_prototyped  : 1
    <abf>   DW_AT_low_pc      : 0x8000aa4
    <ac3>   DW_AT_high_pc     : 0x40
    <ac7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ac9>   DW_AT_call_all_calls: 1
    <ac9>   DW_AT_sibling     : <0xada>
 <2><acd>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ace>   DW_AT_name        : s
    <ad0>   DW_AT_decl_file   : 1
    <ad0>   DW_AT_decl_line   : 57
    <ad1>   DW_AT_decl_column : 37
    <ad2>   DW_AT_type        : <0x777>
    <ad6>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><ad9>: Abbrev Number: 0
 <1><ada>: Abbrev Number: 9 (DW_TAG_subprogram)
    <adb>   DW_AT_external    : 1
    <adb>   DW_AT_name        : (indirect string, offset: 0xa1ebe): USART2_Print
    <adf>   DW_AT_decl_file   : 1
    <adf>   DW_AT_decl_line   : 49
    <ae0>   DW_AT_decl_column : 6
    <ae0>   DW_AT_prototyped  : 1
    <ae0>   DW_AT_low_pc      : 0x8000a74
    <ae4>   DW_AT_high_pc     : 0x30
    <ae8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <aea>   DW_AT_call_all_calls: 1
    <aea>   DW_AT_sibling     : <0xafd>
 <2><aee>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <aef>   DW_AT_name        : val
    <af3>   DW_AT_decl_file   : 1
    <af3>   DW_AT_decl_line   : 49
    <af4>   DW_AT_decl_column : 28
    <af5>   DW_AT_type        : <0xafd>
    <af9>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><afc>: Abbrev Number: 0
 <1><afd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <afe>   DW_AT_byte_size   : 4
    <afe>   DW_AT_type        : <0x77c>
 <1><b02>: Abbrev Number: 16 (DW_TAG_subprogram)
    <b03>   DW_AT_external    : 1
    <b03>   DW_AT_name        : (indirect string, offset: 0xa1e7c): USART2_Config
    <b07>   DW_AT_decl_file   : 1
    <b08>   DW_AT_decl_line   : 8
    <b09>   DW_AT_decl_column : 6
    <b0a>   DW_AT_prototyped  : 1
    <b0a>   DW_AT_low_pc      : 0x8000994
    <b0e>   DW_AT_high_pc     : 0xe0
    <b12>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b14>   DW_AT_call_all_calls: 1
 <1><b14>: Abbrev Number: 0
  Compilation Unit @ offset 0xb15:
   Length:        0x126 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x370
   Pointer Size:  4
 <0><b21>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <b22>   DW_AT_producer    : (indirect string, offset: 0x299ef): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <b26>   DW_AT_language    : 29	(C11)
    <b27>   DW_AT_name        : (indirect string, offset: 0xbc7cb): ../Core/Src/freertos_hooks.c
    <b2b>   DW_AT_comp_dir    : (indirect string, offset: 0x57523): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <b2f>   DW_AT_ranges      : 0x6f
    <b33>   DW_AT_low_pc      : 0
    <b37>   DW_AT_stmt_list   : 0x1612
    <b3b>   DW_AT_macros      : 0x1d38d
 <1><b3f>: Abbrev Number: 7 (DW_TAG_base_type)
    <b40>   DW_AT_byte_size   : 4
    <b41>   DW_AT_encoding    : 5	(signed)
    <b42>   DW_AT_name        : int
 <1><b46>: Abbrev Number: 1 (DW_TAG_base_type)
    <b47>   DW_AT_byte_size   : 4
    <b48>   DW_AT_encoding    : 7	(unsigned)
    <b49>   DW_AT_name        : (indirect string, offset: 0xc591): unsigned int
 <1><b4d>: Abbrev Number: 1 (DW_TAG_base_type)
    <b4e>   DW_AT_byte_size   : 8
    <b4f>   DW_AT_encoding    : 5	(signed)
    <b50>   DW_AT_name        : (indirect string, offset: 0x48957): long long int
 <1><b54>: Abbrev Number: 1 (DW_TAG_base_type)
    <b55>   DW_AT_byte_size   : 8
    <b56>   DW_AT_encoding    : 4	(float)
    <b57>   DW_AT_name        : (indirect string, offset: 0x9e78c): long double
 <1><b5b>: Abbrev Number: 1 (DW_TAG_base_type)
    <b5c>   DW_AT_byte_size   : 1
    <b5d>   DW_AT_encoding    : 6	(signed char)
    <b5e>   DW_AT_name        : (indirect string, offset: 0x4fce6): signed char
 <1><b62>: Abbrev Number: 2 (DW_TAG_typedef)
    <b63>   DW_AT_name        : (indirect string, offset: 0x2e54f): __uint8_t
    <b67>   DW_AT_decl_file   : 2
    <b68>   DW_AT_decl_line   : 43
    <b69>   DW_AT_decl_column : 24
    <b6a>   DW_AT_type        : <0xb6e>
 <1><b6e>: Abbrev Number: 1 (DW_TAG_base_type)
    <b6f>   DW_AT_byte_size   : 1
    <b70>   DW_AT_encoding    : 8	(unsigned char)
    <b71>   DW_AT_name        : (indirect string, offset: 0x9827d): unsigned char
 <1><b75>: Abbrev Number: 1 (DW_TAG_base_type)
    <b76>   DW_AT_byte_size   : 2
    <b77>   DW_AT_encoding    : 5	(signed)
    <b78>   DW_AT_name        : (indirect string, offset: 0x7583d): short int
 <1><b7c>: Abbrev Number: 1 (DW_TAG_base_type)
    <b7d>   DW_AT_byte_size   : 2
    <b7e>   DW_AT_encoding    : 7	(unsigned)
    <b7f>   DW_AT_name        : (indirect string, offset: 0x970ba): short unsigned int
 <1><b83>: Abbrev Number: 1 (DW_TAG_base_type)
    <b84>   DW_AT_byte_size   : 4
    <b85>   DW_AT_encoding    : 5	(signed)
    <b86>   DW_AT_name        : (indirect string, offset: 0xcd5a): long int
 <1><b8a>: Abbrev Number: 1 (DW_TAG_base_type)
    <b8b>   DW_AT_byte_size   : 4
    <b8c>   DW_AT_encoding    : 7	(unsigned)
    <b8d>   DW_AT_name        : (indirect string, offset: 0x3ccb2): long unsigned int
 <1><b91>: Abbrev Number: 1 (DW_TAG_base_type)
    <b92>   DW_AT_byte_size   : 8
    <b93>   DW_AT_encoding    : 7	(unsigned)
    <b94>   DW_AT_name        : (indirect string, offset: 0x20f43): long long unsigned int
 <1><b98>: Abbrev Number: 2 (DW_TAG_typedef)
    <b99>   DW_AT_name        : (indirect string, offset: 0x2e551): uint8_t
    <b9d>   DW_AT_decl_file   : 3
    <b9e>   DW_AT_decl_line   : 24
    <b9f>   DW_AT_decl_column : 19
    <ba0>   DW_AT_type        : <0xb62>
 <1><ba4>: Abbrev Number: 3 (DW_TAG_const_type)
    <ba5>   DW_AT_type        : <0xb98>
 <1><ba9>: Abbrev Number: 2 (DW_TAG_typedef)
    <baa>   DW_AT_name        : (indirect string, offset: 0xe2435): TaskHandle_t
    <bae>   DW_AT_decl_file   : 4
    <baf>   DW_AT_decl_line   : 95
    <bb0>   DW_AT_decl_column : 46
    <bb1>   DW_AT_type        : <0xbb5>
 <1><bb5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb6>   DW_AT_byte_size   : 4
    <bb6>   DW_AT_type        : <0xbba>
 <1><bba>: Abbrev Number: 8 (DW_TAG_structure_type)
    <bbb>   DW_AT_name        : (indirect string, offset: 0xe087a): tskTaskControlBlock
    <bbf>   DW_AT_declaration : 1
 <1><bbf>: Abbrev Number: 1 (DW_TAG_base_type)
    <bc0>   DW_AT_byte_size   : 1
    <bc1>   DW_AT_encoding    : 8	(unsigned char)
    <bc2>   DW_AT_name        : (indirect string, offset: 0xb96a0): char
 <1><bc6>: Abbrev Number: 9 (DW_TAG_array_type)
    <bc7>   DW_AT_type        : <0xba4>
    <bcb>   DW_AT_sibling     : <0xbd6>
 <2><bcf>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <bd0>   DW_AT_type        : <0xb46>
    <bd4>   DW_AT_upper_bound : 6
 <2><bd5>: Abbrev Number: 0
 <1><bd6>: Abbrev Number: 3 (DW_TAG_const_type)
    <bd7>   DW_AT_type        : <0xbc6>
 <1><bdb>: Abbrev Number: 11 (DW_TAG_variable)
    <bdc>   DW_AT_name        : (indirect string, offset: 0xb07f6): CHANNEL_OFFSET_TAB
    <be0>   DW_AT_decl_file   : 5
    <be1>   DW_AT_decl_line   : 49
    <be2>   DW_AT_decl_column : 22
    <be3>   DW_AT_type        : <0xbd6>
    <be7>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><bed>: Abbrev Number: 12 (DW_TAG_subprogram)
    <bee>   DW_AT_external    : 1
    <bee>   DW_AT_name        : (indirect string, offset: 0xba68c): HAL_IncTick
    <bf2>   DW_AT_decl_file   : 6
    <bf3>   DW_AT_decl_line   : 651
    <bf5>   DW_AT_decl_column : 20
    <bf6>   DW_AT_prototyped  : 1
    <bf6>   DW_AT_declaration : 1
 <1><bf6>: Abbrev Number: 13 (DW_TAG_subprogram)
    <bf7>   DW_AT_external    : 1
    <bf7>   DW_AT_name        : (indirect string, offset: 0xc1876): vApplicationTickHook
    <bfb>   DW_AT_decl_file   : 1
    <bfc>   DW_AT_decl_line   : 11
    <bfd>   DW_AT_decl_column : 6
    <bfe>   DW_AT_prototyped  : 1
    <bfe>   DW_AT_low_pc      : 0x8000af2
    <c02>   DW_AT_high_pc     : 0xc
    <c06>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c08>   DW_AT_call_all_tail_calls: 1
 <1><c08>: Abbrev Number: 14 (DW_TAG_subprogram)
    <c09>   DW_AT_external    : 1
    <c09>   DW_AT_name        : (indirect string, offset: 0xbc2bc): vApplicationStackOverflowHook
    <c0d>   DW_AT_decl_file   : 1
    <c0e>   DW_AT_decl_line   : 5
    <c0f>   DW_AT_decl_column : 6
    <c10>   DW_AT_prototyped  : 1
    <c10>   DW_AT_low_pc      : 0x8000ae4
    <c14>   DW_AT_high_pc     : 0xe
    <c18>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c1a>   DW_AT_call_all_calls: 1
    <c1a>   DW_AT_sibling     : <0xc39>
 <2><c1e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c1f>   DW_AT_name        : (indirect string, offset: 0xd6f92): xTask
    <c23>   DW_AT_decl_file   : 1
    <c23>   DW_AT_decl_line   : 5
    <c23>   DW_AT_decl_column : 49
    <c24>   DW_AT_type        : <0xba9>
    <c28>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><c2b>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c2c>   DW_AT_name        : (indirect string, offset: 0xbace9): pcTaskName
    <c30>   DW_AT_decl_file   : 1
    <c30>   DW_AT_decl_line   : 5
    <c30>   DW_AT_decl_column : 62
    <c31>   DW_AT_type        : <0xc39>
    <c35>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><c38>: Abbrev Number: 0
 <1><c39>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c3a>   DW_AT_byte_size   : 4
    <c3a>   DW_AT_type        : <0xbbf>
 <1><c3e>: Abbrev Number: 0
  Compilation Unit @ offset 0xc3f:
   Length:        0x859 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x442
   Pointer Size:  4
 <0><c4b>: Abbrev Number: 24 (DW_TAG_compile_unit)
    <c4c>   DW_AT_producer    : (indirect string, offset: 0x299ef): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <c50>   DW_AT_language    : 29	(C11)
    <c51>   DW_AT_name        : (indirect string, offset: 0xec656): ../Core/Src/main.c
    <c55>   DW_AT_comp_dir    : (indirect string, offset: 0x57523): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <c59>   DW_AT_ranges      : 0x88
    <c5d>   DW_AT_low_pc      : 0
    <c61>   DW_AT_stmt_list   : 0x1dd3
    <c65>   DW_AT_macros      : 0x25ec9
 <1><c69>: Abbrev Number: 5 (DW_TAG_base_type)
    <c6a>   DW_AT_byte_size   : 1
    <c6b>   DW_AT_encoding    : 6	(signed char)
    <c6c>   DW_AT_name        : (indirect string, offset: 0x4fce6): signed char
 <1><c70>: Abbrev Number: 3 (DW_TAG_typedef)
    <c71>   DW_AT_name        : (indirect string, offset: 0x2e54f): __uint8_t
    <c75>   DW_AT_decl_file   : 3
    <c76>   DW_AT_decl_line   : 43
    <c77>   DW_AT_decl_column : 24
    <c78>   DW_AT_type        : <0xc7c>
 <1><c7c>: Abbrev Number: 5 (DW_TAG_base_type)
    <c7d>   DW_AT_byte_size   : 1
    <c7e>   DW_AT_encoding    : 8	(unsigned char)
    <c7f>   DW_AT_name        : (indirect string, offset: 0x9827d): unsigned char
 <1><c83>: Abbrev Number: 3 (DW_TAG_typedef)
    <c84>   DW_AT_name        : (indirect string, offset: 0x9ed39): __int16_t
    <c88>   DW_AT_decl_file   : 3
    <c89>   DW_AT_decl_line   : 55
    <c8a>   DW_AT_decl_column : 24
    <c8b>   DW_AT_type        : <0xc8f>
 <1><c8f>: Abbrev Number: 5 (DW_TAG_base_type)
    <c90>   DW_AT_byte_size   : 2
    <c91>   DW_AT_encoding    : 5	(signed)
    <c92>   DW_AT_name        : (indirect string, offset: 0x7583d): short int
 <1><c96>: Abbrev Number: 5 (DW_TAG_base_type)
    <c97>   DW_AT_byte_size   : 2
    <c98>   DW_AT_encoding    : 7	(unsigned)
    <c99>   DW_AT_name        : (indirect string, offset: 0x970ba): short unsigned int
 <1><c9d>: Abbrev Number: 5 (DW_TAG_base_type)
    <c9e>   DW_AT_byte_size   : 4
    <c9f>   DW_AT_encoding    : 5	(signed)
    <ca0>   DW_AT_name        : (indirect string, offset: 0xcd5a): long int
 <1><ca4>: Abbrev Number: 3 (DW_TAG_typedef)
    <ca5>   DW_AT_name        : (indirect string, offset: 0x652d9): __uint32_t
    <ca9>   DW_AT_decl_file   : 3
    <caa>   DW_AT_decl_line   : 79
    <cab>   DW_AT_decl_column : 25
    <cac>   DW_AT_type        : <0xcb0>
 <1><cb0>: Abbrev Number: 5 (DW_TAG_base_type)
    <cb1>   DW_AT_byte_size   : 4
    <cb2>   DW_AT_encoding    : 7	(unsigned)
    <cb3>   DW_AT_name        : (indirect string, offset: 0x3ccb2): long unsigned int
 <1><cb7>: Abbrev Number: 5 (DW_TAG_base_type)
    <cb8>   DW_AT_byte_size   : 8
    <cb9>   DW_AT_encoding    : 5	(signed)
    <cba>   DW_AT_name        : (indirect string, offset: 0x48957): long long int
 <1><cbe>: Abbrev Number: 3 (DW_TAG_typedef)
    <cbf>   DW_AT_name        : (indirect string, offset: 0xec504): __uint64_t
    <cc3>   DW_AT_decl_file   : 3
    <cc4>   DW_AT_decl_line   : 105
    <cc5>   DW_AT_decl_column : 25
    <cc6>   DW_AT_type        : <0xcca>
 <1><cca>: Abbrev Number: 5 (DW_TAG_base_type)
    <ccb>   DW_AT_byte_size   : 8
    <ccc>   DW_AT_encoding    : 7	(unsigned)
    <ccd>   DW_AT_name        : (indirect string, offset: 0x20f43): long long unsigned int
 <1><cd1>: Abbrev Number: 25 (DW_TAG_base_type)
    <cd2>   DW_AT_byte_size   : 4
    <cd3>   DW_AT_encoding    : 5	(signed)
    <cd4>   DW_AT_name        : int
 <1><cd8>: Abbrev Number: 5 (DW_TAG_base_type)
    <cd9>   DW_AT_byte_size   : 4
    <cda>   DW_AT_encoding    : 7	(unsigned)
    <cdb>   DW_AT_name        : (indirect string, offset: 0xc591): unsigned int
 <1><cdf>: Abbrev Number: 5 (DW_TAG_base_type)
    <ce0>   DW_AT_byte_size   : 8
    <ce1>   DW_AT_encoding    : 4	(float)
    <ce2>   DW_AT_name        : (indirect string, offset: 0x9e78c): long double
 <1><ce6>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <ce7>   DW_AT_byte_size   : 4
 <1><ce8>: Abbrev Number: 6 (DW_TAG_const_type)
    <ce9>   DW_AT_type        : <0xce6>
 <1><ced>: Abbrev Number: 5 (DW_TAG_base_type)
    <cee>   DW_AT_byte_size   : 1
    <cef>   DW_AT_encoding    : 8	(unsigned char)
    <cf0>   DW_AT_name        : (indirect string, offset: 0xb96a0): char
 <1><cf4>: Abbrev Number: 6 (DW_TAG_const_type)
    <cf5>   DW_AT_type        : <0xced>
 <1><cf9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <cfa>   DW_AT_byte_size   : 4
    <cfa>   DW_AT_type        : <0xcf4>
 <1><cfe>: Abbrev Number: 6 (DW_TAG_const_type)
    <cff>   DW_AT_type        : <0xcf9>
 <1><d03>: Abbrev Number: 3 (DW_TAG_typedef)
    <d04>   DW_AT_name        : (indirect string, offset: 0x2e551): uint8_t
    <d08>   DW_AT_decl_file   : 4
    <d09>   DW_AT_decl_line   : 24
    <d0a>   DW_AT_decl_column : 19
    <d0b>   DW_AT_type        : <0xc70>
 <1><d0f>: Abbrev Number: 6 (DW_TAG_const_type)
    <d10>   DW_AT_type        : <0xd03>
 <1><d14>: Abbrev Number: 3 (DW_TAG_typedef)
    <d15>   DW_AT_name        : (indirect string, offset: 0x9ed3b): int16_t
    <d19>   DW_AT_decl_file   : 4
    <d1a>   DW_AT_decl_line   : 32
    <d1b>   DW_AT_decl_column : 19
    <d1c>   DW_AT_type        : <0xc83>
 <1><d20>: Abbrev Number: 3 (DW_TAG_typedef)
    <d21>   DW_AT_name        : (indirect string, offset: 0xd74e7): uint32_t
    <d25>   DW_AT_decl_file   : 4
    <d26>   DW_AT_decl_line   : 48
    <d27>   DW_AT_decl_column : 20
    <d28>   DW_AT_type        : <0xca4>
 <1><d2c>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <d2d>   DW_AT_type        : <0xd20>
 <1><d31>: Abbrev Number: 3 (DW_TAG_typedef)
    <d32>   DW_AT_name        : (indirect string, offset: 0xec506): uint64_t
    <d36>   DW_AT_decl_file   : 4
    <d37>   DW_AT_decl_line   : 60
    <d38>   DW_AT_decl_column : 20
    <d39>   DW_AT_type        : <0xcbe>
 <1><d3d>: Abbrev Number: 18 (DW_TAG_structure_type)
    <d3e>   DW_AT_byte_size   : 48
    <d3f>   DW_AT_decl_file   : 5
    <d3f>   DW_AT_decl_line   : 531
    <d41>   DW_AT_decl_column : 9
    <d41>   DW_AT_sibling     : <0xdca>
 <2><d45>: Abbrev Number: 1 (DW_TAG_member)
    <d46>   DW_AT_name        : (indirect string, offset: 0x10f4): MODER
    <d4a>   DW_AT_decl_file   : 5
    <d4a>   DW_AT_decl_line   : 533
    <d4c>   DW_AT_decl_column : 17
    <d4c>   DW_AT_type        : <0xd2c>
    <d50>   DW_AT_data_member_location: 0
 <2><d51>: Abbrev Number: 1 (DW_TAG_member)
    <d52>   DW_AT_name        : (indirect string, offset: 0x7a54b): OTYPER
    <d56>   DW_AT_decl_file   : 5
    <d56>   DW_AT_decl_line   : 534
    <d58>   DW_AT_decl_column : 17
    <d58>   DW_AT_type        : <0xd2c>
    <d5c>   DW_AT_data_member_location: 4
 <2><d5d>: Abbrev Number: 1 (DW_TAG_member)
    <d5e>   DW_AT_name        : (indirect string, offset: 0x89434): OSPEEDR
    <d62>   DW_AT_decl_file   : 5
    <d62>   DW_AT_decl_line   : 535
    <d64>   DW_AT_decl_column : 17
    <d64>   DW_AT_type        : <0xd2c>
    <d68>   DW_AT_data_member_location: 8
 <2><d69>: Abbrev Number: 1 (DW_TAG_member)
    <d6a>   DW_AT_name        : (indirect string, offset: 0x66ac3): PUPDR
    <d6e>   DW_AT_decl_file   : 5
    <d6e>   DW_AT_decl_line   : 536
    <d70>   DW_AT_decl_column : 17
    <d70>   DW_AT_type        : <0xd2c>
    <d74>   DW_AT_data_member_location: 12
 <2><d75>: Abbrev Number: 10 (DW_TAG_member)
    <d76>   DW_AT_name        : IDR
    <d7a>   DW_AT_decl_file   : 5
    <d7a>   DW_AT_decl_line   : 537
    <d7c>   DW_AT_decl_column : 17
    <d7c>   DW_AT_type        : <0xd2c>
    <d80>   DW_AT_data_member_location: 16
 <2><d81>: Abbrev Number: 10 (DW_TAG_member)
    <d82>   DW_AT_name        : ODR
    <d86>   DW_AT_decl_file   : 5
    <d86>   DW_AT_decl_line   : 538
    <d88>   DW_AT_decl_column : 17
    <d88>   DW_AT_type        : <0xd2c>
    <d8c>   DW_AT_data_member_location: 20
 <2><d8d>: Abbrev Number: 1 (DW_TAG_member)
    <d8e>   DW_AT_name        : (indirect string, offset: 0x239c6): BSRR
    <d92>   DW_AT_decl_file   : 5
    <d92>   DW_AT_decl_line   : 539
    <d94>   DW_AT_decl_column : 17
    <d94>   DW_AT_type        : <0xd2c>
    <d98>   DW_AT_data_member_location: 24
 <2><d99>: Abbrev Number: 1 (DW_TAG_member)
    <d9a>   DW_AT_name        : (indirect string, offset: 0x877c4): LCKR
    <d9e>   DW_AT_decl_file   : 5
    <d9e>   DW_AT_decl_line   : 540
    <da0>   DW_AT_decl_column : 17
    <da0>   DW_AT_type        : <0xd2c>
    <da4>   DW_AT_data_member_location: 28
 <2><da5>: Abbrev Number: 10 (DW_TAG_member)
    <da6>   DW_AT_name        : AFR
    <daa>   DW_AT_decl_file   : 5
    <daa>   DW_AT_decl_line   : 541
    <dac>   DW_AT_decl_column : 17
    <dac>   DW_AT_type        : <0xdda>
    <db0>   DW_AT_data_member_location: 32
 <2><db1>: Abbrev Number: 10 (DW_TAG_member)
    <db2>   DW_AT_name        : BRR
    <db6>   DW_AT_decl_file   : 5
    <db6>   DW_AT_decl_line   : 542
    <db8>   DW_AT_decl_column : 17
    <db8>   DW_AT_type        : <0xd2c>
    <dbc>   DW_AT_data_member_location: 40
 <2><dbd>: Abbrev Number: 1 (DW_TAG_member)
    <dbe>   DW_AT_name        : (indirect string, offset: 0x1b92): ASCR
    <dc2>   DW_AT_decl_file   : 5
    <dc2>   DW_AT_decl_line   : 543
    <dc4>   DW_AT_decl_column : 17
    <dc4>   DW_AT_type        : <0xd2c>
    <dc8>   DW_AT_data_member_location: 44
 <2><dc9>: Abbrev Number: 0
 <1><dca>: Abbrev Number: 19 (DW_TAG_array_type)
    <dcb>   DW_AT_type        : <0xd2c>
    <dcf>   DW_AT_sibling     : <0xdda>
 <2><dd3>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <dd4>   DW_AT_type        : <0xcd8>
    <dd8>   DW_AT_upper_bound : 1
 <2><dd9>: Abbrev Number: 0
 <1><dda>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <ddb>   DW_AT_type        : <0xdca>
 <1><ddf>: Abbrev Number: 21 (DW_TAG_typedef)
    <de0>   DW_AT_name        : (indirect string, offset: 0x991cb): GPIO_TypeDef
    <de4>   DW_AT_decl_file   : 5
    <de4>   DW_AT_decl_line   : 545
    <de6>   DW_AT_decl_column : 3
    <de6>   DW_AT_type        : <0xd3d>
 <1><dea>: Abbrev Number: 18 (DW_TAG_structure_type)
    <deb>   DW_AT_byte_size   : 152
    <dec>   DW_AT_decl_file   : 5
    <dec>   DW_AT_decl_line   : 685
    <dee>   DW_AT_decl_column : 9
    <dee>   DW_AT_sibling     : <0xfba>
 <2><df2>: Abbrev Number: 10 (DW_TAG_member)
    <df3>   DW_AT_name        : CR
    <df6>   DW_AT_decl_file   : 5
    <df6>   DW_AT_decl_line   : 687
    <df8>   DW_AT_decl_column : 17
    <df8>   DW_AT_type        : <0xd2c>
    <dfc>   DW_AT_data_member_location: 0
 <2><dfd>: Abbrev Number: 1 (DW_TAG_member)
    <dfe>   DW_AT_name        : (indirect string, offset: 0x6af01): ICSCR
    <e02>   DW_AT_decl_file   : 5
    <e02>   DW_AT_decl_line   : 688
    <e04>   DW_AT_decl_column : 17
    <e04>   DW_AT_type        : <0xd2c>
    <e08>   DW_AT_data_member_location: 4
 <2><e09>: Abbrev Number: 1 (DW_TAG_member)
    <e0a>   DW_AT_name        : (indirect string, offset: 0x34674): CFGR
    <e0e>   DW_AT_decl_file   : 5
    <e0e>   DW_AT_decl_line   : 689
    <e10>   DW_AT_decl_column : 17
    <e10>   DW_AT_type        : <0xd2c>
    <e14>   DW_AT_data_member_location: 8
 <2><e15>: Abbrev Number: 1 (DW_TAG_member)
    <e16>   DW_AT_name        : (indirect string, offset: 0x6f093): PLLCFGR
    <e1a>   DW_AT_decl_file   : 5
    <e1a>   DW_AT_decl_line   : 690
    <e1c>   DW_AT_decl_column : 17
    <e1c>   DW_AT_type        : <0xd2c>
    <e20>   DW_AT_data_member_location: 12
 <2><e21>: Abbrev Number: 1 (DW_TAG_member)
    <e22>   DW_AT_name        : (indirect string, offset: 0x3466d): PLLSAI1CFGR
    <e26>   DW_AT_decl_file   : 5
    <e26>   DW_AT_decl_line   : 691
    <e28>   DW_AT_decl_column : 17
    <e28>   DW_AT_type        : <0xd2c>
    <e2c>   DW_AT_data_member_location: 16
 <2><e2d>: Abbrev Number: 1 (DW_TAG_member)
    <e2e>   DW_AT_name        : (indirect string, offset: 0x6750c): PLLSAI2CFGR
    <e32>   DW_AT_decl_file   : 5
    <e32>   DW_AT_decl_line   : 692
    <e34>   DW_AT_decl_column : 17
    <e34>   DW_AT_type        : <0xd2c>
    <e38>   DW_AT_data_member_location: 20
 <2><e39>: Abbrev Number: 1 (DW_TAG_member)
    <e3a>   DW_AT_name        : (indirect string, offset: 0x1e2c): CIER
    <e3e>   DW_AT_decl_file   : 5
    <e3e>   DW_AT_decl_line   : 693
    <e40>   DW_AT_decl_column : 17
    <e40>   DW_AT_type        : <0xd2c>
    <e44>   DW_AT_data_member_location: 24
 <2><e45>: Abbrev Number: 1 (DW_TAG_member)
    <e46>   DW_AT_name        : (indirect string, offset: 0x21bc): CIFR
    <e4a>   DW_AT_decl_file   : 5
    <e4a>   DW_AT_decl_line   : 694
    <e4c>   DW_AT_decl_column : 17
    <e4c>   DW_AT_type        : <0xd2c>
    <e50>   DW_AT_data_member_location: 28
 <2><e51>: Abbrev Number: 1 (DW_TAG_member)
    <e52>   DW_AT_name        : (indirect string, offset: 0x14c7): CICR
    <e56>   DW_AT_decl_file   : 5
    <e56>   DW_AT_decl_line   : 695
    <e58>   DW_AT_decl_column : 17
    <e58>   DW_AT_type        : <0xd2c>
    <e5c>   DW_AT_data_member_location: 32
 <2><e5d>: Abbrev Number: 1 (DW_TAG_member)
    <e5e>   DW_AT_name        : (indirect string, offset: 0x94934): RESERVED0
    <e62>   DW_AT_decl_file   : 5
    <e62>   DW_AT_decl_line   : 696
    <e64>   DW_AT_decl_column : 17
    <e64>   DW_AT_type        : <0xd20>
    <e68>   DW_AT_data_member_location: 36
 <2><e69>: Abbrev Number: 1 (DW_TAG_member)
    <e6a>   DW_AT_name        : (indirect string, offset: 0x7df1e): AHB1RSTR
    <e6e>   DW_AT_decl_file   : 5
    <e6e>   DW_AT_decl_line   : 697
    <e70>   DW_AT_decl_column : 17
    <e70>   DW_AT_type        : <0xd2c>
    <e74>   DW_AT_data_member_location: 40
 <2><e75>: Abbrev Number: 1 (DW_TAG_member)
    <e76>   DW_AT_name        : (indirect string, offset: 0x1d1de): AHB2RSTR
    <e7a>   DW_AT_decl_file   : 5
    <e7a>   DW_AT_decl_line   : 698
    <e7c>   DW_AT_decl_column : 17
    <e7c>   DW_AT_type        : <0xd2c>
    <e80>   DW_AT_data_member_location: 44
 <2><e81>: Abbrev Number: 1 (DW_TAG_member)
    <e82>   DW_AT_name        : (indirect string, offset: 0x342f4): AHB3RSTR
    <e86>   DW_AT_decl_file   : 5
    <e86>   DW_AT_decl_line   : 699
    <e88>   DW_AT_decl_column : 17
    <e88>   DW_AT_type        : <0xd2c>
    <e8c>   DW_AT_data_member_location: 48
 <2><e8d>: Abbrev Number: 1 (DW_TAG_member)
    <e8e>   DW_AT_name        : (indirect string, offset: 0x9493e): RESERVED1
    <e92>   DW_AT_decl_file   : 5
    <e92>   DW_AT_decl_line   : 700
    <e94>   DW_AT_decl_column : 17
    <e94>   DW_AT_type        : <0xd20>
    <e98>   DW_AT_data_member_location: 52
 <2><e99>: Abbrev Number: 1 (DW_TAG_member)
    <e9a>   DW_AT_name        : (indirect string, offset: 0x2025f): APB1RSTR1
    <e9e>   DW_AT_decl_file   : 5
    <e9e>   DW_AT_decl_line   : 701
    <ea0>   DW_AT_decl_column : 17
    <ea0>   DW_AT_type        : <0xd2c>
    <ea4>   DW_AT_data_member_location: 56
 <2><ea5>: Abbrev Number: 1 (DW_TAG_member)
    <ea6>   DW_AT_name        : (indirect string, offset: 0x20269): APB1RSTR2
    <eaa>   DW_AT_decl_file   : 5
    <eaa>   DW_AT_decl_line   : 702
    <eac>   DW_AT_decl_column : 17
    <eac>   DW_AT_type        : <0xd2c>
    <eb0>   DW_AT_data_member_location: 60
 <2><eb1>: Abbrev Number: 1 (DW_TAG_member)
    <eb2>   DW_AT_name        : (indirect string, offset: 0x452d5): APB2RSTR
    <eb6>   DW_AT_decl_file   : 5
    <eb6>   DW_AT_decl_line   : 703
    <eb8>   DW_AT_decl_column : 17
    <eb8>   DW_AT_type        : <0xd2c>
    <ebc>   DW_AT_data_member_location: 64
 <2><ebd>: Abbrev Number: 1 (DW_TAG_member)
    <ebe>   DW_AT_name        : (indirect string, offset: 0x94948): RESERVED2
    <ec2>   DW_AT_decl_file   : 5
    <ec2>   DW_AT_decl_line   : 704
    <ec4>   DW_AT_decl_column : 17
    <ec4>   DW_AT_type        : <0xd20>
    <ec8>   DW_AT_data_member_location: 68
 <2><ec9>: Abbrev Number: 1 (DW_TAG_member)
    <eca>   DW_AT_name        : (indirect string, offset: 0xc557): AHB1ENR
    <ece>   DW_AT_decl_file   : 5
    <ece>   DW_AT_decl_line   : 705
    <ed0>   DW_AT_decl_column : 17
    <ed0>   DW_AT_type        : <0xd2c>
    <ed4>   DW_AT_data_member_location: 72
 <2><ed5>: Abbrev Number: 1 (DW_TAG_member)
    <ed6>   DW_AT_name        : (indirect string, offset: 0x2a2be): AHB2ENR
    <eda>   DW_AT_decl_file   : 5
    <eda>   DW_AT_decl_line   : 706
    <edc>   DW_AT_decl_column : 17
    <edc>   DW_AT_type        : <0xd2c>
    <ee0>   DW_AT_data_member_location: 76
 <2><ee1>: Abbrev Number: 1 (DW_TAG_member)
    <ee2>   DW_AT_name        : (indirect string, offset: 0x477be): AHB3ENR
    <ee6>   DW_AT_decl_file   : 5
    <ee6>   DW_AT_decl_line   : 707
    <ee8>   DW_AT_decl_column : 17
    <ee8>   DW_AT_type        : <0xd2c>
    <eec>   DW_AT_data_member_location: 80
 <2><eed>: Abbrev Number: 1 (DW_TAG_member)
    <eee>   DW_AT_name        : (indirect string, offset: 0x94952): RESERVED3
    <ef2>   DW_AT_decl_file   : 5
    <ef2>   DW_AT_decl_line   : 708
    <ef4>   DW_AT_decl_column : 17
    <ef4>   DW_AT_type        : <0xd20>
    <ef8>   DW_AT_data_member_location: 84
 <2><ef9>: Abbrev Number: 1 (DW_TAG_member)
    <efa>   DW_AT_name        : (indirect string, offset: 0x5148): APB1ENR1
    <efe>   DW_AT_decl_file   : 5
    <efe>   DW_AT_decl_line   : 709
    <f00>   DW_AT_decl_column : 17
    <f00>   DW_AT_type        : <0xd2c>
    <f04>   DW_AT_data_member_location: 88
 <2><f05>: Abbrev Number: 1 (DW_TAG_member)
    <f06>   DW_AT_name        : (indirect string, offset: 0x5151): APB1ENR2
    <f0a>   DW_AT_decl_file   : 5
    <f0a>   DW_AT_decl_line   : 710
    <f0c>   DW_AT_decl_column : 17
    <f0c>   DW_AT_type        : <0xd2c>
    <f10>   DW_AT_data_member_location: 92
 <2><f11>: Abbrev Number: 1 (DW_TAG_member)
    <f12>   DW_AT_name        : (indirect string, offset: 0x12839): APB2ENR
    <f16>   DW_AT_decl_file   : 5
    <f16>   DW_AT_decl_line   : 711
    <f18>   DW_AT_decl_column : 17
    <f18>   DW_AT_type        : <0xd2c>
    <f1c>   DW_AT_data_member_location: 96
 <2><f1d>: Abbrev Number: 1 (DW_TAG_member)
    <f1e>   DW_AT_name        : (indirect string, offset: 0x58712): RESERVED4
    <f22>   DW_AT_decl_file   : 5
    <f22>   DW_AT_decl_line   : 712
    <f24>   DW_AT_decl_column : 17
    <f24>   DW_AT_type        : <0xd20>
    <f28>   DW_AT_data_member_location: 100
 <2><f29>: Abbrev Number: 1 (DW_TAG_member)
    <f2a>   DW_AT_name        : (indirect string, offset: 0x4921d): AHB1SMENR
    <f2e>   DW_AT_decl_file   : 5
    <f2e>   DW_AT_decl_line   : 713
    <f30>   DW_AT_decl_column : 17
    <f30>   DW_AT_type        : <0xd2c>
    <f34>   DW_AT_data_member_location: 104
 <2><f35>: Abbrev Number: 1 (DW_TAG_member)
    <f36>   DW_AT_name        : (indirect string, offset: 0x908da): AHB2SMENR
    <f3a>   DW_AT_decl_file   : 5
    <f3a>   DW_AT_decl_line   : 714
    <f3c>   DW_AT_decl_column : 17
    <f3c>   DW_AT_type        : <0xd2c>
    <f40>   DW_AT_data_member_location: 108
 <2><f41>: Abbrev Number: 1 (DW_TAG_member)
    <f42>   DW_AT_name        : (indirect string, offset: 0x3a543): AHB3SMENR
    <f46>   DW_AT_decl_file   : 5
    <f46>   DW_AT_decl_line   : 715
    <f48>   DW_AT_decl_column : 17
    <f48>   DW_AT_type        : <0xd2c>
    <f4c>   DW_AT_data_member_location: 112
 <2><f4d>: Abbrev Number: 1 (DW_TAG_member)
    <f4e>   DW_AT_name        : (indirect string, offset: 0x94980): RESERVED5
    <f52>   DW_AT_decl_file   : 5
    <f52>   DW_AT_decl_line   : 716
    <f54>   DW_AT_decl_column : 17
    <f54>   DW_AT_type        : <0xd20>
    <f58>   DW_AT_data_member_location: 116
 <2><f59>: Abbrev Number: 1 (DW_TAG_member)
    <f5a>   DW_AT_name        : (indirect string, offset: 0x59da): APB1SMENR1
    <f5e>   DW_AT_decl_file   : 5
    <f5e>   DW_AT_decl_line   : 717
    <f60>   DW_AT_decl_column : 17
    <f60>   DW_AT_type        : <0xd2c>
    <f64>   DW_AT_data_member_location: 120
 <2><f65>: Abbrev Number: 1 (DW_TAG_member)
    <f66>   DW_AT_name        : (indirect string, offset: 0x59e5): APB1SMENR2
    <f6a>   DW_AT_decl_file   : 5
    <f6a>   DW_AT_decl_line   : 718
    <f6c>   DW_AT_decl_column : 17
    <f6c>   DW_AT_type        : <0xd2c>
    <f70>   DW_AT_data_member_location: 124
 <2><f71>: Abbrev Number: 1 (DW_TAG_member)
    <f72>   DW_AT_name        : (indirect string, offset: 0x7f70a): APB2SMENR
    <f76>   DW_AT_decl_file   : 5
    <f76>   DW_AT_decl_line   : 719
    <f78>   DW_AT_decl_column : 17
    <f78>   DW_AT_type        : <0xd2c>
    <f7c>   DW_AT_data_member_location: 128
 <2><f7d>: Abbrev Number: 1 (DW_TAG_member)
    <f7e>   DW_AT_name        : (indirect string, offset: 0x9498a): RESERVED6
    <f82>   DW_AT_decl_file   : 5
    <f82>   DW_AT_decl_line   : 720
    <f84>   DW_AT_decl_column : 17
    <f84>   DW_AT_type        : <0xd20>
    <f88>   DW_AT_data_member_location: 132
 <2><f89>: Abbrev Number: 1 (DW_TAG_member)
    <f8a>   DW_AT_name        : (indirect string, offset: 0x30a10): CCIPR
    <f8e>   DW_AT_decl_file   : 5
    <f8e>   DW_AT_decl_line   : 721
    <f90>   DW_AT_decl_column : 17
    <f90>   DW_AT_type        : <0xd2c>
    <f94>   DW_AT_data_member_location: 136
 <2><f95>: Abbrev Number: 1 (DW_TAG_member)
    <f96>   DW_AT_name        : (indirect string, offset: 0x94994): RESERVED7
    <f9a>   DW_AT_decl_file   : 5
    <f9a>   DW_AT_decl_line   : 722
    <f9c>   DW_AT_decl_column : 17
    <f9c>   DW_AT_type        : <0xd20>
    <fa0>   DW_AT_data_member_location: 140
 <2><fa1>: Abbrev Number: 1 (DW_TAG_member)
    <fa2>   DW_AT_name        : (indirect string, offset: 0x2950e): BDCR
    <fa6>   DW_AT_decl_file   : 5
    <fa6>   DW_AT_decl_line   : 723
    <fa8>   DW_AT_decl_column : 17
    <fa8>   DW_AT_type        : <0xd2c>
    <fac>   DW_AT_data_member_location: 144
 <2><fad>: Abbrev Number: 10 (DW_TAG_member)
    <fae>   DW_AT_name        : CSR
    <fb2>   DW_AT_decl_file   : 5
    <fb2>   DW_AT_decl_line   : 724
    <fb4>   DW_AT_decl_column : 17
    <fb4>   DW_AT_type        : <0xd2c>
    <fb8>   DW_AT_data_member_location: 148
 <2><fb9>: Abbrev Number: 0
 <1><fba>: Abbrev Number: 21 (DW_TAG_typedef)
    <fbb>   DW_AT_name        : (indirect string, offset: 0x49a7b): RCC_TypeDef
    <fbf>   DW_AT_decl_file   : 5
    <fbf>   DW_AT_decl_line   : 725
    <fc1>   DW_AT_decl_column : 3
    <fc1>   DW_AT_type        : <0xdea>
 <1><fc5>: Abbrev Number: 3 (DW_TAG_typedef)
