Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x126 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x3c767): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x54cc2): ../Core/Src/freertos_hooks.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x7fb10): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 7 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 1 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0x12ac1): unsigned int
 <1><38>: Abbrev Number: 1 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x69985): long long int

 <1><191>: Abbrev Number: 5 (DW_TAG_base_type)
    <192>   DW_AT_byte_size   : 2
    <193>   DW_AT_encoding    : 7	(unsigned)
    <194>   DW_AT_name        : (indirect string, offset: 0xde34b): short unsigned int
 <1><198>: Abbrev Number: 5 (DW_TAG_base_type)
    <199>   DW_AT_byte_size   : 4
    <19a>   DW_AT_encoding    : 5	(signed)
    <19b>   DW_AT_name        : (indirect string, offset: 0x135b8): long int
 <1><19f>: Abbrev Number: 3 (DW_TAG_typedef)
    <1a0>   DW_AT_name        : (indirect string, offset: 0xe8b4d): __uint32_t
    <1a4>   DW_AT_decl_file   : 3
    <1a5>   DW_AT_decl_line   : 79
    <1a6>   DW_AT_decl_column : 25
    <1a7>   DW_AT_type        : <0x1ab>
 <1><1ab>: Abbrev Number: 5 (DW_TAG_base_type)
    <1ac>   DW_AT_byte_size   : 4
    <1ad>   DW_AT_encoding    : 7	(unsigned)
    <1ae>   DW_AT_name        : (indirect string, offset: 0x58285): long unsigned int
 <1><1b2>: Abbrev Number: 3 (DW_TAG_typedef)
    <1b3>   DW_AT_name        : (indirect string, offset: 0xe8a73): __uint64_t
    <1b7>   DW_AT_decl_file   : 3
    <1b8>   DW_AT_decl_line   : 105
    <1b9>   DW_AT_decl_column : 25
    <1ba>   DW_AT_type        : <0x1be>
 <1><1be>: Abbrev Number: 5 (DW_TAG_base_type)
    <1bf>   DW_AT_byte_size   : 8
    <1c0>   DW_AT_encoding    : 7	(unsigned)
    <1c1>   DW_AT_name        : (indirect string, offset: 0x3004c): long long unsigned int
 <1><1c5>: Abbrev Number: 3 (DW_TAG_typedef)
    <1c6>   DW_AT_name        : (indirect string, offset: 0x4354f): uint8_t
    <1ca>   DW_AT_decl_file   : 4
    <1cb>   DW_AT_decl_line   : 24
    <1cc>   DW_AT_decl_column : 19
    <1cd>   DW_AT_type        : <0x177>
 <1><1d1>: Abbrev Number: 6 (DW_TAG_const_type)
    <1d2>   DW_AT_type        : <0x1c5>
 <1><1d6>: Abbrev Number: 3 (DW_TAG_typedef)
    <1d7>   DW_AT_name        : (indirect string, offset: 0xa82d1): uint32_t
    <1db>   DW_AT_decl_file   : 4
    <1dc>   DW_AT_decl_line   : 48
    <1dd>   DW_AT_decl_column : 20
    <1de>   DW_AT_type        : <0x19f>
 <1><1e2>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <1e3>   DW_AT_type        : <0x1d6>
 <1><1e7>: Abbrev Number: 3 (DW_TAG_typedef)
    <1e8>   DW_AT_name        : (indirect string, offset: 0xe8a75): uint64_t
    <1ec>   DW_AT_decl_file   : 4
    <1ed>   DW_AT_decl_line   : 60
    <1ee>   DW_AT_decl_column : 20
    <1ef>   DW_AT_type        : <0x1b2>
 <1><1f3>: Abbrev Number: 3 (DW_TAG_typedef)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x6da98): TaskFunction_t
    <1f8>   DW_AT_decl_file   : 5
    <1f9>   DW_AT_decl_line   : 36
    <1fa>   DW_AT_decl_column : 17
    <1fb>   DW_AT_type        : <0x1ff>
 <1><1ff>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <200>   DW_AT_byte_size   : 4
    <200>   DW_AT_type        : <0x204>
 <1><204>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <205>   DW_AT_prototyped  : 1
    <205>   DW_AT_sibling     : <0x20f>
 <2><209>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <20a>   DW_AT_type        : <0x20f>
 <2><20e>: Abbrev Number: 0
 <1><20f>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <210>   DW_AT_byte_size   : 4
 <1><211>: Abbrev Number: 6 (DW_TAG_const_type)
    <212>   DW_AT_type        : <0x20f>
 <1><216>: Abbrev Number: 3 (DW_TAG_typedef)
    <217>   DW_AT_name        : (indirect string, offset: 0xd522e): StackType_t
    <21b>   DW_AT_decl_file   : 6
    <21c>   DW_AT_decl_line   : 58
    <21d>   DW_AT_decl_column : 26
    <21e>   DW_AT_type        : <0x1d6>
 <1><222>: Abbrev Number: 6 (DW_TAG_const_type)
    <223>   DW_AT_type        : <0x216>
 <1><227>: Abbrev Number: 3 (DW_TAG_typedef)
    <228>   DW_AT_name        : (indirect string, offset: 0xe8cb3): BaseType_t
    <22c>   DW_AT_decl_file   : 6
    <22d>   DW_AT_decl_line   : 59
    <22e>   DW_AT_decl_column : 26
    <22f>   DW_AT_type        : <0x198>
 <1><233>: Abbrev Number: 3 (DW_TAG_typedef)
    <234>   DW_AT_name        : (indirect string, offset: 0xe8cb2): UBaseType_t
    <238>   DW_AT_decl_file   : 6
    <239>   DW_AT_decl_line   : 60
    <23a>   DW_AT_decl_column : 26
    <23b>   DW_AT_type        : <0x1ab>
 <1><23f>: Abbrev Number: 3 (DW_TAG_typedef)
    <240>   DW_AT_name        : (indirect string, offset: 0x8004b): TickType_t
    <244>   DW_AT_decl_file   : 6
    <245>   DW_AT_decl_line   : 66
    <246>   DW_AT_decl_column : 26
    <247>   DW_AT_type        : <0x1d6>
 <1><24b>: Abbrev Number: 6 (DW_TAG_const_type)
    <24c>   DW_AT_type        : <0x23f>
 <1><250>: Abbrev Number: 3 (DW_TAG_typedef)
    <251>   DW_AT_name        : (indirect string, offset: 0xc99d6): TaskHandle_t
    <255>   DW_AT_decl_file   : 7
    <256>   DW_AT_decl_line   : 95
    <257>   DW_AT_decl_column : 46
    <258>   DW_AT_type        : <0x25c>
 <1><25c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <25d>   DW_AT_byte_size   : 4
    <25d>   DW_AT_type        : <0x261>
 <1><261>: Abbrev Number: 23 (DW_TAG_structure_type)
    <262>   DW_AT_name        : (indirect string, offset: 0xc511a): tskTaskControlBlock
    <266>   DW_AT_declaration : 1
 <1><266>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <267>   DW_AT_byte_size   : 4
    <267>   DW_AT_type        : <0x277>
 <1><26b>: Abbrev Number: 6 (DW_TAG_const_type)
    <26c>   DW_AT_type        : <0x266>
 <1><270>: Abbrev Number: 5 (DW_TAG_base_type)
    <271>   DW_AT_byte_size   : 1
    <272>   DW_AT_encoding    : 8	(unsigned char)
    <273>   DW_AT_name        : (indirect string, offset: 0x4ad84): char
 <1><277>: Abbrev Number: 6 (DW_TAG_const_type)
    <278>   DW_AT_type        : <0x270>
 <1><27c>: Abbrev Number: 14 (DW_TAG_structure_type)
    <27d>   DW_AT_byte_size   : 48
    <27e>   DW_AT_decl_file   : 8
    <27e>   DW_AT_decl_line   : 531
    <280>   DW_AT_decl_column : 9
    <280>   DW_AT_sibling     : <0x309>
 <2><284>: Abbrev Number: 1 (DW_TAG_member)
    <285>   DW_AT_name        : (indirect string, offset: 0xe88b0): MODER
    <289>   DW_AT_decl_file   : 8
    <289>   DW_AT_decl_line   : 533
    <28b>   DW_AT_decl_column : 17
    <28b>   DW_AT_type        : <0x1e2>
    <28f>   DW_AT_data_member_location: 0
 <2><290>: Abbrev Number: 1 (DW_TAG_member)
    <291>   DW_AT_name        : (indirect string, offset: 0xe8bba): OTYPER
    <295>   DW_AT_decl_file   : 8
    <295>   DW_AT_decl_line   : 534
    <297>   DW_AT_decl_column : 17
    <297>   DW_AT_type        : <0x1e2>
    <29b>   DW_AT_data_member_location: 4
 <2><29c>: Abbrev Number: 1 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0xe8c23): OSPEEDR
    <2a1>   DW_AT_decl_file   : 8
    <2a1>   DW_AT_decl_line   : 535
    <2a3>   DW_AT_decl_column : 17
    <2a3>   DW_AT_type        : <0x1e2>
    <2a7>   DW_AT_data_member_location: 8
 <2><2a8>: Abbrev Number: 1 (DW_TAG_member)
    <2a9>   DW_AT_name        : (indirect string, offset: 0xe8b58): PUPDR
    <2ad>   DW_AT_decl_file   : 8
    <2ad>   DW_AT_decl_line   : 536
    <2af>   DW_AT_decl_column : 17
    <2af>   DW_AT_type        : <0x1e2>
    <2b3>   DW_AT_data_member_location: 12
 <2><2b4>: Abbrev Number: 8 (DW_TAG_member)
    <2b5>   DW_AT_name        : IDR
    <2b9>   DW_AT_decl_file   : 8
    <2b9>   DW_AT_decl_line   : 537
    <2bb>   DW_AT_decl_column : 17
    <2bb>   DW_AT_type        : <0x1e2>
    <2bf>   DW_AT_data_member_location: 16
 <2><2c0>: Abbrev Number: 8 (DW_TAG_member)
    <2c1>   DW_AT_name        : ODR
    <2c5>   DW_AT_decl_file   : 8
    <2c5>   DW_AT_decl_line   : 538
    <2c7>   DW_AT_decl_column : 17
    <2c7>   DW_AT_type        : <0x1e2>
    <2cb>   DW_AT_data_member_location: 20
 <2><2cc>: Abbrev Number: 1 (DW_TAG_member)
    <2cd>   DW_AT_name        : (indirect string, offset: 0xe897b): BSRR
    <2d1>   DW_AT_decl_file   : 8
    <2d1>   DW_AT_decl_line   : 539
    <2d3>   DW_AT_decl_column : 17
    <2d3>   DW_AT_type        : <0x1e2>
    <2d7>   DW_AT_data_member_location: 24
 <2><2d8>: Abbrev Number: 1 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0xe8c0a): LCKR
    <2dd>   DW_AT_decl_file   : 8
    <2dd>   DW_AT_decl_line   : 540
    <2df>   DW_AT_decl_column : 17
    <2df>   DW_AT_type        : <0x1e2>
    <2e3>   DW_AT_data_member_location: 28
 <2><2e4>: Abbrev Number: 8 (DW_TAG_member)
    <2e5>   DW_AT_name        : AFR
    <2e9>   DW_AT_decl_file   : 8
    <2e9>   DW_AT_decl_line   : 541
    <2eb>   DW_AT_decl_column : 17
    <2eb>   DW_AT_type        : <0x319>
    <2ef>   DW_AT_data_member_location: 32
 <2><2f0>: Abbrev Number: 8 (DW_TAG_member)
    <2f1>   DW_AT_name        : BRR
    <2f5>   DW_AT_decl_file   : 8
    <2f5>   DW_AT_decl_line   : 542
    <2f7>   DW_AT_decl_column : 17
    <2f7>   DW_AT_type        : <0x1e2>
    <2fb>   DW_AT_data_member_location: 40
 <2><2fc>: Abbrev Number: 1 (DW_TAG_member)
    <2fd>   DW_AT_name        : (indirect string, offset: 0xe88bb): ASCR
    <301>   DW_AT_decl_file   : 8
    <301>   DW_AT_decl_line   : 543
    <303>   DW_AT_decl_column : 17
    <303>   DW_AT_type        : <0x1e2>
    <307>   DW_AT_data_member_location: 44
 <2><308>: Abbrev Number: 0
 <1><309>: Abbrev Number: 15 (DW_TAG_array_type)
    <30a>   DW_AT_type        : <0x1e2>
    <30e>   DW_AT_sibling     : <0x319>
 <2><312>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <313>   DW_AT_type        : <0x15b>
    <317>   DW_AT_upper_bound : 1
 <2><318>: Abbrev Number: 0
 <1><319>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <31a>   DW_AT_type        : <0x309>
 <1><31e>: Abbrev Number: 17 (DW_TAG_typedef)
    <31f>   DW_AT_name        : (indirect string, offset: 0xe8cbe): GPIO_TypeDef
    <323>   DW_AT_decl_file   : 8
    <323>   DW_AT_decl_line   : 545
    <325>   DW_AT_decl_column : 3
    <325>   DW_AT_type        : <0x27c>
 <1><329>: Abbrev Number: 14 (DW_TAG_structure_type)
    <32a>   DW_AT_byte_size   : 152
    <32b>   DW_AT_decl_file   : 8
    <32b>   DW_AT_decl_line   : 685
    <32d>   DW_AT_decl_column : 9
    <32d>   DW_AT_sibling     : <0x4f9>
 <2><331>: Abbrev Number: 8 (DW_TAG_member)
    <332>   DW_AT_name        : CR
    <335>   DW_AT_decl_file   : 8
    <335>   DW_AT_decl_line   : 687
    <337>   DW_AT_decl_column : 17
    <337>   DW_AT_type        : <0x1e2>
    <33b>   DW_AT_data_member_location: 0
 <2><33c>: Abbrev Number: 1 (DW_TAG_member)
    <33d>   DW_AT_name        : (indirect string, offset: 0xe8ac3): ICSCR
    <341>   DW_AT_decl_file   : 8
    <341>   DW_AT_decl_line   : 688
    <343>   DW_AT_decl_column : 17
    <343>   DW_AT_type        : <0x1e2>
    <347>   DW_AT_data_member_location: 4
 <2><348>: Abbrev Number: 1 (DW_TAG_member)
    <349>   DW_AT_name        : (indirect string, offset: 0xe89ef): CFGR
    <34d>   DW_AT_decl_file   : 8
    <34d>   DW_AT_decl_line   : 689
    <34f>   DW_AT_decl_column : 17
    <34f>   DW_AT_type        : <0x1e2>
    <353>   DW_AT_data_member_location: 8
 <2><354>: Abbrev Number: 1 (DW_TAG_member)
    <355>   DW_AT_name        : (indirect string, offset: 0xe8b9d): PLLCFGR
    <359>   DW_AT_decl_file   : 8
    <359>   DW_AT_decl_line   : 690
    <35b>   DW_AT_decl_column : 17
    <35b>   DW_AT_type        : <0x1e2>
    <35f>   DW_AT_data_member_location: 12
 <2><360>: Abbrev Number: 1 (DW_TAG_member)
    <361>   DW_AT_name        : (indirect string, offset: 0xe89e8): PLLSAI1CFGR
    <365>   DW_AT_decl_file   : 8
    <365>   DW_AT_decl_line   : 691
    <367>   DW_AT_decl_column : 17
    <367>   DW_AT_type        : <0x1e2>
    <36b>   DW_AT_data_member_location: 16
 <2><36c>: Abbrev Number: 1 (DW_TAG_member)
    <36d>   DW_AT_name        : (indirect string, offset: 0xe8b63): PLLSAI2CFGR
    <371>   DW_AT_decl_file   : 8
    <371>   DW_AT_decl_line   : 692
    <373>   DW_AT_decl_column : 17
    <373>   DW_AT_type        : <0x1e2>
    <377>   DW_AT_data_member_location: 20
 <2><378>: Abbrev Number: 1 (DW_TAG_member)
    <379>   DW_AT_name        : (indirect string, offset: 0xe88c5): CIER
    <37d>   DW_AT_decl_file   : 8
    <37d>   DW_AT_decl_line   : 693
    <37f>   DW_AT_decl_column : 17
    <37f>   DW_AT_type        : <0x1e2>
    <383>   DW_AT_data_member_location: 24
 <2><384>: Abbrev Number: 1 (DW_TAG_member)
    <385>   DW_AT_name        : (indirect string, offset: 0xe88c0): CIFR
    <389>   DW_AT_decl_file   : 8
    <389>   DW_AT_decl_line   : 694
    <38b>   DW_AT_decl_column : 17
    <38b>   DW_AT_type        : <0x1e2>
    <38f>   DW_AT_data_member_location: 28
 <2><390>: Abbrev Number: 1 (DW_TAG_member)
    <391>   DW_AT_name        : (indirect string, offset: 0xe88b6): CICR
    <395>   DW_AT_decl_file   : 8
    <395>   DW_AT_decl_line   : 695
    <397>   DW_AT_decl_column : 17
    <397>   DW_AT_type        : <0x1e2>
    <39b>   DW_AT_data_member_location: 32
 <2><39c>: Abbrev Number: 1 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0xe8c64): RESERVED0
    <3a1>   DW_AT_decl_file   : 8
    <3a1>   DW_AT_decl_line   : 696
    <3a3>   DW_AT_decl_column : 17
    <3a3>   DW_AT_type        : <0x1d6>
    <3a7>   DW_AT_data_member_location: 36
 <2><3a8>: Abbrev Number: 1 (DW_TAG_member)
    <3a9>   DW_AT_name        : (indirect string, offset: 0xe8bc1): AHB1RSTR
    <3ad>   DW_AT_decl_file   : 8
    <3ad>   DW_AT_decl_line   : 697
    <3af>   DW_AT_decl_column : 17
    <3af>   DW_AT_type        : <0x1e2>
    <3b3>   DW_AT_data_member_location: 40
 <2><3b4>: Abbrev Number: 1 (DW_TAG_member)
    <3b5>   DW_AT_name        : (indirect string, offset: 0xe890c): AHB2RSTR
    <3b9>   DW_AT_decl_file   : 8
    <3b9>   DW_AT_decl_line   : 698
    <3bb>   DW_AT_decl_column : 17
    <3bb>   DW_AT_type        : <0x1e2>
    <3bf>   DW_AT_data_member_location: 44
 <2><3c0>: Abbrev Number: 1 (DW_TAG_member)
    <3c1>   DW_AT_name        : (indirect string, offset: 0xe89df): AHB3RSTR
    <3c5>   DW_AT_decl_file   : 8
    <3c5>   DW_AT_decl_line   : 699
    <3c7>   DW_AT_decl_column : 17
    <3c7>   DW_AT_type        : <0x1e2>
    <3cb>   DW_AT_data_member_location: 48
 <2><3cc>: Abbrev Number: 1 (DW_TAG_member)
    <3cd>   DW_AT_name        : (indirect string, offset: 0xe8c6e): RESERVED1
    <3d1>   DW_AT_decl_file   : 8
    <3d1>   DW_AT_decl_line   : 700
    <3d3>   DW_AT_decl_column : 17
    <3d3>   DW_AT_type        : <0x1d6>
    <3d7>   DW_AT_data_member_location: 52
 <2><3d8>: Abbrev Number: 1 (DW_TAG_member)
    <3d9>   DW_AT_name        : (indirect string, offset: 0xe8955): APB1RSTR1
    <3dd>   DW_AT_decl_file   : 8
    <3dd>   DW_AT_decl_line   : 701
    <3df>   DW_AT_decl_column : 17
    <3df>   DW_AT_type        : <0x1e2>
    <3e3>   DW_AT_data_member_location: 56
 <2><3e4>: Abbrev Number: 1 (DW_TAG_member)
    <3e5>   DW_AT_name        : (indirect string, offset: 0xe895f): APB1RSTR2
    <3e9>   DW_AT_decl_file   : 8
    <3e9>   DW_AT_decl_line   : 702
    <3eb>   DW_AT_decl_column : 17
    <3eb>   DW_AT_type        : <0x1e2>
    <3ef>   DW_AT_data_member_location: 60
 <2><3f0>: Abbrev Number: 1 (DW_TAG_member)
    <3f1>   DW_AT_name        : (indirect string, offset: 0xe8a32): APB2RSTR
    <3f5>   DW_AT_decl_file   : 8
    <3f5>   DW_AT_decl_line   : 703
    <3f7>   DW_AT_decl_column : 17
    <3f7>   DW_AT_type        : <0x1e2>
    <3fb>   DW_AT_data_member_location: 64
 <2><3fc>: Abbrev Number: 1 (DW_TAG_member)
    <3fd>   DW_AT_name        : (indirect string, offset: 0xe8c78): RESERVED2
    <401>   DW_AT_decl_file   : 8
    <401>   DW_AT_decl_line   : 704
    <403>   DW_AT_decl_column : 17
    <403>   DW_AT_type        : <0x1d6>
    <407>   DW_AT_data_member_location: 68
 <2><408>: Abbrev Number: 1 (DW_TAG_member)
    <409>   DW_AT_name        : (indirect string, offset: 0xe88ff): AHB1ENR
    <40d>   DW_AT_decl_file   : 8
    <40d>   DW_AT_decl_line   : 705
    <40f>   DW_AT_decl_column : 17
    <40f>   DW_AT_type        : <0x1e2>
    <413>   DW_AT_data_member_location: 72
 <2><414>: Abbrev Number: 1 (DW_TAG_member)
    <415>   DW_AT_name        : (indirect string, offset: 0xe8994): AHB2ENR
    <419>   DW_AT_decl_file   : 8
    <419>   DW_AT_decl_line   : 706
    <41b>   DW_AT_decl_column : 17
    <41b>   DW_AT_type        : <0x1e2>
    <41f>   DW_AT_data_member_location: 76
 <2><420>: Abbrev Number: 1 (DW_TAG_member)
    <421>   DW_AT_name        : (indirect string, offset: 0xe8a52): AHB3ENR
    <425>   DW_AT_decl_file   : 8
    <425>   DW_AT_decl_line   : 707
    <427>   DW_AT_decl_column : 17
    <427>   DW_AT_type        : <0x1e2>
    <42b>   DW_AT_data_member_location: 80
 <2><42c>: Abbrev Number: 1 (DW_TAG_member)
    <42d>   DW_AT_name        : (indirect string, offset: 0xe8c82): RESERVED3
    <431>   DW_AT_decl_file   : 8
    <431>   DW_AT_decl_line   : 708
    <433>   DW_AT_decl_column : 17
    <433>   DW_AT_type        : <0x1d6>
    <437>   DW_AT_data_member_location: 84
 <2><438>: Abbrev Number: 1 (DW_TAG_member)
    <439>   DW_AT_name        : (indirect string, offset: 0xe88ca): APB1ENR1
    <43d>   DW_AT_decl_file   : 8
    <43d>   DW_AT_decl_line   : 709
    <43f>   DW_AT_decl_column : 17
    <43f>   DW_AT_type        : <0x1e2>
    <443>   DW_AT_data_member_location: 88
 <2><444>: Abbrev Number: 1 (DW_TAG_member)
    <445>   DW_AT_name        : (indirect string, offset: 0xe88d3): APB1ENR2
    <449>   DW_AT_decl_file   : 8
    <449>   DW_AT_decl_line   : 710
    <44b>   DW_AT_decl_column : 17
    <44b>   DW_AT_type        : <0x1e2>
    <44f>   DW_AT_data_member_location: 92
 <2><450>: Abbrev Number: 1 (DW_TAG_member)
    <451>   DW_AT_name        : (indirect string, offset: 0xe8915): APB2ENR
    <455>   DW_AT_decl_file   : 8
    <455>   DW_AT_decl_line   : 711
    <457>   DW_AT_decl_column : 17
    <457>   DW_AT_type        : <0x1e2>
    <45b>   DW_AT_data_member_location: 96
 <2><45c>: Abbrev Number: 1 (DW_TAG_member)
    <45d>   DW_AT_name        : (indirect string, offset: 0xe8ae8): RESERVED4
    <461>   DW_AT_decl_file   : 8
    <461>   DW_AT_decl_line   : 712
    <463>   DW_AT_decl_column : 17
    <463>   DW_AT_type        : <0x1d6>
    <467>   DW_AT_data_member_location: 100
 <2><468>: Abbrev Number: 1 (DW_TAG_member)
    <469>   DW_AT_name        : (indirect string, offset: 0xe8a69): AHB1SMENR
    <46d>   DW_AT_decl_file   : 8
    <46d>   DW_AT_decl_line   : 713
    <46f>   DW_AT_decl_column : 17
    <46f>   DW_AT_type        : <0x1e2>
    <473>   DW_AT_data_member_location: 104
 <2><474>: Abbrev Number: 1 (DW_TAG_member)
    <475>   DW_AT_name        : (indirect string, offset: 0xe8c51): AHB2SMENR
    <479>   DW_AT_decl_file   : 8
    <479>   DW_AT_decl_line   : 714
    <47b>   DW_AT_decl_column : 17
    <47b>   DW_AT_type        : <0x1e2>
    <47f>   DW_AT_data_member_location: 108
 <2><480>: Abbrev Number: 1 (DW_TAG_member)
    <481>   DW_AT_name        : (indirect string, offset: 0xe8a0d): AHB3SMENR
    <485>   DW_AT_decl_file   : 8
    <485>   DW_AT_decl_line   : 715
    <487>   DW_AT_decl_column : 17
    <487>   DW_AT_type        : <0x1e2>
    <48b>   DW_AT_data_member_location: 112
 <2><48c>: Abbrev Number: 1 (DW_TAG_member)
    <48d>   DW_AT_name        : (indirect string, offset: 0xe8c8c): RESERVED5
    <491>   DW_AT_decl_file   : 8
    <491>   DW_AT_decl_line   : 716
    <493>   DW_AT_decl_column : 17
    <493>   DW_AT_type        : <0x1d6>
    <497>   DW_AT_data_member_location: 116
 <2><498>: Abbrev Number: 1 (DW_TAG_member)
    <499>   DW_AT_name        : (indirect string, offset: 0xe88dc): APB1SMENR1
    <49d>   DW_AT_decl_file   : 8
    <49d>   DW_AT_decl_line   : 717
    <49f>   DW_AT_decl_column : 17
    <49f>   DW_AT_type        : <0x1e2>
    <4a3>   DW_AT_data_member_location: 120
 <2><4a4>: Abbrev Number: 1 (DW_TAG_member)
    <4a5>   DW_AT_name        : (indirect string, offset: 0xe88e7): APB1SMENR2
    <4a9>   DW_AT_decl_file   : 8
    <4a9>   DW_AT_decl_line   : 718
    <4ab>   DW_AT_decl_column : 17
    <4ab>   DW_AT_type        : <0x1e2>
    <4af>   DW_AT_data_member_location: 124
 <2><4b0>: Abbrev Number: 1 (DW_TAG_member)
    <4b1>   DW_AT_name        : (indirect string, offset: 0xe8bb0): APB2SMENR
    <4b5>   DW_AT_decl_file   : 8
    <4b5>   DW_AT_decl_line   : 719
    <4b7>   DW_AT_decl_column : 17
    <4b7>   DW_AT_type        : <0x1e2>
    <4bb>   DW_AT_data_member_location: 128
 <2><4bc>: Abbrev Number: 1 (DW_TAG_member)
    <4bd>   DW_AT_name        : (indirect string, offset: 0xe8af2): RESERVED6
    <4c1>   DW_AT_decl_file   : 8
    <4c1>   DW_AT_decl_line   : 720
    <4c3>   DW_AT_decl_column : 17
    <4c3>   DW_AT_type        : <0x1d6>
    <4c7>   DW_AT_data_member_location: 132
 <2><4c8>: Abbrev Number: 1 (DW_TAG_member)
    <4c9>   DW_AT_name        : (indirect string, offset: 0xe89bc): CCIPR
    <4cd>   DW_AT_decl_file   : 8
    <4cd>   DW_AT_decl_line   : 721
    <4cf>   DW_AT_decl_column : 17
    <4cf>   DW_AT_type        : <0x1e2>
    <4d3>   DW_AT_data_member_location: 136
 <2><4d4>: Abbrev Number: 1 (DW_TAG_member)
    <4d5>   DW_AT_name        : (indirect string, offset: 0xe8c96): RESERVED7
    <4d9>   DW_AT_decl_file   : 8
    <4d9>   DW_AT_decl_line   : 722
    <4db>   DW_AT_decl_column : 17
    <4db>   DW_AT_type        : <0x1d6>
    <4df>   DW_AT_data_member_location: 140
 <2><4e0>: Abbrev Number: 1 (DW_TAG_member)
    <4e1>   DW_AT_name        : (indirect string, offset: 0xe898f): BDCR
    <4e5>   DW_AT_decl_file   : 8
    <4e5>   DW_AT_decl_line   : 723
    <4e7>   DW_AT_decl_column : 17
    <4e7>   DW_AT_type        : <0x1e2>
    <4eb>   DW_AT_data_member_location: 144
 <2><4ec>: Abbrev Number: 8 (DW_TAG_member)
    <4ed>   DW_AT_name        : CSR
    <4f1>   DW_AT_decl_file   : 8
    <4f1>   DW_AT_decl_line   : 724
    <4f3>   DW_AT_decl_column : 17
    <4f3>   DW_AT_type        : <0x1e2>
    <4f7>   DW_AT_data_member_location: 148
 <2><4f8>: Abbrev Number: 0
 <1><4f9>: Abbrev Number: 17 (DW_TAG_typedef)
    <4fa>   DW_AT_name        : (indirect string, offset: 0xe8a7e): RCC_TypeDef
    <4fe>   DW_AT_decl_file   : 8
    <4fe>   DW_AT_decl_line   : 725
    <500>   DW_AT_decl_column : 3
    <500>   DW_AT_type        : <0x329>
 <1><504>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <505>   DW_AT_encoding    : 7	(unsigned)
    <506>   DW_AT_byte_size   : 1
    <507>   DW_AT_type        : <0x183>
    <50b>   DW_AT_decl_file   : 9
    <50c>   DW_AT_decl_line   : 39
    <50d>   DW_AT_decl_column : 1
    <50e>   DW_AT_sibling     : <0x52b>
 <2><512>: Abbrev Number: 10 (DW_TAG_enumerator)
    <513>   DW_AT_name        : (indirect string, offset: 0xe89f4): HAL_OK
    <517>   DW_AT_const_value : 0
 <2><518>: Abbrev Number: 10 (DW_TAG_enumerator)
    <519>   DW_AT_name        : (indirect string, offset: 0xe8b33): HAL_ERROR
    <51d>   DW_AT_const_value : 1
 <2><51e>: Abbrev Number: 10 (DW_TAG_enumerator)
    <51f>   DW_AT_name        : (indirect string, offset: 0xe894c): HAL_BUSY
    <523>   DW_AT_const_value : 2
 <2><524>: Abbrev Number: 10 (DW_TAG_enumerator)
    <525>   DW_AT_name        : (indirect string, offset: 0xe899c): HAL_TIMEOUT
    <529>   DW_AT_const_value : 3
 <2><52a>: Abbrev Number: 0
 <1><52b>: Abbrev Number: 3 (DW_TAG_typedef)
    <52c>   DW_AT_name        : (indirect string, offset: 0xe8ca0): HAL_StatusTypeDef
    <530>   DW_AT_decl_file   : 9
    <531>   DW_AT_decl_line   : 44
    <532>   DW_AT_decl_column : 3
    <533>   DW_AT_type        : <0x504>
 <1><537>: Abbrev Number: 12 (DW_TAG_structure_type)
    <538>   DW_AT_byte_size   : 28
    <539>   DW_AT_decl_file   : 10
    <539>   DW_AT_decl_line   : 45
    <53a>   DW_AT_decl_column : 9
    <53a>   DW_AT_sibling     : <0x58c>
 <2><53e>: Abbrev Number: 2 (DW_TAG_member)
    <53f>   DW_AT_name        : (indirect string, offset: 0xe8b6f): PLLState
    <543>   DW_AT_decl_file   : 10
    <543>   DW_AT_decl_line   : 47
    <544>   DW_AT_decl_column : 12
    <544>   DW_AT_type        : <0x1d6>
    <548>   DW_AT_data_member_location: 0
 <2><549>: Abbrev Number: 2 (DW_TAG_member)
    <54a>   DW_AT_name        : (indirect string, offset: 0xe8b93): PLLSource
    <54e>   DW_AT_decl_file   : 10
    <54e>   DW_AT_decl_line   : 50
    <54f>   DW_AT_decl_column : 12
    <54f>   DW_AT_type        : <0x1d6>
    <553>   DW_AT_data_member_location: 4
 <2><554>: Abbrev Number: 2 (DW_TAG_member)
    <555>   DW_AT_name        : (indirect string, offset: 0xe8b5e): PLLM
    <559>   DW_AT_decl_file   : 10
    <559>   DW_AT_decl_line   : 53
    <55a>   DW_AT_decl_column : 12
    <55a>   DW_AT_type        : <0x1d6>
    <55e>   DW_AT_data_member_location: 8
 <2><55f>: Abbrev Number: 2 (DW_TAG_member)
    <560>   DW_AT_name        : (indirect string, offset: 0xe8be7): PLLN
    <564>   DW_AT_decl_file   : 10
    <564>   DW_AT_decl_line   : 57
    <565>   DW_AT_decl_column : 12
    <565>   DW_AT_type        : <0x1d6>
    <569>   DW_AT_data_member_location: 12
 <2><56a>: Abbrev Number: 2 (DW_TAG_member)
    <56b>   DW_AT_name        : (indirect string, offset: 0xe8bec): PLLP
    <56f>   DW_AT_decl_file   : 10
    <56f>   DW_AT_decl_line   : 61
    <570>   DW_AT_decl_column : 12
    <570>   DW_AT_type        : <0x1d6>
    <574>   DW_AT_data_member_location: 16
 <2><575>: Abbrev Number: 2 (DW_TAG_member)
    <576>   DW_AT_name        : (indirect string, offset: 0xa839d): PLLQ
    <57a>   DW_AT_decl_file   : 10
    <57a>   DW_AT_decl_line   : 65
    <57b>   DW_AT_decl_column : 12
    <57b>   DW_AT_type        : <0x1d6>
    <57f>   DW_AT_data_member_location: 20
 <2><580>: Abbrev Number: 2 (DW_TAG_member)
    <581>   DW_AT_name        : (indirect string, offset: 0xe8bf1): PLLR
    <585>   DW_AT_decl_file   : 10
    <585>   DW_AT_decl_line   : 68
    <586>   DW_AT_decl_column : 12
    <586>   DW_AT_type        : <0x1d6>
    <58a>   DW_AT_data_member_location: 24
 <2><58b>: Abbrev Number: 0
 <1><58c>: Abbrev Number: 3 (DW_TAG_typedef)
    <58d>   DW_AT_name        : (indirect string, offset: 0xe8b20): RCC_PLLInitTypeDef
    <591>   DW_AT_decl_file   : 10
    <592>   DW_AT_decl_line   : 73
    <593>   DW_AT_decl_column : 2
    <594>   DW_AT_type        : <0x537>
 <1><598>: Abbrev Number: 12 (DW_TAG_structure_type)
    <599>   DW_AT_byte_size   : 68
    <59a>   DW_AT_decl_file   : 10
    <59a>   DW_AT_decl_line   : 78
    <59b>   DW_AT_decl_column : 9
    <59b>   DW_AT_sibling     : <0x61b>
 <2><59f>: Abbrev Number: 2 (DW_TAG_member)
    <5a0>   DW_AT_name        : (indirect string, offset: 0xe8bca): OscillatorType
    <5a4>   DW_AT_decl_file   : 10
    <5a4>   DW_AT_decl_line   : 80
    <5a5>   DW_AT_decl_column : 12
    <5a5>   DW_AT_type        : <0x1d6>
    <5a9>   DW_AT_data_member_location: 0
 <2><5aa>: Abbrev Number: 2 (DW_TAG_member)
    <5ab>   DW_AT_name        : (indirect string, offset: 0xe8b78): HSEState
    <5af>   DW_AT_decl_file   : 10
    <5af>   DW_AT_decl_line   : 83
    <5b0>   DW_AT_decl_column : 12
    <5b0>   DW_AT_type        : <0x1d6>
    <5b4>   DW_AT_data_member_location: 4
 <2><5b5>: Abbrev Number: 2 (DW_TAG_member)
    <5b6>   DW_AT_name        : (indirect string, offset: 0xe8a29): LSEState
    <5ba>   DW_AT_decl_file   : 10
    <5ba>   DW_AT_decl_line   : 86
    <5bb>   DW_AT_decl_column : 12
    <5bb>   DW_AT_type        : <0x1d6>
    <5bf>   DW_AT_data_member_location: 8
 <2><5c0>: Abbrev Number: 2 (DW_TAG_member)
    <5c1>   DW_AT_name        : (indirect string, offset: 0xe8a49): HSIState
    <5c5>   DW_AT_decl_file   : 10
    <5c5>   DW_AT_decl_line   : 89
    <5c6>   DW_AT_decl_column : 12
    <5c6>   DW_AT_type        : <0x1d6>
    <5ca>   DW_AT_data_member_location: 12
 <2><5cb>: Abbrev Number: 2 (DW_TAG_member)
    <5cc>   DW_AT_name        : (indirect string, offset: 0xe8c0f): HSICalibrationValue
    <5d0>   DW_AT_decl_file   : 10
    <5d0>   DW_AT_decl_line   : 92
    <5d1>   DW_AT_decl_column : 12
    <5d1>   DW_AT_type        : <0x1d6>
    <5d5>   DW_AT_data_member_location: 16
 <2><5d6>: Abbrev Number: 2 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0xe8a04): LSIState
    <5db>   DW_AT_decl_file   : 10
    <5db>   DW_AT_decl_line   : 98
    <5dc>   DW_AT_decl_column : 12
    <5dc>   DW_AT_type        : <0x1d6>
    <5e0>   DW_AT_data_member_location: 20
 <2><5e1>: Abbrev Number: 2 (DW_TAG_member)
    <5e2>   DW_AT_name        : (indirect string, offset: 0xe89fb): MSIState
    <5e6>   DW_AT_decl_file   : 10
    <5e6>   DW_AT_decl_line   : 106
    <5e7>   DW_AT_decl_column : 12
    <5e7>   DW_AT_type        : <0x1d6>
    <5eb>   DW_AT_data_member_location: 24
 <2><5ec>: Abbrev Number: 2 (DW_TAG_member)
    <5ed>   DW_AT_name        : (indirect string, offset: 0xe89a8): MSICalibrationValue
    <5f1>   DW_AT_decl_file   : 10
    <5f1>   DW_AT_decl_line   : 109
    <5f2>   DW_AT_decl_column : 12
    <5f2>   DW_AT_type        : <0x1d6>
    <5f6>   DW_AT_data_member_location: 28
 <2><5f7>: Abbrev Number: 2 (DW_TAG_member)
    <5f8>   DW_AT_name        : (indirect string, offset: 0xe8a94): MSIClockRange
    <5fc>   DW_AT_decl_file   : 10
    <5fc>   DW_AT_decl_line   : 112
    <5fd>   DW_AT_decl_column : 12
    <5fd>   DW_AT_type        : <0x1d6>
    <601>   DW_AT_data_member_location: 32
 <2><602>: Abbrev Number: 2 (DW_TAG_member)
    <603>   DW_AT_name        : (indirect string, offset: 0xe8ba5): HSI48State
    <607>   DW_AT_decl_file   : 10
    <607>   DW_AT_decl_line   : 115
    <608>   DW_AT_decl_column : 12
    <608>   DW_AT_type        : <0x1d6>
    <60c>   DW_AT_data_member_location: 36
 <2><60d>: Abbrev Number: 25 (DW_TAG_member)
    <60e>   DW_AT_name        : PLL
    <612>   DW_AT_decl_file   : 10
    <613>   DW_AT_decl_line   : 118
    <614>   DW_AT_decl_column : 22
    <615>   DW_AT_type        : <0x58c>
    <619>   DW_AT_data_member_location: 40
 <2><61a>: Abbrev Number: 0
 <1><61b>: Abbrev Number: 3 (DW_TAG_typedef)
    <61c>   DW_AT_name        : (indirect string, offset: 0xe8aa2): RCC_OscInitTypeDef
    <620>   DW_AT_decl_file   : 10
    <621>   DW_AT_decl_line   : 120
    <622>   DW_AT_decl_column : 2
    <623>   DW_AT_type        : <0x598>
 <1><627>: Abbrev Number: 12 (DW_TAG_structure_type)
    <628>   DW_AT_byte_size   : 20
    <629>   DW_AT_decl_file   : 10
    <629>   DW_AT_decl_line   : 125
    <62a>   DW_AT_decl_column : 9
    <62a>   DW_AT_sibling     : <0x666>
 <2><62e>: Abbrev Number: 2 (DW_TAG_member)
    <62f>   DW_AT_name        : (indirect string, offset: 0xe89c2): ClockType
    <633>   DW_AT_decl_file   : 10
    <633>   DW_AT_decl_line   : 127
    <634>   DW_AT_decl_column : 12
    <634>   DW_AT_type        : <0x1d6>
    <638>   DW_AT_data_member_location: 0
 <2><639>: Abbrev Number: 2 (DW_TAG_member)
    <63a>   DW_AT_name        : (indirect string, offset: 0xe8b08): SYSCLKSource
    <63e>   DW_AT_decl_file   : 10
    <63e>   DW_AT_decl_line   : 130
    <63f>   DW_AT_decl_column : 12
    <63f>   DW_AT_type        : <0x1d6>
    <643>   DW_AT_data_member_location: 4
 <2><644>: Abbrev Number: 2 (DW_TAG_member)
    <645>   DW_AT_name        : (indirect string, offset: 0xe8bd9): AHBCLKDivider
    <649>   DW_AT_decl_file   : 10
    <649>   DW_AT_decl_line   : 133
    <64a>   DW_AT_decl_column : 12
    <64a>   DW_AT_type        : <0x1d6>
    <64e>   DW_AT_data_member_location: 8
 <2><64f>: Abbrev Number: 2 (DW_TAG_member)
    <650>   DW_AT_name        : (indirect string, offset: 0xe891d): APB1CLKDivider
    <654>   DW_AT_decl_file   : 10
    <654>   DW_AT_decl_line   : 136
    <655>   DW_AT_decl_column : 12
    <655>   DW_AT_type        : <0x1d6>
    <659>   DW_AT_data_member_location: 12
 <2><65a>: Abbrev Number: 2 (DW_TAG_member)
    <65b>   DW_AT_name        : (indirect string, offset: 0xe8a5a): APB2CLKDivider
    <65f>   DW_AT_decl_file   : 10
    <65f>   DW_AT_decl_line   : 139
    <660>   DW_AT_decl_column : 12
    <660>   DW_AT_type        : <0x1d6>
    <664>   DW_AT_data_member_location: 16
 <2><665>: Abbrev Number: 0
 <1><666>: Abbrev Number: 3 (DW_TAG_typedef)
    <667>   DW_AT_name        : (indirect string, offset: 0xe89cc): RCC_ClkInitTypeDef
    <66b>   DW_AT_decl_file   : 10
    <66c>   DW_AT_decl_line   : 142
    <66d>   DW_AT_decl_column : 2
    <66e>   DW_AT_type        : <0x627>
 <1><672>: Abbrev Number: 6 (DW_TAG_const_type)
    <673>   DW_AT_type        : <0x666>
 <1><677>: Abbrev Number: 15 (DW_TAG_array_type)
    <678>   DW_AT_type        : <0x1d1>
    <67c>   DW_AT_sibling     : <0x687>
 <2><680>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <681>   DW_AT_type        : <0x15b>
    <685>   DW_AT_upper_bound : 6
 <2><686>: Abbrev Number: 0
 <1><687>: Abbrev Number: 6 (DW_TAG_const_type)
    <688>   DW_AT_type        : <0x677>
 <1><68c>: Abbrev Number: 9 (DW_TAG_variable)
    <68d>   DW_AT_name        : (indirect string, offset: 0x2d6ad): CHANNEL_OFFSET_TAB
    <691>   DW_AT_decl_file   : 12
    <692>   DW_AT_decl_line   : 49
    <693>   DW_AT_decl_column : 22
    <694>   DW_AT_type        : <0x687>
    <698>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><69e>: Abbrev Number: 11 (DW_TAG_subprogram)
    <69f>   DW_AT_external    : 1
    <69f>   DW_AT_name        : (indirect string, offset: 0xe8bf6): HAL_RCC_ClockConfig
    <6a3>   DW_AT_decl_file   : 10
    <6a4>   DW_AT_decl_line   : 4837
    <6a6>   DW_AT_decl_column : 19
    <6a7>   DW_AT_prototyped  : 1
    <6a7>   DW_AT_type        : <0x52b>
    <6ab>   DW_AT_declaration : 1
    <6ab>   DW_AT_sibling     : <0x6ba>
 <2><6af>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <6b0>   DW_AT_type        : <0x6ba>
 <2><6b4>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <6b5>   DW_AT_type        : <0x1d6>
 <2><6b9>: Abbrev Number: 0
 <1><6ba>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6bb>   DW_AT_byte_size   : 4
    <6bb>   DW_AT_type        : <0x672>
 <1><6bf>: Abbrev Number: 11 (DW_TAG_subprogram)
    <6c0>   DW_AT_external    : 1
    <6c0>   DW_AT_name        : (indirect string, offset: 0xe8b81): HAL_RCC_OscConfig
    <6c4>   DW_AT_decl_file   : 10
    <6c5>   DW_AT_decl_line   : 4836
    <6c7>   DW_AT_decl_column : 19
    <6c8>   DW_AT_prototyped  : 1
    <6c8>   DW_AT_type        : <0x52b>
    <6cc>   DW_AT_declaration : 1
    <6cc>   DW_AT_sibling     : <0x6d6>
 <2><6d0>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <6d1>   DW_AT_type        : <0x6d6>
 <2><6d5>: Abbrev Number: 0
 <1><6d6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6d7>   DW_AT_byte_size   : 4
    <6d7>   DW_AT_type        : <0x61b>
 <1><6db>: Abbrev Number: 11 (DW_TAG_subprogram)
    <6dc>   DW_AT_external    : 1
    <6dc>   DW_AT_name        : (indirect string, offset: 0xe892c): HAL_PWREx_ControlVoltageScaling
    <6e0>   DW_AT_decl_file   : 11
    <6e1>   DW_AT_decl_line   : 837
    <6e3>   DW_AT_decl_column : 19
    <6e4>   DW_AT_prototyped  : 1
    <6e4>   DW_AT_type        : <0x52b>
    <6e8>   DW_AT_declaration : 1
    <6e8>   DW_AT_sibling     : <0x6f2>
 <2><6ec>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <6ed>   DW_AT_type        : <0x1d6>
 <2><6f1>: Abbrev Number: 0
 <1><6f2>: Abbrev Number: 26 (DW_TAG_subprogram)
    <6f3>   DW_AT_external    : 1
    <6f3>   DW_AT_name        : (indirect string, offset: 0xe8add): vTaskDelay
    <6f7>   DW_AT_decl_file   : 7
    <6f8>   DW_AT_decl_line   : 859
    <6fa>   DW_AT_decl_column : 6
    <6fb>   DW_AT_prototyped  : 1
    <6fb>   DW_AT_declaration : 1
    <6fb>   DW_AT_sibling     : <0x705>
 <2><6ff>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <700>   DW_AT_type        : <0x24b>
 <2><704>: Abbrev Number: 0
 <1><705>: Abbrev Number: 11 (DW_TAG_subprogram)
    <706>   DW_AT_external    : 1
    <706>   DW_AT_name        : (indirect string, offset: 0xe8afc): xTaskCreate
    <70a>   DW_AT_decl_file   : 7
    <70b>   DW_AT_decl_line   : 385
    <70d>   DW_AT_decl_column : 16
    <70e>   DW_AT_prototyped  : 1
    <70e>   DW_AT_type        : <0x227>
    <712>   DW_AT_declaration : 1
    <712>   DW_AT_sibling     : <0x735>
 <2><716>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <717>   DW_AT_type        : <0x1f3>
 <2><71b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <71c>   DW_AT_type        : <0x26b>
 <2><720>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <721>   DW_AT_type        : <0x222>
 <2><725>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <726>   DW_AT_type        : <0x211>
 <2><72a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <72b>   DW_AT_type        : <0x233>
 <2><72f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <730>   DW_AT_type        : <0x73a>
 <2><734>: Abbrev Number: 0
 <1><735>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <736>   DW_AT_byte_size   : 4
    <736>   DW_AT_type        : <0x250>
 <1><73a>: Abbrev Number: 6 (DW_TAG_const_type)
    <73b>   DW_AT_type        : <0x735>
 <1><73f>: Abbrev Number: 27 (DW_TAG_subprogram)
    <740>   DW_AT_external    : 1
    <740>   DW_AT_name        : (indirect string, offset: 0xe8ac9): vTaskStartScheduler
    <744>   DW_AT_decl_file   : 7
    <745>   DW_AT_decl_line   : 1520
    <747>   DW_AT_decl_column : 6
    <748>   DW_AT_prototyped  : 1
    <748>   DW_AT_declaration : 1
 <1><748>: Abbrev Number: 28 (DW_TAG_subprogram)
    <749>   DW_AT_external    : 1
    <749>   DW_AT_name        : (indirect string, offset: 0xe8c5b): HAL_Init
    <74d>   DW_AT_decl_file   : 13
    <74e>   DW_AT_decl_line   : 636
    <750>   DW_AT_decl_column : 19
    <751>   DW_AT_prototyped  : 1
    <751>   DW_AT_type        : <0x52b>
    <755>   DW_AT_declaration : 1
 <1><755>: Abbrev Number: 29 (DW_TAG_subprogram)
    <756>   DW_AT_external    : 1
    <756>   DW_AT_name        : (indirect string, offset: 0xe8a3b): Error_Handler
    <75a>   DW_AT_decl_file   : 1
    <75b>   DW_AT_decl_line   : 86
    <75c>   DW_AT_decl_column : 6
    <75d>   DW_AT_prototyped  : 1
    <75d>   DW_AT_low_pc      : 0x800072c
    <761>   DW_AT_high_pc     : 0xc
    <765>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <767>   DW_AT_call_all_calls: 1
    <767>   DW_AT_sibling     : <0x77c>
 <2><76b>: Abbrev Number: 30 (DW_TAG_inlined_subroutine)
    <76c>   DW_AT_abstract_origin: <0x83a>
    <770>   DW_AT_low_pc      : 0x8000730
    <774>   DW_AT_high_pc     : 0x4
    <778>   DW_AT_call_file   : 1
    <779>   DW_AT_call_line   : 88
    <77a>   DW_AT_call_column : 3
 <2><77b>: Abbrev Number: 0
 <1><77c>: Abbrev Number: 18 (DW_TAG_subprogram)
    <77d>   DW_AT_external    : 1
    <77d>   DW_AT_name        : (indirect string, offset: 0xe8c2b): SystemClock_Config
    <781>   DW_AT_decl_file   : 1
    <781>   DW_AT_decl_line   : 53
    <782>   DW_AT_decl_column : 6
    <782>   DW_AT_prototyped  : 1
    <782>   DW_AT_low_pc      : 0x80006a0
    <786>   DW_AT_high_pc     : 0x8c
    <78a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <78c>   DW_AT_call_all_tail_calls: 1
    <78c>   DW_AT_sibling     : <0x7b1>
 <2><790>: Abbrev Number: 9 (DW_TAG_variable)
    <791>   DW_AT_name        : (indirect string, offset: 0xe8969): RCC_OscInitStruct
    <795>   DW_AT_decl_file   : 1
    <796>   DW_AT_decl_line   : 55
    <797>   DW_AT_decl_column : 22
    <798>   DW_AT_type        : <0x61b>
    <79c>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><7a0>: Abbrev Number: 9 (DW_TAG_variable)
    <7a1>   DW_AT_name        : (indirect string, offset: 0xe8a17): RCC_ClkInitStruct
    <7a5>   DW_AT_decl_file   : 1
    <7a6>   DW_AT_decl_line   : 56
    <7a7>   DW_AT_decl_column : 22
    <7a8>   DW_AT_type        : <0x666>
    <7ac>   DW_AT_location    : 3 byte block: 91 a0 7f 	(DW_OP_fbreg: -96)
 <2><7b0>: Abbrev Number: 0
 <1><7b1>: Abbrev Number: 31 (DW_TAG_subprogram)
    <7b2>   DW_AT_external    : 1
    <7b2>   DW_AT_name        : (indirect string, offset: 0xe8b3d): GPIOPortAConfig
    <7b6>   DW_AT_decl_file   : 1
    <7b7>   DW_AT_decl_line   : 40
    <7b8>   DW_AT_decl_column : 6
    <7b9>   DW_AT_prototyped  : 1
    <7b9>   DW_AT_low_pc      : 0x8000660
    <7bd>   DW_AT_high_pc     : 0x40
    <7c1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7c3>   DW_AT_call_all_calls: 1
 <1><7c3>: Abbrev Number: 18 (DW_TAG_subprogram)
    <7c4>   DW_AT_external    : 1
    <7c4>   DW_AT_name        : (indirect string, offset: 0xe8b15): vHeartbeat
    <7c8>   DW_AT_decl_file   : 1
    <7c8>   DW_AT_decl_line   : 29
    <7c9>   DW_AT_decl_column : 6
    <7c9>   DW_AT_prototyped  : 1
    <7c9>   DW_AT_low_pc      : 0x800051c
    <7cd>   DW_AT_high_pc     : 0x142
    <7d1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7d3>   DW_AT_call_all_tail_calls: 1
    <7d3>   DW_AT_sibling     : <0x7f6>
 <2><7d7>: Abbrev Number: 32 (DW_TAG_formal_parameter)
    <7d8>   DW_AT_name        : (indirect string, offset: 0xe88f2): pvParameters
    <7dc>   DW_AT_decl_file   : 1
    <7dd>   DW_AT_decl_line   : 29
    <7de>   DW_AT_decl_column : 23
    <7df>   DW_AT_type        : <0x20f>
    <7e3>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><7e6>: Abbrev Number: 9 (DW_TAG_variable)
    <7e7>   DW_AT_name        : (indirect string, offset: 0xe8ccb): rate
    <7eb>   DW_AT_decl_file   : 1
    <7ec>   DW_AT_decl_line   : 30
    <7ed>   DW_AT_decl_column : 12
    <7ee>   DW_AT_type        : <0x7f6>
    <7f2>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><7f5>: Abbrev Number: 0
 <1><7f6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <7f7>   DW_AT_byte_size   : 4
    <7f7>   DW_AT_type        : <0x1d6>
 <1><7fb>: Abbrev Number: 33 (DW_TAG_subprogram)
    <7fc>   DW_AT_name        : (indirect string, offset: 0xe8980): prvCreateTasks
    <800>   DW_AT_decl_file   : 1
    <801>   DW_AT_decl_line   : 24
    <802>   DW_AT_decl_column : 13
    <803>   DW_AT_prototyped  : 1
    <803>   DW_AT_low_pc      : 0x80004f0
    <807>   DW_AT_high_pc     : 0x2c
    <80b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <80d>   DW_AT_call_all_tail_calls: 1
    <80d>   DW_AT_sibling     : <0x824>
 <2><811>: Abbrev Number: 9 (DW_TAG_variable)
    <812>   DW_AT_name        : (indirect string, offset: 0xe8ccb): rate
    <816>   DW_AT_decl_file   : 1
    <817>   DW_AT_decl_line   : 25
    <818>   DW_AT_decl_column : 18
    <819>   DW_AT_type        : <0x1d6>
    <81d>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <2><823>: Abbrev Number: 0
 <1><824>: Abbrev Number: 34 (DW_TAG_subprogram)
    <825>   DW_AT_external    : 1
    <825>   DW_AT_name        : (indirect string, offset: 0xe8907): main
    <829>   DW_AT_decl_file   : 1
    <82a>   DW_AT_decl_line   : 13
    <82b>   DW_AT_decl_column : 5
    <82c>   DW_AT_prototyped  : 1
    <82c>   DW_AT_type        : <0x154>
    <830>   DW_AT_low_pc      : 0x80004d2
    <834>   DW_AT_high_pc     : 0x1c
    <838>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <83a>   DW_AT_call_all_tail_calls: 1
 <1><83a>: Abbrev Number: 35 (DW_TAG_subprogram)
    <83b>   DW_AT_name        : (indirect string, offset: 0xe8ab5): __disable_irq
    <83f>   DW_AT_decl_file   : 2
    <840>   DW_AT_decl_line   : 207
    <841>   DW_AT_decl_column : 27
    <842>   DW_AT_prototyped  : 1
    <842>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><843>: Abbrev Number: 0
  Compilation Unit @ offset 0x844:
   Length:        0x2fd (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x30d
   Pointer Size:  4
 <0><850>: Abbrev Number: 7 (DW_TAG_compile_unit)
    <851>   DW_AT_producer    : (indirect string, offset: 0x3c767): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <855>   DW_AT_language    : 29	(C11)
    <856>   DW_AT_name        : (indirect string, offset: 0xe8ce3): ../Core/Src/stm32l4xx_hal_msp.c
    <85a>   DW_AT_comp_dir    : (indirect string, offset: 0x7fb10): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <85e>   DW_AT_ranges      : 0x58
    <862>   DW_AT_low_pc      : 0
    <866>   DW_AT_stmt_list   : 0x107a
    <86a>   DW_AT_macros      : 0x25088
 <1><86e>: Abbrev Number: 2 (DW_TAG_base_type)
    <86f>   DW_AT_byte_size   : 1
    <870>   DW_AT_encoding    : 6	(signed char)
    <871>   DW_AT_name        : (indirect string, offset: 0x751ec): signed char
 <1><875>: Abbrev Number: 3 (DW_TAG_typedef)
    <876>   DW_AT_name        : (indirect string, offset: 0x4354d): __uint8_t
    <87a>   DW_AT_decl_file   : 2
    <87b>   DW_AT_decl_line   : 43
    <87c>   DW_AT_decl_column : 24
    <87d>   DW_AT_type        : <0x881>
 <1><881>: Abbrev Number: 2 (DW_TAG_base_type)
    <882>   DW_AT_byte_size   : 1
    <883>   DW_AT_encoding    : 8	(unsigned char)
    <884>   DW_AT_name        : (indirect string, offset: 0xdfda1): unsigned char
 <1><888>: Abbrev Number: 2 (DW_TAG_base_type)
    <889>   DW_AT_byte_size   : 2
    <88a>   DW_AT_encoding    : 5	(signed)
    <88b>   DW_AT_name        : (indirect string, offset: 0xac250): short int
 <1><88f>: Abbrev Number: 2 (DW_TAG_base_type)
    <890>   DW_AT_byte_size   : 2
    <891>   DW_AT_encoding    : 7	(unsigned)
    <892>   DW_AT_name        : (indirect string, offset: 0xde34b): short unsigned int
 <1><896>: Abbrev Number: 2 (DW_TAG_base_type)
    <897>   DW_AT_byte_size   : 4
    <898>   DW_AT_encoding    : 5	(signed)
    <899>   DW_AT_name        : (indirect string, offset: 0x135b8): long int
 <1><89d>: Abbrev Number: 3 (DW_TAG_typedef)
    <89e>   DW_AT_name        : (indirect string, offset: 0xe8b4d): __uint32_t
    <8a2>   DW_AT_decl_file   : 2
    <8a3>   DW_AT_decl_line   : 79
    <8a4>   DW_AT_decl_column : 25
    <8a5>   DW_AT_type        : <0x8a9>
 <1><8a9>: Abbrev Number: 2 (DW_TAG_base_type)
    <8aa>   DW_AT_byte_size   : 4
    <8ab>   DW_AT_encoding    : 7	(unsigned)
    <8ac>   DW_AT_name        : (indirect string, offset: 0x58285): long unsigned int
 <1><8b0>: Abbrev Number: 2 (DW_TAG_base_type)
    <8b1>   DW_AT_byte_size   : 8
    <8b2>   DW_AT_encoding    : 5	(signed)
    <8b3>   DW_AT_name        : (indirect string, offset: 0x69985): long long int
 <1><8b7>: Abbrev Number: 2 (DW_TAG_base_type)
    <8b8>   DW_AT_byte_size   : 8
    <8b9>   DW_AT_encoding    : 7	(unsigned)
    <8ba>   DW_AT_name        : (indirect string, offset: 0x3004c): long long unsigned int
 <1><8be>: Abbrev Number: 8 (DW_TAG_base_type)
    <8bf>   DW_AT_byte_size   : 4
    <8c0>   DW_AT_encoding    : 5	(signed)
    <8c1>   DW_AT_name        : int
 <1><8c5>: Abbrev Number: 2 (DW_TAG_base_type)
    <8c6>   DW_AT_byte_size   : 4
    <8c7>   DW_AT_encoding    : 7	(unsigned)
    <8c8>   DW_AT_name        : (indirect string, offset: 0x12ac1): unsigned int
 <1><8cc>: Abbrev Number: 3 (DW_TAG_typedef)
    <8cd>   DW_AT_name        : (indirect string, offset: 0x4354f): uint8_t
    <8d1>   DW_AT_decl_file   : 3
    <8d2>   DW_AT_decl_line   : 24
    <8d3>   DW_AT_decl_column : 19
    <8d4>   DW_AT_type        : <0x875>
 <1><8d8>: Abbrev Number: 5 (DW_TAG_const_type)
    <8d9>   DW_AT_type        : <0x8cc>
 <1><8dd>: Abbrev Number: 3 (DW_TAG_typedef)
    <8de>   DW_AT_name        : (indirect string, offset: 0xa82d1): uint32_t
    <8e2>   DW_AT_decl_file   : 3
    <8e3>   DW_AT_decl_line   : 48
    <8e4>   DW_AT_decl_column : 20
    <8e5>   DW_AT_type        : <0x89d>
 <1><8e9>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <8ea>   DW_AT_type        : <0x8dd>
 <1><8ee>: Abbrev Number: 10 (DW_TAG_structure_type)
    <8ef>   DW_AT_byte_size   : 152
    <8f0>   DW_AT_decl_file   : 4
    <8f1>   DW_AT_decl_line   : 685
    <8f3>   DW_AT_decl_column : 9
    <8f4>   DW_AT_sibling     : <0xac0>
 <2><8f8>: Abbrev Number: 6 (DW_TAG_member)
    <8f9>   DW_AT_name        : CR
    <8fc>   DW_AT_decl_file   : 4
    <8fc>   DW_AT_decl_line   : 687
    <8fe>   DW_AT_decl_column : 17
    <8fe>   DW_AT_type        : <0x8e9>
    <902>   DW_AT_data_member_location: 0
 <2><903>: Abbrev Number: 1 (DW_TAG_member)
    <904>   DW_AT_name        : (indirect string, offset: 0xe8ac3): ICSCR
    <908>   DW_AT_decl_file   : 4
    <908>   DW_AT_decl_line   : 688
    <90a>   DW_AT_decl_column : 17
    <90a>   DW_AT_type        : <0x8e9>
    <90e>   DW_AT_data_member_location: 4
 <2><90f>: Abbrev Number: 1 (DW_TAG_member)
    <910>   DW_AT_name        : (indirect string, offset: 0xe89ef): CFGR
    <914>   DW_AT_decl_file   : 4
    <914>   DW_AT_decl_line   : 689
    <916>   DW_AT_decl_column : 17
    <916>   DW_AT_type        : <0x8e9>
    <91a>   DW_AT_data_member_location: 8
 <2><91b>: Abbrev Number: 1 (DW_TAG_member)
    <91c>   DW_AT_name        : (indirect string, offset: 0xe8b9d): PLLCFGR
    <920>   DW_AT_decl_file   : 4
    <920>   DW_AT_decl_line   : 690
    <922>   DW_AT_decl_column : 17
    <922>   DW_AT_type        : <0x8e9>
    <926>   DW_AT_data_member_location: 12
 <2><927>: Abbrev Number: 1 (DW_TAG_member)
    <928>   DW_AT_name        : (indirect string, offset: 0xe89e8): PLLSAI1CFGR
    <92c>   DW_AT_decl_file   : 4
    <92c>   DW_AT_decl_line   : 691
    <92e>   DW_AT_decl_column : 17
    <92e>   DW_AT_type        : <0x8e9>
    <932>   DW_AT_data_member_location: 16
 <2><933>: Abbrev Number: 1 (DW_TAG_member)
    <934>   DW_AT_name        : (indirect string, offset: 0xe8b63): PLLSAI2CFGR
    <938>   DW_AT_decl_file   : 4
    <938>   DW_AT_decl_line   : 692
    <93a>   DW_AT_decl_column : 17
    <93a>   DW_AT_type        : <0x8e9>
    <93e>   DW_AT_data_member_location: 20
 <2><93f>: Abbrev Number: 1 (DW_TAG_member)
    <940>   DW_AT_name        : (indirect string, offset: 0xe88c5): CIER
    <944>   DW_AT_decl_file   : 4
    <944>   DW_AT_decl_line   : 693
    <946>   DW_AT_decl_column : 17
    <946>   DW_AT_type        : <0x8e9>
    <94a>   DW_AT_data_member_location: 24
 <2><94b>: Abbrev Number: 1 (DW_TAG_member)
    <94c>   DW_AT_name        : (indirect string, offset: 0xe88c0): CIFR
    <950>   DW_AT_decl_file   : 4
    <950>   DW_AT_decl_line   : 694
    <952>   DW_AT_decl_column : 17
    <952>   DW_AT_type        : <0x8e9>
    <956>   DW_AT_data_member_location: 28
 <2><957>: Abbrev Number: 1 (DW_TAG_member)
    <958>   DW_AT_name        : (indirect string, offset: 0xe88b6): CICR
    <95c>   DW_AT_decl_file   : 4
    <95c>   DW_AT_decl_line   : 695
    <95e>   DW_AT_decl_column : 17
    <95e>   DW_AT_type        : <0x8e9>
    <962>   DW_AT_data_member_location: 32
 <2><963>: Abbrev Number: 1 (DW_TAG_member)
    <964>   DW_AT_name        : (indirect string, offset: 0xe8c64): RESERVED0
    <968>   DW_AT_decl_file   : 4
    <968>   DW_AT_decl_line   : 696
    <96a>   DW_AT_decl_column : 17
    <96a>   DW_AT_type        : <0x8dd>
    <96e>   DW_AT_data_member_location: 36
 <2><96f>: Abbrev Number: 1 (DW_TAG_member)
    <970>   DW_AT_name        : (indirect string, offset: 0xe8bc1): AHB1RSTR
    <974>   DW_AT_decl_file   : 4
    <974>   DW_AT_decl_line   : 697
    <976>   DW_AT_decl_column : 17
    <976>   DW_AT_type        : <0x8e9>
    <97a>   DW_AT_data_member_location: 40
 <2><97b>: Abbrev Number: 1 (DW_TAG_member)
    <97c>   DW_AT_name        : (indirect string, offset: 0xe890c): AHB2RSTR
    <980>   DW_AT_decl_file   : 4
    <980>   DW_AT_decl_line   : 698
    <982>   DW_AT_decl_column : 17
    <982>   DW_AT_type        : <0x8e9>
    <986>   DW_AT_data_member_location: 44
 <2><987>: Abbrev Number: 1 (DW_TAG_member)
    <988>   DW_AT_name        : (indirect string, offset: 0xe89df): AHB3RSTR
    <98c>   DW_AT_decl_file   : 4
    <98c>   DW_AT_decl_line   : 699
    <98e>   DW_AT_decl_column : 17
    <98e>   DW_AT_type        : <0x8e9>
    <992>   DW_AT_data_member_location: 48
 <2><993>: Abbrev Number: 1 (DW_TAG_member)
    <994>   DW_AT_name        : (indirect string, offset: 0xe8c6e): RESERVED1
    <998>   DW_AT_decl_file   : 4
    <998>   DW_AT_decl_line   : 700
    <99a>   DW_AT_decl_column : 17
    <99a>   DW_AT_type        : <0x8dd>
    <99e>   DW_AT_data_member_location: 52
 <2><99f>: Abbrev Number: 1 (DW_TAG_member)
    <9a0>   DW_AT_name        : (indirect string, offset: 0xe8955): APB1RSTR1
    <9a4>   DW_AT_decl_file   : 4
    <9a4>   DW_AT_decl_line   : 701
    <9a6>   DW_AT_decl_column : 17
    <9a6>   DW_AT_type        : <0x8e9>
    <9aa>   DW_AT_data_member_location: 56
 <2><9ab>: Abbrev Number: 1 (DW_TAG_member)
    <9ac>   DW_AT_name        : (indirect string, offset: 0xe895f): APB1RSTR2
    <9b0>   DW_AT_decl_file   : 4
    <9b0>   DW_AT_decl_line   : 702
    <9b2>   DW_AT_decl_column : 17
    <9b2>   DW_AT_type        : <0x8e9>
    <9b6>   DW_AT_data_member_location: 60
 <2><9b7>: Abbrev Number: 1 (DW_TAG_member)
    <9b8>   DW_AT_name        : (indirect string, offset: 0xe8a32): APB2RSTR
    <9bc>   DW_AT_decl_file   : 4
    <9bc>   DW_AT_decl_line   : 703
    <9be>   DW_AT_decl_column : 17
    <9be>   DW_AT_type        : <0x8e9>
    <9c2>   DW_AT_data_member_location: 64
 <2><9c3>: Abbrev Number: 1 (DW_TAG_member)
    <9c4>   DW_AT_name        : (indirect string, offset: 0xe8c78): RESERVED2
    <9c8>   DW_AT_decl_file   : 4
    <9c8>   DW_AT_decl_line   : 704
    <9ca>   DW_AT_decl_column : 17
    <9ca>   DW_AT_type        : <0x8dd>
    <9ce>   DW_AT_data_member_location: 68
 <2><9cf>: Abbrev Number: 1 (DW_TAG_member)
    <9d0>   DW_AT_name        : (indirect string, offset: 0xe88ff): AHB1ENR
    <9d4>   DW_AT_decl_file   : 4
    <9d4>   DW_AT_decl_line   : 705
    <9d6>   DW_AT_decl_column : 17
    <9d6>   DW_AT_type        : <0x8e9>
    <9da>   DW_AT_data_member_location: 72
 <2><9db>: Abbrev Number: 1 (DW_TAG_member)
    <9dc>   DW_AT_name        : (indirect string, offset: 0xe8994): AHB2ENR
    <9e0>   DW_AT_decl_file   : 4
    <9e0>   DW_AT_decl_line   : 706
    <9e2>   DW_AT_decl_column : 17
    <9e2>   DW_AT_type        : <0x8e9>
    <9e6>   DW_AT_data_member_location: 76
 <2><9e7>: Abbrev Number: 1 (DW_TAG_member)
    <9e8>   DW_AT_name        : (indirect string, offset: 0xe8a52): AHB3ENR
    <9ec>   DW_AT_decl_file   : 4
    <9ec>   DW_AT_decl_line   : 707
    <9ee>   DW_AT_decl_column : 17
    <9ee>   DW_AT_type        : <0x8e9>
    <9f2>   DW_AT_data_member_location: 80
 <2><9f3>: Abbrev Number: 1 (DW_TAG_member)
    <9f4>   DW_AT_name        : (indirect string, offset: 0xe8c82): RESERVED3
    <9f8>   DW_AT_decl_file   : 4
    <9f8>   DW_AT_decl_line   : 708
    <9fa>   DW_AT_decl_column : 17
    <9fa>   DW_AT_type        : <0x8dd>
    <9fe>   DW_AT_data_member_location: 84
 <2><9ff>: Abbrev Number: 1 (DW_TAG_member)
    <a00>   DW_AT_name        : (indirect string, offset: 0xe88ca): APB1ENR1
    <a04>   DW_AT_decl_file   : 4
    <a04>   DW_AT_decl_line   : 709
    <a06>   DW_AT_decl_column : 17
    <a06>   DW_AT_type        : <0x8e9>
    <a0a>   DW_AT_data_member_location: 88
 <2><a0b>: Abbrev Number: 1 (DW_TAG_member)
    <a0c>   DW_AT_name        : (indirect string, offset: 0xe88d3): APB1ENR2
    <a10>   DW_AT_decl_file   : 4
    <a10>   DW_AT_decl_line   : 710
    <a12>   DW_AT_decl_column : 17
    <a12>   DW_AT_type        : <0x8e9>
    <a16>   DW_AT_data_member_location: 92
 <2><a17>: Abbrev Number: 1 (DW_TAG_member)
    <a18>   DW_AT_name        : (indirect string, offset: 0xe8915): APB2ENR
    <a1c>   DW_AT_decl_file   : 4
    <a1c>   DW_AT_decl_line   : 711
    <a1e>   DW_AT_decl_column : 17
    <a1e>   DW_AT_type        : <0x8e9>
    <a22>   DW_AT_data_member_location: 96
 <2><a23>: Abbrev Number: 1 (DW_TAG_member)
    <a24>   DW_AT_name        : (indirect string, offset: 0xe8ae8): RESERVED4
    <a28>   DW_AT_decl_file   : 4
    <a28>   DW_AT_decl_line   : 712
    <a2a>   DW_AT_decl_column : 17
    <a2a>   DW_AT_type        : <0x8dd>
    <a2e>   DW_AT_data_member_location: 100
 <2><a2f>: Abbrev Number: 1 (DW_TAG_member)
    <a30>   DW_AT_name        : (indirect string, offset: 0xe8a69): AHB1SMENR
    <a34>   DW_AT_decl_file   : 4
    <a34>   DW_AT_decl_line   : 713
    <a36>   DW_AT_decl_column : 17
    <a36>   DW_AT_type        : <0x8e9>
    <a3a>   DW_AT_data_member_location: 104
 <2><a3b>: Abbrev Number: 1 (DW_TAG_member)
    <a3c>   DW_AT_name        : (indirect string, offset: 0xe8c51): AHB2SMENR
    <a40>   DW_AT_decl_file   : 4
    <a40>   DW_AT_decl_line   : 714
    <a42>   DW_AT_decl_column : 17
    <a42>   DW_AT_type        : <0x8e9>
    <a46>   DW_AT_data_member_location: 108
 <2><a47>: Abbrev Number: 1 (DW_TAG_member)
    <a48>   DW_AT_name        : (indirect string, offset: 0xe8a0d): AHB3SMENR
    <a4c>   DW_AT_decl_file   : 4
    <a4c>   DW_AT_decl_line   : 715
    <a4e>   DW_AT_decl_column : 17
    <a4e>   DW_AT_type        : <0x8e9>
    <a52>   DW_AT_data_member_location: 112
 <2><a53>: Abbrev Number: 1 (DW_TAG_member)
    <a54>   DW_AT_name        : (indirect string, offset: 0xe8c8c): RESERVED5
    <a58>   DW_AT_decl_file   : 4
    <a58>   DW_AT_decl_line   : 716
    <a5a>   DW_AT_decl_column : 17
    <a5a>   DW_AT_type        : <0x8dd>
    <a5e>   DW_AT_data_member_location: 116
 <2><a5f>: Abbrev Number: 1 (DW_TAG_member)
    <a60>   DW_AT_name        : (indirect string, offset: 0xe88dc): APB1SMENR1
    <a64>   DW_AT_decl_file   : 4
    <a64>   DW_AT_decl_line   : 717
    <a66>   DW_AT_decl_column : 17
    <a66>   DW_AT_type        : <0x8e9>
    <a6a>   DW_AT_data_member_location: 120
 <2><a6b>: Abbrev Number: 1 (DW_TAG_member)
    <a6c>   DW_AT_name        : (indirect string, offset: 0xe88e7): APB1SMENR2
    <a70>   DW_AT_decl_file   : 4
    <a70>   DW_AT_decl_line   : 718
    <a72>   DW_AT_decl_column : 17
    <a72>   DW_AT_type        : <0x8e9>
    <a76>   DW_AT_data_member_location: 124
 <2><a77>: Abbrev Number: 1 (DW_TAG_member)
    <a78>   DW_AT_name        : (indirect string, offset: 0xe8bb0): APB2SMENR
    <a7c>   DW_AT_decl_file   : 4
    <a7c>   DW_AT_decl_line   : 719
    <a7e>   DW_AT_decl_column : 17
    <a7e>   DW_AT_type        : <0x8e9>
    <a82>   DW_AT_data_member_location: 128
 <2><a83>: Abbrev Number: 1 (DW_TAG_member)
    <a84>   DW_AT_name        : (indirect string, offset: 0xe8af2): RESERVED6
    <a88>   DW_AT_decl_file   : 4
    <a88>   DW_AT_decl_line   : 720
    <a8a>   DW_AT_decl_column : 17
    <a8a>   DW_AT_type        : <0x8dd>
    <a8e>   DW_AT_data_member_location: 132
 <2><a8f>: Abbrev Number: 1 (DW_TAG_member)
    <a90>   DW_AT_name        : (indirect string, offset: 0xe89bc): CCIPR
    <a94>   DW_AT_decl_file   : 4
    <a94>   DW_AT_decl_line   : 721
    <a96>   DW_AT_decl_column : 17
    <a96>   DW_AT_type        : <0x8e9>
    <a9a>   DW_AT_data_member_location: 136
 <2><a9b>: Abbrev Number: 1 (DW_TAG_member)
    <a9c>   DW_AT_name        : (indirect string, offset: 0xe8c96): RESERVED7
    <aa0>   DW_AT_decl_file   : 4
    <aa0>   DW_AT_decl_line   : 722
    <aa2>   DW_AT_decl_column : 17
    <aa2>   DW_AT_type        : <0x8dd>
    <aa6>   DW_AT_data_member_location: 140
 <2><aa7>: Abbrev Number: 1 (DW_TAG_member)
    <aa8>   DW_AT_name        : (indirect string, offset: 0xe898f): BDCR
    <aac>   DW_AT_decl_file   : 4
    <aac>   DW_AT_decl_line   : 723
    <aae>   DW_AT_decl_column : 17
    <aae>   DW_AT_type        : <0x8e9>
    <ab2>   DW_AT_data_member_location: 144
 <2><ab3>: Abbrev Number: 6 (DW_TAG_member)
    <ab4>   DW_AT_name        : CSR
    <ab8>   DW_AT_decl_file   : 4
    <ab8>   DW_AT_decl_line   : 724
    <aba>   DW_AT_decl_column : 17
    <aba>   DW_AT_type        : <0x8e9>
    <abe>   DW_AT_data_member_location: 148
 <2><abf>: Abbrev Number: 0
 <1><ac0>: Abbrev Number: 11 (DW_TAG_typedef)
    <ac1>   DW_AT_name        : (indirect string, offset: 0xe8a7e): RCC_TypeDef
    <ac5>   DW_AT_decl_file   : 4
    <ac6>   DW_AT_decl_line   : 725
    <ac8>   DW_AT_decl_column : 3
    <ac9>   DW_AT_type        : <0x8ee>
 <1><acd>: Abbrev Number: 2 (DW_TAG_base_type)
    <ace>   DW_AT_byte_size   : 8
    <acf>   DW_AT_encoding    : 4	(float)
    <ad0>   DW_AT_name        : (indirect string, offset: 0xee3e4): long double
 <1><ad4>: Abbrev Number: 12 (DW_TAG_array_type)
    <ad5>   DW_AT_type        : <0x8d8>
    <ad9>   DW_AT_sibling     : <0xae4>
 <2><add>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <ade>   DW_AT_type        : <0x8c5>
    <ae2>   DW_AT_upper_bound : 6
 <2><ae3>: Abbrev Number: 0
 <1><ae4>: Abbrev Number: 5 (DW_TAG_const_type)
    <ae5>   DW_AT_type        : <0xad4>
 <1><ae9>: Abbrev Number: 4 (DW_TAG_variable)
    <aea>   DW_AT_name        : (indirect string, offset: 0x2d6ad): CHANNEL_OFFSET_TAB
    <aee>   DW_AT_decl_file   : 5
    <aef>   DW_AT_decl_line   : 49
    <af0>   DW_AT_decl_column : 22
    <af1>   DW_AT_type        : <0xae4>
    <af5>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><afb>: Abbrev Number: 14 (DW_TAG_subprogram)
    <afc>   DW_AT_external    : 1
    <afc>   DW_AT_name        : (indirect string, offset: 0xe8cd0): HAL_MspInit
    <b00>   DW_AT_decl_file   : 1
    <b01>   DW_AT_decl_line   : 64
    <b02>   DW_AT_decl_column : 6
    <b03>   DW_AT_prototyped  : 1
    <b03>   DW_AT_low_pc      : 0x8000738
    <b07>   DW_AT_high_pc     : 0x48
    <b0b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b0d>   DW_AT_call_all_calls: 1
 <2><b0d>: Abbrev Number: 15 (DW_TAG_lexical_block)
    <b0e>   DW_AT_low_pc      : 0x800073e
    <b12>   DW_AT_high_pc     : 0x18
    <b16>   DW_AT_sibling     : <0xb2a>
 <3><b1a>: Abbrev Number: 4 (DW_TAG_variable)
    <b1b>   DW_AT_name        : (indirect string, offset: 0xe8cdc): tmpreg
    <b1f>   DW_AT_decl_file   : 1
    <b20>   DW_AT_decl_line   : 71
    <b21>   DW_AT_decl_column : 3
    <b22>   DW_AT_type        : <0x8e9>
    <b26>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><b29>: Abbrev Number: 0
 <2><b2a>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <b2b>   DW_AT_low_pc      : 0x8000756
    <b2f>   DW_AT_high_pc     : 0x18
 <3><b33>: Abbrev Number: 4 (DW_TAG_variable)
    <b34>   DW_AT_name        : (indirect string, offset: 0xe8cdc): tmpreg
    <b38>   DW_AT_decl_file   : 1
    <b39>   DW_AT_decl_line   : 72
    <b3a>   DW_AT_decl_column : 3
    <b3b>   DW_AT_type        : <0x8e9>
    <b3f>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><b42>: Abbrev Number: 0
 <2><b43>: Abbrev Number: 0
 <1><b44>: Abbrev Number: 0
  Compilation Unit @ offset 0xb45:
   Length:        0x118 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x3ea
   Pointer Size:  4
 <0><b51>: Abbrev Number: 5 (DW_TAG_compile_unit)
    <b52>   DW_AT_producer    : (indirect string, offset: 0x3c767): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <b56>   DW_AT_language    : 29	(C11)
    <b57>   DW_AT_name        : (indirect string, offset: 0xe8d33): ../Core/Src/stm32l4xx_it.c
    <b5b>   DW_AT_comp_dir    : (indirect string, offset: 0x7fb10): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <b5f>   DW_AT_ranges      : 0x6b
    <b63>   DW_AT_low_pc      : 0
    <b67>   DW_AT_stmt_list   : 0x177c
    <b6b>   DW_AT_macros      : 0x25239
 <1><b6f>: Abbrev Number: 1 (DW_TAG_base_type)
    <b70>   DW_AT_byte_size   : 1
    <b71>   DW_AT_encoding    : 6	(signed char)
    <b72>   DW_AT_name        : (indirect string, offset: 0x751ec): signed char
 <1><b76>: Abbrev Number: 3 (DW_TAG_typedef)
    <b77>   DW_AT_name        : (indirect string, offset: 0x4354d): __uint8_t
    <b7b>   DW_AT_decl_file   : 2
    <b7c>   DW_AT_decl_line   : 43
    <b7d>   DW_AT_decl_column : 24
    <b7e>   DW_AT_type        : <0xb82>
 <1><b82>: Abbrev Number: 1 (DW_TAG_base_type)
    <b83>   DW_AT_byte_size   : 1
    <b84>   DW_AT_encoding    : 8	(unsigned char)
    <b85>   DW_AT_name        : (indirect string, offset: 0xdfda1): unsigned char
 <1><b89>: Abbrev Number: 1 (DW_TAG_base_type)
    <b8a>   DW_AT_byte_size   : 2
    <b8b>   DW_AT_encoding    : 5	(signed)
    <b8c>   DW_AT_name        : (indirect string, offset: 0xac250): short int
 <1><b90>: Abbrev Number: 1 (DW_TAG_base_type)
    <b91>   DW_AT_byte_size   : 2
    <b92>   DW_AT_encoding    : 7	(unsigned)
    <b93>   DW_AT_name        : (indirect string, offset: 0xde34b): short unsigned int
 <1><b97>: Abbrev Number: 1 (DW_TAG_base_type)
    <b98>   DW_AT_byte_size   : 4
    <b99>   DW_AT_encoding    : 5	(signed)
    <b9a>   DW_AT_name        : (indirect string, offset: 0x135b8): long int
 <1><b9e>: Abbrev Number: 1 (DW_TAG_base_type)
    <b9f>   DW_AT_byte_size   : 4
    <ba0>   DW_AT_encoding    : 7	(unsigned)
    <ba1>   DW_AT_name        : (indirect string, offset: 0x58285): long unsigned int
 <1><ba5>: Abbrev Number: 1 (DW_TAG_base_type)
    <ba6>   DW_AT_byte_size   : 8
    <ba7>   DW_AT_encoding    : 5	(signed)
    <ba8>   DW_AT_name        : (indirect string, offset: 0x69985): long long int
 <1><bac>: Abbrev Number: 1 (DW_TAG_base_type)
    <bad>   DW_AT_byte_size   : 8
    <bae>   DW_AT_encoding    : 7	(unsigned)
    <baf>   DW_AT_name        : (indirect string, offset: 0x3004c): long long unsigned int
 <1><bb3>: Abbrev Number: 6 (DW_TAG_base_type)
    <bb4>   DW_AT_byte_size   : 4
    <bb5>   DW_AT_encoding    : 5	(signed)
    <bb6>   DW_AT_name        : int
 <1><bba>: Abbrev Number: 1 (DW_TAG_base_type)
    <bbb>   DW_AT_byte_size   : 4
    <bbc>   DW_AT_encoding    : 7	(unsigned)
    <bbd>   DW_AT_name        : (indirect string, offset: 0x12ac1): unsigned int
 <1><bc1>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc2>   DW_AT_name        : (indirect string, offset: 0x4354f): uint8_t
    <bc6>   DW_AT_decl_file   : 3
    <bc7>   DW_AT_decl_line   : 24
    <bc8>   DW_AT_decl_column : 19
    <bc9>   DW_AT_type        : <0xb76>
 <1><bcd>: Abbrev Number: 4 (DW_TAG_const_type)
    <bce>   DW_AT_type        : <0xbc1>
 <1><bd2>: Abbrev Number: 1 (DW_TAG_base_type)
    <bd3>   DW_AT_byte_size   : 8
    <bd4>   DW_AT_encoding    : 4	(float)
    <bd5>   DW_AT_name        : (indirect string, offset: 0xee3e4): long double
 <1><bd9>: Abbrev Number: 7 (DW_TAG_array_type)
    <bda>   DW_AT_type        : <0xbcd>
    <bde>   DW_AT_sibling     : <0xbe9>
 <2><be2>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <be3>   DW_AT_type        : <0xbba>
    <be7>   DW_AT_upper_bound : 6
 <2><be8>: Abbrev Number: 0
 <1><be9>: Abbrev Number: 4 (DW_TAG_const_type)
    <bea>   DW_AT_type        : <0xbd9>
 <1><bee>: Abbrev Number: 9 (DW_TAG_variable)
    <bef>   DW_AT_name        : (indirect string, offset: 0x2d6ad): CHANNEL_OFFSET_TAB
    <bf3>   DW_AT_decl_file   : 4
    <bf4>   DW_AT_decl_line   : 49
    <bf5>   DW_AT_decl_column : 22
    <bf6>   DW_AT_type        : <0xbe9>
    <bfa>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><c00>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c01>   DW_AT_external    : 1
    <c01>   DW_AT_name        : (indirect string, offset: 0xe8d22): DebugMon_Handler
    <c05>   DW_AT_decl_file   : 1
    <c05>   DW_AT_decl_line   : 159
    <c06>   DW_AT_decl_column : 6
    <c06>   DW_AT_prototyped  : 1
    <c06>   DW_AT_low_pc      : 0x80007a8
    <c0a>   DW_AT_high_pc     : 0xe
    <c0e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c10>   DW_AT_call_all_calls: 1
 <1><c10>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c11>   DW_AT_external    : 1
    <c11>   DW_AT_name        : (indirect string, offset: 0xe8d0f): UsageFault_Handler
    <c15>   DW_AT_decl_file   : 1
    <c15>   DW_AT_decl_line   : 129
    <c16>   DW_AT_decl_column : 6
    <c16>   DW_AT_prototyped  : 1
    <c16>   DW_AT_low_pc      : 0x80007a0
    <c1a>   DW_AT_high_pc     : 0x8
    <c1e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c20>   DW_AT_call_all_calls: 1
 <1><c20>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c21>   DW_AT_external    : 1
    <c21>   DW_AT_name        : (indirect string, offset: 0xe8d60): BusFault_Handler
    <c25>   DW_AT_decl_file   : 1
    <c25>   DW_AT_decl_line   : 114
    <c26>   DW_AT_decl_column : 6
    <c26>   DW_AT_prototyped  : 1
    <c26>   DW_AT_low_pc      : 0x8000798
    <c2a>   DW_AT_high_pc     : 0x8
    <c2e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c30>   DW_AT_call_all_calls: 1
 <1><c30>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c31>   DW_AT_external    : 1
    <c31>   DW_AT_name        : (indirect string, offset: 0xe8d83): MemManage_Handler
    <c35>   DW_AT_decl_file   : 1
    <c35>   DW_AT_decl_line   : 99
    <c36>   DW_AT_decl_column : 6
    <c36>   DW_AT_prototyped  : 1
    <c36>   DW_AT_low_pc      : 0x8000790
    <c3a>   DW_AT_high_pc     : 0x8
    <c3e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c40>   DW_AT_call_all_calls: 1
 <1><c40>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c41>   DW_AT_external    : 1
    <c41>   DW_AT_name        : (indirect string, offset: 0xe8d4e): HardFault_Handler
    <c45>   DW_AT_decl_file   : 1
    <c45>   DW_AT_decl_line   : 84
    <c46>   DW_AT_decl_column : 6
    <c46>   DW_AT_prototyped  : 1
    <c46>   DW_AT_low_pc      : 0x8000788
    <c4a>   DW_AT_high_pc     : 0x8
    <c4e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c50>   DW_AT_call_all_calls: 1
 <1><c50>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c51>   DW_AT_external    : 1
    <c51>   DW_AT_name        : (indirect string, offset: 0xe8d03): NMI_Handler
    <c55>   DW_AT_decl_file   : 1
    <c55>   DW_AT_decl_line   : 69
    <c56>   DW_AT_decl_column : 6
    <c56>   DW_AT_prototyped  : 1
    <c56>   DW_AT_low_pc      : 0x8000780
    <c5a>   DW_AT_high_pc     : 0x8
    <c5e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c60>   DW_AT_call_all_calls: 1
 <1><c60>: Abbrev Number: 0
  Compilation Unit @ offset 0xc61:
   Length:        0x5de (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x46a
   Pointer Size:  4
 <0><c6d>: Abbrev Number: 14 (DW_TAG_compile_unit)
    <c6e>   DW_AT_producer    : (indirect string, offset: 0x3c767): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <c72>   DW_AT_language    : 29	(C11)
    <c73>   DW_AT_name        : (indirect string, offset: 0xe8d95): ../Core/Src/system_stm32l4xx.c
    <c77>   DW_AT_comp_dir    : (indirect string, offset: 0x7fb10): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <c7b>   DW_AT_ranges      : 0x9c
    <c7f>   DW_AT_low_pc      : 0
    <c83>   DW_AT_stmt_list   : 0x1f02
    <c87>   DW_AT_macros      : 0x253f4
 <1><c8b>: Abbrev Number: 2 (DW_TAG_base_type)
    <c8c>   DW_AT_byte_size   : 1
    <c8d>   DW_AT_encoding    : 6	(signed char)
    <c8e>   DW_AT_name        : (indirect string, offset: 0x751ec): signed char
 <1><c92>: Abbrev Number: 9 (DW_TAG_typedef)
    <c93>   DW_AT_name        : (indirect string, offset: 0x4354d): __uint8_t
    <c97>   DW_AT_decl_file   : 2
    <c98>   DW_AT_decl_line   : 43
    <c99>   DW_AT_decl_column : 24
    <c9a>   DW_AT_type        : <0xc9e>
 <1><c9e>: Abbrev Number: 2 (DW_TAG_base_type)
    <c9f>   DW_AT_byte_size   : 1
    <ca0>   DW_AT_encoding    : 8	(unsigned char)
    <ca1>   DW_AT_name        : (indirect string, offset: 0xdfda1): unsigned char
 <1><ca5>: Abbrev Number: 2 (DW_TAG_base_type)
    <ca6>   DW_AT_byte_size   : 2
    <ca7>   DW_AT_encoding    : 5	(signed)
    <ca8>   DW_AT_name        : (indirect string, offset: 0xac250): short int
 <1><cac>: Abbrev Number: 2 (DW_TAG_base_type)
    <cad>   DW_AT_byte_size   : 2
    <cae>   DW_AT_encoding    : 7	(unsigned)
    <caf>   DW_AT_name        : (indirect string, offset: 0xde34b): short unsigned int
 <1><cb3>: Abbrev Number: 2 (DW_TAG_base_type)
    <cb4>   DW_AT_byte_size   : 4
    <cb5>   DW_AT_encoding    : 5	(signed)
    <cb6>   DW_AT_name        : (indirect string, offset: 0x135b8): long int
 <1><cba>: Abbrev Number: 9 (DW_TAG_typedef)
    <cbb>   DW_AT_name        : (indirect string, offset: 0xe8b4d): __uint32_t
    <cbf>   DW_AT_decl_file   : 2
    <cc0>   DW_AT_decl_line   : 79
    <cc1>   DW_AT_decl_column : 25
    <cc2>   DW_AT_type        : <0xcc6>
 <1><cc6>: Abbrev Number: 2 (DW_TAG_base_type)
    <cc7>   DW_AT_byte_size   : 4
    <cc8>   DW_AT_encoding    : 7	(unsigned)
    <cc9>   DW_AT_name        : (indirect string, offset: 0x58285): long unsigned int
 <1><ccd>: Abbrev Number: 2 (DW_TAG_base_type)
    <cce>   DW_AT_byte_size   : 8
    <ccf>   DW_AT_encoding    : 5	(signed)
    <cd0>   DW_AT_name        : (indirect string, offset: 0x69985): long long int
 <1><cd4>: Abbrev Number: 2 (DW_TAG_base_type)
    <cd5>   DW_AT_byte_size   : 8
    <cd6>   DW_AT_encoding    : 7	(unsigned)
    <cd7>   DW_AT_name        : (indirect string, offset: 0x3004c): long long unsigned int
 <1><cdb>: Abbrev Number: 15 (DW_TAG_base_type)
    <cdc>   DW_AT_byte_size   : 4
    <cdd>   DW_AT_encoding    : 5	(signed)
    <cde>   DW_AT_name        : int
 <1><ce2>: Abbrev Number: 2 (DW_TAG_base_type)
    <ce3>   DW_AT_byte_size   : 4
    <ce4>   DW_AT_encoding    : 7	(unsigned)
    <ce5>   DW_AT_name        : (indirect string, offset: 0x12ac1): unsigned int
 <1><ce9>: Abbrev Number: 9 (DW_TAG_typedef)
    <cea>   DW_AT_name        : (indirect string, offset: 0x4354f): uint8_t
    <cee>   DW_AT_decl_file   : 3
    <cef>   DW_AT_decl_line   : 24
    <cf0>   DW_AT_decl_column : 19
    <cf1>   DW_AT_type        : <0xc92>
 <1><cf5>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <cf6>   DW_AT_type        : <0xce9>
 <1><cfa>: Abbrev Number: 3 (DW_TAG_const_type)
    <cfb>   DW_AT_type        : <0xce9>
 <1><cff>: Abbrev Number: 9 (DW_TAG_typedef)
    <d00>   DW_AT_name        : (indirect string, offset: 0xa82d1): uint32_t
    <d04>   DW_AT_decl_file   : 3
    <d05>   DW_AT_decl_line   : 48
    <d06>   DW_AT_decl_column : 20
    <d07>   DW_AT_type        : <0xcba>
 <1><d0b>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <d0c>   DW_AT_type        : <0xcff>
 <1><d10>: Abbrev Number: 3 (DW_TAG_const_type)
    <d11>   DW_AT_type        : <0xd0b>
 <1><d15>: Abbrev Number: 3 (DW_TAG_const_type)
    <d16>   DW_AT_type        : <0xcff>
 <1><d1a>: Abbrev Number: 12 (DW_TAG_structure_type)
    <d1b>   DW_AT_byte_size   : 140
    <d1c>   DW_AT_decl_file   : 4
    <d1d>   DW_AT_decl_line   : 440
    <d1f>   DW_AT_decl_column : 9
    <d1f>   DW_AT_sibling     : <0xe4a>
 <2><d23>: Abbrev Number: 1 (DW_TAG_member)
    <d24>   DW_AT_name        : (indirect string, offset: 0xe8dcd): CPUID
    <d28>   DW_AT_decl_file   : 4
    <d29>   DW_AT_decl_line   : 442
    <d2b>   DW_AT_decl_column : 18
    <d2c>   DW_AT_type        : <0xd10>
    <d30>   DW_AT_data_member_location: 0
 <2><d31>: Abbrev Number: 1 (DW_TAG_member)
    <d32>   DW_AT_name        : (indirect string, offset: 0xe8dc8): ICSR
    <d36>   DW_AT_decl_file   : 4
    <d37>   DW_AT_decl_line   : 443
    <d39>   DW_AT_decl_column : 18
    <d3a>   DW_AT_type        : <0xd0b>
    <d3e>   DW_AT_data_member_location: 4
 <2><d3f>: Abbrev Number: 1 (DW_TAG_member)
    <d40>   DW_AT_name        : (indirect string, offset: 0xe8db4): VTOR
    <d44>   DW_AT_decl_file   : 4
    <d45>   DW_AT_decl_line   : 444
    <d47>   DW_AT_decl_column : 18
    <d48>   DW_AT_type        : <0xd0b>
    <d4c>   DW_AT_data_member_location: 8
 <2><d4d>: Abbrev Number: 1 (DW_TAG_member)
    <d4e>   DW_AT_name        : (indirect string, offset: 0xe8e81): AIRCR
    <d52>   DW_AT_decl_file   : 4
    <d53>   DW_AT_decl_line   : 445
    <d55>   DW_AT_decl_column : 18
    <d56>   DW_AT_type        : <0xd0b>
    <d5a>   DW_AT_data_member_location: 12
 <2><d5b>: Abbrev Number: 6 (DW_TAG_member)
    <d5c>   DW_AT_name        : SCR
    <d60>   DW_AT_decl_file   : 4
    <d61>   DW_AT_decl_line   : 446
    <d63>   DW_AT_decl_column : 18
    <d64>   DW_AT_type        : <0xd0b>
    <d68>   DW_AT_data_member_location: 16
 <2><d69>: Abbrev Number: 6 (DW_TAG_member)
    <d6a>   DW_AT_name        : CCR
    <d6e>   DW_AT_decl_file   : 4
    <d6f>   DW_AT_decl_line   : 447
    <d71>   DW_AT_decl_column : 18
    <d72>   DW_AT_type        : <0xd0b>
    <d76>   DW_AT_data_member_location: 20
 <2><d77>: Abbrev Number: 6 (DW_TAG_member)
    <d78>   DW_AT_name        : SHP
    <d7c>   DW_AT_decl_file   : 4
    <d7d>   DW_AT_decl_line   : 448
    <d7f>   DW_AT_decl_column : 18
    <d80>   DW_AT_type        : <0xe5a>
    <d84>   DW_AT_data_member_location: 24
 <2><d85>: Abbrev Number: 1 (DW_TAG_member)
    <d86>   DW_AT_name        : (indirect string, offset: 0xe8dfb): SHCSR
    <d8a>   DW_AT_decl_file   : 4
    <d8b>   DW_AT_decl_line   : 449
    <d8d>   DW_AT_decl_column : 18
    <d8e>   DW_AT_type        : <0xd0b>
    <d92>   DW_AT_data_member_location: 36
 <2><d93>: Abbrev Number: 1 (DW_TAG_member)
    <d94>   DW_AT_name        : (indirect string, offset: 0xe8e22): CFSR
    <d98>   DW_AT_decl_file   : 4
    <d99>   DW_AT_decl_line   : 450
    <d9b>   DW_AT_decl_column : 18
    <d9c>   DW_AT_type        : <0xd0b>
    <da0>   DW_AT_data_member_location: 40
 <2><da1>: Abbrev Number: 1 (DW_TAG_member)
    <da2>   DW_AT_name        : (indirect string, offset: 0xe8e01): HFSR
    <da6>   DW_AT_decl_file   : 4
    <da7>   DW_AT_decl_line   : 451
    <da9>   DW_AT_decl_column : 18
    <daa>   DW_AT_type        : <0xd0b>
    <dae>   DW_AT_data_member_location: 44
 <2><daf>: Abbrev Number: 1 (DW_TAG_member)
    <db0>   DW_AT_name        : (indirect string, offset: 0xe8e6e): DFSR
    <db4>   DW_AT_decl_file   : 4
    <db5>   DW_AT_decl_line   : 452
    <db7>   DW_AT_decl_column : 18
    <db8>   DW_AT_type        : <0xd0b>
    <dbc>   DW_AT_data_member_location: 48
 <2><dbd>: Abbrev Number: 1 (DW_TAG_member)
    <dbe>   DW_AT_name        : (indirect string, offset: 0xe8df0): MMFAR
    <dc2>   DW_AT_decl_file   : 4
    <dc3>   DW_AT_decl_line   : 453
    <dc5>   DW_AT_decl_column : 18
    <dc6>   DW_AT_type        : <0xd0b>
    <dca>   DW_AT_data_member_location: 52
 <2><dcb>: Abbrev Number: 1 (DW_TAG_member)
    <dcc>   DW_AT_name        : (indirect string, offset: 0xe8deb): BFAR
    <dd0>   DW_AT_decl_file   : 4
    <dd1>   DW_AT_decl_line   : 454
    <dd3>   DW_AT_decl_column : 18
    <dd4>   DW_AT_type        : <0xd0b>
    <dd8>   DW_AT_data_member_location: 56
 <2><dd9>: Abbrev Number: 1 (DW_TAG_member)
    <dda>   DW_AT_name        : (indirect string, offset: 0xe8dc3): AFSR
    <dde>   DW_AT_decl_file   : 4
    <ddf>   DW_AT_decl_line   : 455
    <de1>   DW_AT_decl_column : 18
    <de2>   DW_AT_type        : <0xd0b>
    <de6>   DW_AT_data_member_location: 60
 <2><de7>: Abbrev Number: 6 (DW_TAG_member)
    <de8>   DW_AT_name        : PFR
    <dec>   DW_AT_decl_file   : 4
    <ded>   DW_AT_decl_line   : 456
    <def>   DW_AT_decl_column : 18
    <df0>   DW_AT_type        : <0xe74>
    <df4>   DW_AT_data_member_location: 64
 <2><df5>: Abbrev Number: 6 (DW_TAG_member)
    <df6>   DW_AT_name        : DFR
    <dfa>   DW_AT_decl_file   : 4
    <dfb>   DW_AT_decl_line   : 457
    <dfd>   DW_AT_decl_column : 18
    <dfe>   DW_AT_type        : <0xd10>
    <e02>   DW_AT_data_member_location: 72
 <2><e03>: Abbrev Number: 6 (DW_TAG_member)
    <e04>   DW_AT_name        : ADR
    <e08>   DW_AT_decl_file   : 4
    <e09>   DW_AT_decl_line   : 458
    <e0b>   DW_AT_decl_column : 18
    <e0c>   DW_AT_type        : <0xd10>
    <e10>   DW_AT_data_member_location: 76
 <2><e11>: Abbrev Number: 1 (DW_TAG_member)
    <e12>   DW_AT_name        : (indirect string, offset: 0xe8de6): MMFR
    <e16>   DW_AT_decl_file   : 4
    <e17>   DW_AT_decl_line   : 459
    <e19>   DW_AT_decl_column : 18
    <e1a>   DW_AT_type        : <0xe8e>
    <e1e>   DW_AT_data_member_location: 80
 <2><e1f>: Abbrev Number: 1 (DW_TAG_member)
    <e20>   DW_AT_name        : (indirect string, offset: 0xe8df6): ISAR
    <e24>   DW_AT_decl_file   : 4
    <e25>   DW_AT_decl_line   : 460
    <e27>   DW_AT_decl_column : 18
    <e28>   DW_AT_type        : <0xea8>
    <e2c>   DW_AT_data_member_location: 96
 <2><e2d>: Abbrev Number: 1 (DW_TAG_member)
    <e2e>   DW_AT_name        : (indirect string, offset: 0xe8c64): RESERVED0
    <e32>   DW_AT_decl_file   : 4
    <e33>   DW_AT_decl_line   : 461
    <e35>   DW_AT_decl_column : 18
    <e36>   DW_AT_type        : <0xead>
    <e3a>   DW_AT_data_member_location: 116
 <2><e3b>: Abbrev Number: 1 (DW_TAG_member)
    <e3c>   DW_AT_name        : (indirect string, offset: 0xe8e1c): CPACR
    <e40>   DW_AT_decl_file   : 4
    <e41>   DW_AT_decl_line   : 462
    <e43>   DW_AT_decl_column : 18
    <e44>   DW_AT_type        : <0xd0b>
    <e48>   DW_AT_data_member_location: 136
 <2><e49>: Abbrev Number: 0
 <1><e4a>: Abbrev Number: 4 (DW_TAG_array_type)
    <e4b>   DW_AT_type        : <0xcf5>
    <e4f>   DW_AT_sibling     : <0xe5a>
 <2><e53>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <e54>   DW_AT_type        : <0xce2>
    <e58>   DW_AT_upper_bound : 11
 <2><e59>: Abbrev Number: 0
 <1><e5a>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <e5b>   DW_AT_type        : <0xe4a>
 <1><e5f>: Abbrev Number: 4 (DW_TAG_array_type)
    <e60>   DW_AT_type        : <0xd10>
    <e64>   DW_AT_sibling     : <0xe6f>
 <2><e68>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <e69>   DW_AT_type        : <0xce2>
    <e6d>   DW_AT_upper_bound : 1
 <2><e6e>: Abbrev Number: 0
 <1><e6f>: Abbrev Number: 3 (DW_TAG_const_type)
    <e70>   DW_AT_type        : <0xe5f>
 <1><e74>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <e75>   DW_AT_type        : <0xe6f>
 <1><e79>: Abbrev Number: 4 (DW_TAG_array_type)
    <e7a>   DW_AT_type        : <0xd10>
    <e7e>   DW_AT_sibling     : <0xe89>
 <2><e82>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <e83>   DW_AT_type        : <0xce2>
    <e87>   DW_AT_upper_bound : 3
 <2><e88>: Abbrev Number: 0
 <1><e89>: Abbrev Number: 3 (DW_TAG_const_type)
    <e8a>   DW_AT_type        : <0xe79>
 <1><e8e>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <e8f>   DW_AT_type        : <0xe89>
 <1><e93>: Abbrev Number: 4 (DW_TAG_array_type)
    <e94>   DW_AT_type        : <0xd10>
    <e98>   DW_AT_sibling     : <0xea3>
 <2><e9c>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <e9d>   DW_AT_type        : <0xce2>
    <ea1>   DW_AT_upper_bound : 4
 <2><ea2>: Abbrev Number: 0
 <1><ea3>: Abbrev Number: 3 (DW_TAG_const_type)
    <ea4>   DW_AT_type        : <0xe93>
 <1><ea8>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <ea9>   DW_AT_type        : <0xea3>
 <1><ead>: Abbrev Number: 4 (DW_TAG_array_type)
    <eae>   DW_AT_type        : <0xcff>
    <eb2>   DW_AT_sibling     : <0xebd>
 <2><eb6>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <eb7>   DW_AT_type        : <0xce2>
    <ebb>   DW_AT_upper_bound : 4
 <2><ebc>: Abbrev Number: 0
 <1><ebd>: Abbrev Number: 13 (DW_TAG_typedef)
    <ebe>   DW_AT_name        : (indirect string, offset: 0xe8e3c): SCB_Type
    <ec2>   DW_AT_decl_file   : 4
    <ec3>   DW_AT_decl_line   : 463
    <ec5>   DW_AT_decl_column : 3
    <ec5>   DW_AT_type        : <0xd1a>
 <1><ec9>: Abbrev Number: 10 (DW_TAG_variable)
    <eca>   DW_AT_name        : (indirect string, offset: 0xe8e45): SystemCoreClock
    <ece>   DW_AT_decl_file   : 5
    <ece>   DW_AT_decl_line   : 57
    <ecf>   DW_AT_decl_column : 17
    <ed0>   DW_AT_type        : <0xcff>
    <ed4>   DW_AT_external    : 1
    <ed4>   DW_AT_declaration : 1
 <1><ed4>: Abbrev Number: 4 (DW_TAG_array_type)
    <ed5>   DW_AT_type        : <0xcfa>
    <ed9>   DW_AT_sibling     : <0xee4>
 <2><edd>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <ede>   DW_AT_type        : <0xce2>
    <ee2>   DW_AT_upper_bound : 15
 <2><ee3>: Abbrev Number: 0
 <1><ee4>: Abbrev Number: 3 (DW_TAG_const_type)
    <ee5>   DW_AT_type        : <0xed4>
 <1><ee9>: Abbrev Number: 10 (DW_TAG_variable)
    <eea>   DW_AT_name        : (indirect string, offset: 0xe8e73): AHBPrescTable
    <eee>   DW_AT_decl_file   : 5
    <eee>   DW_AT_decl_line   : 59
    <eef>   DW_AT_decl_column : 23
    <ef0>   DW_AT_type        : <0xee4>
    <ef4>   DW_AT_external    : 1
    <ef4>   DW_AT_declaration : 1
 <1><ef4>: Abbrev Number: 4 (DW_TAG_array_type)
    <ef5>   DW_AT_type        : <0xcfa>
    <ef9>   DW_AT_sibling     : <0xf04>
 <2><efd>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <efe>   DW_AT_type        : <0xce2>
    <f02>   DW_AT_upper_bound : 7
 <2><f03>: Abbrev Number: 0
 <1><f04>: Abbrev Number: 3 (DW_TAG_const_type)
    <f05>   DW_AT_type        : <0xef4>
 <1><f09>: Abbrev Number: 10 (DW_TAG_variable)
    <f0a>   DW_AT_name        : (indirect string, offset: 0xe8e27): APBPrescTable
    <f0e>   DW_AT_decl_file   : 5
    <f0e>   DW_AT_decl_line   : 60
    <f0f>   DW_AT_decl_column : 23
    <f10>   DW_AT_type        : <0xf04>
    <f14>   DW_AT_external    : 1
    <f14>   DW_AT_declaration : 1
 <1><f14>: Abbrev Number: 4 (DW_TAG_array_type)
    <f15>   DW_AT_type        : <0xd15>
    <f19>   DW_AT_sibling     : <0xf24>
 <2><f1d>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <f1e>   DW_AT_type        : <0xce2>
    <f22>   DW_AT_upper_bound : 11
 <2><f23>: Abbrev Number: 0
 <1><f24>: Abbrev Number: 3 (DW_TAG_const_type)
    <f25>   DW_AT_type        : <0xf14>
 <1><f29>: Abbrev Number: 10 (DW_TAG_variable)
    <f2a>   DW_AT_name        : (indirect string, offset: 0xe8e60): MSIRangeTable
    <f2e>   DW_AT_decl_file   : 5
    <f2e>   DW_AT_decl_line   : 61
    <f2f>   DW_AT_decl_column : 23
    <f30>   DW_AT_type        : <0xf24>
    <f34>   DW_AT_external    : 1
    <f34>   DW_AT_declaration : 1
 <1><f34>: Abbrev Number: 12 (DW_TAG_structure_type)
    <f35>   DW_AT_byte_size   : 152
    <f36>   DW_AT_decl_file   : 6
    <f37>   DW_AT_decl_line   : 685
    <f39>   DW_AT_decl_column : 9
    <f39>   DW_AT_sibling     : <0x1151>
 <2><f3d>: Abbrev Number: 6 (DW_TAG_member)
    <f3e>   DW_AT_name        : CR
    <f41>   DW_AT_decl_file   : 6
    <f42>   DW_AT_decl_line   : 687
    <f44>   DW_AT_decl_column : 17
    <f45>   DW_AT_type        : <0xd0b>
    <f49>   DW_AT_data_member_location: 0
 <2><f4a>: Abbrev Number: 1 (DW_TAG_member)
    <f4b>   DW_AT_name        : (indirect string, offset: 0xe8ac3): ICSCR
    <f4f>   DW_AT_decl_file   : 6
    <f50>   DW_AT_decl_line   : 688
    <f52>   DW_AT_decl_column : 17
    <f53>   DW_AT_type        : <0xd0b>
    <f57>   DW_AT_data_member_location: 4
 <2><f58>: Abbrev Number: 1 (DW_TAG_member)
    <f59>   DW_AT_name        : (indirect string, offset: 0xe89ef): CFGR
    <f5d>   DW_AT_decl_file   : 6
    <f5e>   DW_AT_decl_line   : 689
    <f60>   DW_AT_decl_column : 17
    <f61>   DW_AT_type        : <0xd0b>
    <f65>   DW_AT_data_member_location: 8
 <2><f66>: Abbrev Number: 1 (DW_TAG_member)
    <f67>   DW_AT_name        : (indirect string, offset: 0xe8b9d): PLLCFGR
    <f6b>   DW_AT_decl_file   : 6
    <f6c>   DW_AT_decl_line   : 690
    <f6e>   DW_AT_decl_column : 17
    <f6f>   DW_AT_type        : <0xd0b>
    <f73>   DW_AT_data_member_location: 12
 <2><f74>: Abbrev Number: 1 (DW_TAG_member)
    <f75>   DW_AT_name        : (indirect string, offset: 0xe89e8): PLLSAI1CFGR
    <f79>   DW_AT_decl_file   : 6
    <f7a>   DW_AT_decl_line   : 691
    <f7c>   DW_AT_decl_column : 17
    <f7d>   DW_AT_type        : <0xd0b>
    <f81>   DW_AT_data_member_location: 16
 <2><f82>: Abbrev Number: 1 (DW_TAG_member)
    <f83>   DW_AT_name        : (indirect string, offset: 0xe8b63): PLLSAI2CFGR
    <f87>   DW_AT_decl_file   : 6
    <f88>   DW_AT_decl_line   : 692
    <f8a>   DW_AT_decl_column : 17
    <f8b>   DW_AT_type        : <0xd0b>
    <f8f>   DW_AT_data_member_location: 20
 <2><f90>: Abbrev Number: 1 (DW_TAG_member)
    <f91>   DW_AT_name        : (indirect string, offset: 0xe88c5): CIER
    <f95>   DW_AT_decl_file   : 6
    <f96>   DW_AT_decl_line   : 693
    <f98>   DW_AT_decl_column : 17
    <f99>   DW_AT_type        : <0xd0b>
    <f9d>   DW_AT_data_member_location: 24
 <2><f9e>: Abbrev Number: 1 (DW_TAG_member)
    <f9f>   DW_AT_name        : (indirect string, offset: 0xe88c0): CIFR
    <fa3>   DW_AT_decl_file   : 6
    <fa4>   DW_AT_decl_line   : 694
    <fa6>   DW_AT_decl_column : 17
    <fa7>   DW_AT_type        : <0xd0b>
    <fab>   DW_AT_data_member_location: 28
 <2><fac>: Abbrev Number: 1 (DW_TAG_member)
    <fad>   DW_AT_name        : (indirect string, offset: 0xe88b6): CICR
    <fb1>   DW_AT_decl_file   : 6
    <fb2>   DW_AT_decl_line   : 695
    <fb4>   DW_AT_decl_column : 17
    <fb5>   DW_AT_type        : <0xd0b>
    <fb9>   DW_AT_data_member_location: 32
 <2><fba>: Abbrev Number: 1 (DW_TAG_member)
    <fbb>   DW_AT_name        : (indirect string, offset: 0xe8c64): RESERVED0
    <fbf>   DW_AT_decl_file   : 6
    <fc0>   DW_AT_decl_line   : 696
    <fc2>   DW_AT_decl_column : 17
    <fc3>   DW_AT_type        : <0xcff>
    <fc7>   DW_AT_data_member_location: 36
 <2><fc8>: Abbrev Number: 1 (DW_TAG_member)
    <fc9>   DW_AT_name        : (indirect string, offset: 0xe8bc1): AHB1RSTR
    <fcd>   DW_AT_decl_file   : 6
    <fce>   DW_AT_decl_line   : 697
    <fd0>   DW_AT_decl_column : 17
    <fd1>   DW_AT_type        : <0xd0b>
    <fd5>   DW_AT_data_member_location: 40
 <2><fd6>: Abbrev Number: 1 (DW_TAG_member)
    <fd7>   DW_AT_name        : (indirect string, offset: 0xe890c): AHB2RSTR
    <fdb>   DW_AT_decl_file   : 6
    <fdc>   DW_AT_decl_line   : 698
    <fde>   DW_AT_decl_column : 17
    <fdf>   DW_AT_type        : <0xd0b>
    <fe3>   DW_AT_data_member_location: 44
 <2><fe4>: Abbrev Number: 1 (DW_TAG_member)
    <fe5>   DW_AT_name        : (indirect string, offset: 0xe89df): AHB3RSTR
    <fe9>   DW_AT_decl_file   : 6
    <fea>   DW_AT_decl_line   : 699
    <fec>   DW_AT_decl_column : 17
    <fed>   DW_AT_type        : <0xd0b>
    <ff1>   DW_AT_data_member_location: 48
 <2><ff2>: Abbrev Number: 1 (DW_TAG_member)
    <ff3>   DW_AT_name        : (indirect string, offset: 0xe8c6e): RESERVED1
    <ff7>   DW_AT_decl_file   : 6
    <ff8>   DW_AT_decl_line   : 700
    <ffa>   DW_AT_decl_column : 17
    <ffb>   DW_AT_type        : <0xcff>
    <fff>   DW_AT_data_member_location: 52
 <2><1000>: Abbrev Number: 1 (DW_TAG_member)
    <1001>   DW_AT_name        : (indirect string, offset: 0xe8955): APB1RSTR1
    <1005>   DW_AT_decl_file   : 6
    <1006>   DW_AT_decl_line   : 701
    <1008>   DW_AT_decl_column : 17
    <1009>   DW_AT_type        : <0xd0b>
    <100d>   DW_AT_data_member_location: 56
 <2><100e>: Abbrev Number: 1 (DW_TAG_member)
    <100f>   DW_AT_name        : (indirect string, offset: 0xe895f): APB1RSTR2
    <1013>   DW_AT_decl_file   : 6
    <1014>   DW_AT_decl_line   : 702
    <1016>   DW_AT_decl_column : 17
    <1017>   DW_AT_type        : <0xd0b>
    <101b>   DW_AT_data_member_location: 60
 <2><101c>: Abbrev Number: 1 (DW_TAG_member)
    <101d>   DW_AT_name        : (indirect string, offset: 0xe8a32): APB2RSTR
    <1021>   DW_AT_decl_file   : 6
    <1022>   DW_AT_decl_line   : 703
    <1024>   DW_AT_decl_column : 17
    <1025>   DW_AT_type        : <0xd0b>
    <1029>   DW_AT_data_member_location: 64
 <2><102a>: Abbrev Number: 1 (DW_TAG_member)
    <102b>   DW_AT_name        : (indirect string, offset: 0xe8c78): RESERVED2
    <102f>   DW_AT_decl_file   : 6
    <1030>   DW_AT_decl_line   : 704
    <1032>   DW_AT_decl_column : 17
    <1033>   DW_AT_type        : <0xcff>
    <1037>   DW_AT_data_member_location: 68
 <2><1038>: Abbrev Number: 1 (DW_TAG_member)
    <1039>   DW_AT_name        : (indirect string, offset: 0xe88ff): AHB1ENR
    <103d>   DW_AT_decl_file   : 6
    <103e>   DW_AT_decl_line   : 705
    <1040>   DW_AT_decl_column : 17
    <1041>   DW_AT_type        : <0xd0b>
    <1045>   DW_AT_data_member_location: 72
 <2><1046>: Abbrev Number: 1 (DW_TAG_member)
    <1047>   DW_AT_name        : (indirect string, offset: 0xe8994): AHB2ENR
    <104b>   DW_AT_decl_file   : 6
    <104c>   DW_AT_decl_line   : 706
    <104e>   DW_AT_decl_column : 17
    <104f>   DW_AT_type        : <0xd0b>
    <1053>   DW_AT_data_member_location: 76
 <2><1054>: Abbrev Number: 1 (DW_TAG_member)
    <1055>   DW_AT_name        : (indirect string, offset: 0xe8a52): AHB3ENR
    <1059>   DW_AT_decl_file   : 6
    <105a>   DW_AT_decl_line   : 707
    <105c>   DW_AT_decl_column : 17
    <105d>   DW_AT_type        : <0xd0b>
    <1061>   DW_AT_data_member_location: 80
 <2><1062>: Abbrev Number: 1 (DW_TAG_member)
    <1063>   DW_AT_name        : (indirect string, offset: 0xe8c82): RESERVED3
    <1067>   DW_AT_decl_file   : 6
    <1068>   DW_AT_decl_line   : 708
    <106a>   DW_AT_decl_column : 17
    <106b>   DW_AT_type        : <0xcff>
    <106f>   DW_AT_data_member_location: 84
 <2><1070>: Abbrev Number: 1 (DW_TAG_member)
    <1071>   DW_AT_name        : (indirect string, offset: 0xe88ca): APB1ENR1
    <1075>   DW_AT_decl_file   : 6
    <1076>   DW_AT_decl_line   : 709
    <1078>   DW_AT_decl_column : 17
    <1079>   DW_AT_type        : <0xd0b>
    <107d>   DW_AT_data_member_location: 88
 <2><107e>: Abbrev Number: 1 (DW_TAG_member)
    <107f>   DW_AT_name        : (indirect string, offset: 0xe88d3): APB1ENR2
    <1083>   DW_AT_decl_file   : 6
    <1084>   DW_AT_decl_line   : 710
    <1086>   DW_AT_decl_column : 17
    <1087>   DW_AT_type        : <0xd0b>
    <108b>   DW_AT_data_member_location: 92
 <2><108c>: Abbrev Number: 1 (DW_TAG_member)
    <108d>   DW_AT_name        : (indirect string, offset: 0xe8915): APB2ENR
    <1091>   DW_AT_decl_file   : 6
    <1092>   DW_AT_decl_line   : 711
    <1094>   DW_AT_decl_column : 17
    <1095>   DW_AT_type        : <0xd0b>
    <1099>   DW_AT_data_member_location: 96
 <2><109a>: Abbrev Number: 1 (DW_TAG_member)
    <109b>   DW_AT_name        : (indirect string, offset: 0xe8ae8): RESERVED4
    <109f>   DW_AT_decl_file   : 6
    <10a0>   DW_AT_decl_line   : 712
    <10a2>   DW_AT_decl_column : 17
    <10a3>   DW_AT_type        : <0xcff>
    <10a7>   DW_AT_data_member_location: 100
 <2><10a8>: Abbrev Number: 1 (DW_TAG_member)
    <10a9>   DW_AT_name        : (indirect string, offset: 0xe8a69): AHB1SMENR
    <10ad>   DW_AT_decl_file   : 6
    <10ae>   DW_AT_decl_line   : 713
    <10b0>   DW_AT_decl_column : 17
    <10b1>   DW_AT_type        : <0xd0b>
    <10b5>   DW_AT_data_member_location: 104
 <2><10b6>: Abbrev Number: 1 (DW_TAG_member)
    <10b7>   DW_AT_name        : (indirect string, offset: 0xe8c51): AHB2SMENR
    <10bb>   DW_AT_decl_file   : 6
    <10bc>   DW_AT_decl_line   : 714
    <10be>   DW_AT_decl_column : 17
    <10bf>   DW_AT_type        : <0xd0b>
    <10c3>   DW_AT_data_member_location: 108
 <2><10c4>: Abbrev Number: 1 (DW_TAG_member)
    <10c5>   DW_AT_name        : (indirect string, offset: 0xe8a0d): AHB3SMENR
    <10c9>   DW_AT_decl_file   : 6
    <10ca>   DW_AT_decl_line   : 715
    <10cc>   DW_AT_decl_column : 17
    <10cd>   DW_AT_type        : <0xd0b>
    <10d1>   DW_AT_data_member_location: 112
 <2><10d2>: Abbrev Number: 1 (DW_TAG_member)
    <10d3>   DW_AT_name        : (indirect string, offset: 0xe8c8c): RESERVED5
    <10d7>   DW_AT_decl_file   : 6
    <10d8>   DW_AT_decl_line   : 716
    <10da>   DW_AT_decl_column : 17
    <10db>   DW_AT_type        : <0xcff>
    <10df>   DW_AT_data_member_location: 116
 <2><10e0>: Abbrev Number: 1 (DW_TAG_member)
    <10e1>   DW_AT_name        : (indirect string, offset: 0xe88dc): APB1SMENR1
    <10e5>   DW_AT_decl_file   : 6
    <10e6>   DW_AT_decl_line   : 717
    <10e8>   DW_AT_decl_column : 17
    <10e9>   DW_AT_type        : <0xd0b>
    <10ed>   DW_AT_data_member_location: 120
 <2><10ee>: Abbrev Number: 1 (DW_TAG_member)
    <10ef>   DW_AT_name        : (indirect string, offset: 0xe88e7): APB1SMENR2
    <10f3>   DW_AT_decl_file   : 6
    <10f4>   DW_AT_decl_line   : 718
    <10f6>   DW_AT_decl_column : 17
    <10f7>   DW_AT_type        : <0xd0b>
    <10fb>   DW_AT_data_member_location: 124
 <2><10fc>: Abbrev Number: 1 (DW_TAG_member)
    <10fd>   DW_AT_name        : (indirect string, offset: 0xe8bb0): APB2SMENR
    <1101>   DW_AT_decl_file   : 6
    <1102>   DW_AT_decl_line   : 719
    <1104>   DW_AT_decl_column : 17
    <1105>   DW_AT_type        : <0xd0b>
    <1109>   DW_AT_data_member_location: 128
 <2><110a>: Abbrev Number: 1 (DW_TAG_member)
    <110b>   DW_AT_name        : (indirect string, offset: 0xe8af2): RESERVED6
    <110f>   DW_AT_decl_file   : 6
    <1110>   DW_AT_decl_line   : 720
    <1112>   DW_AT_decl_column : 17
    <1113>   DW_AT_type        : <0xcff>
    <1117>   DW_AT_data_member_location: 132
 <2><1118>: Abbrev Number: 1 (DW_TAG_member)
    <1119>   DW_AT_name        : (indirect string, offset: 0xe89bc): CCIPR
    <111d>   DW_AT_decl_file   : 6
    <111e>   DW_AT_decl_line   : 721
    <1120>   DW_AT_decl_column : 17
    <1121>   DW_AT_type        : <0xd0b>
    <1125>   DW_AT_data_member_location: 136
 <2><1126>: Abbrev Number: 1 (DW_TAG_member)
    <1127>   DW_AT_name        : (indirect string, offset: 0xe8c96): RESERVED7
    <112b>   DW_AT_decl_file   : 6
    <112c>   DW_AT_decl_line   : 722
    <112e>   DW_AT_decl_column : 17
    <112f>   DW_AT_type        : <0xcff>
    <1133>   DW_AT_data_member_location: 140
 <2><1134>: Abbrev Number: 1 (DW_TAG_member)
    <1135>   DW_AT_name        : (indirect string, offset: 0xe898f): BDCR
    <1139>   DW_AT_decl_file   : 6
    <113a>   DW_AT_decl_line   : 723
    <113c>   DW_AT_decl_column : 17
    <113d>   DW_AT_type        : <0xd0b>
    <1141>   DW_AT_data_member_location: 144
 <2><1142>: Abbrev Number: 6 (DW_TAG_member)
    <1143>   DW_AT_name        : CSR
    <1147>   DW_AT_decl_file   : 6
    <1148>   DW_AT_decl_line   : 724
    <114a>   DW_AT_decl_column : 17
    <114b>   DW_AT_type        : <0xd0b>
    <114f>   DW_AT_data_member_location: 148
 <2><1150>: Abbrev Number: 0
 <1><1151>: Abbrev Number: 13 (DW_TAG_typedef)
    <1152>   DW_AT_name        : (indirect string, offset: 0xe8a7e): RCC_TypeDef
    <1156>   DW_AT_decl_file   : 6
    <1157>   DW_AT_decl_line   : 725
    <1159>   DW_AT_decl_column : 3
    <1159>   DW_AT_type        : <0xf34>
 <1><115d>: Abbrev Number: 2 (DW_TAG_base_type)
    <115e>   DW_AT_byte_size   : 8
    <115f>   DW_AT_encoding    : 4	(float)
    <1160>   DW_AT_name        : (indirect string, offset: 0xee3e4): long double
 <1><1164>: Abbrev Number: 4 (DW_TAG_array_type)
    <1165>   DW_AT_type        : <0xcfa>
    <1169>   DW_AT_sibling     : <0x1174>
 <2><116d>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <116e>   DW_AT_type        : <0xce2>
    <1172>   DW_AT_upper_bound : 6
 <2><1173>: Abbrev Number: 0
 <1><1174>: Abbrev Number: 3 (DW_TAG_const_type)
    <1175>   DW_AT_type        : <0x1164>
 <1><1179>: Abbrev Number: 8 (DW_TAG_variable)
    <117a>   DW_AT_name        : (indirect string, offset: 0x2d6ad): CHANNEL_OFFSET_TAB
    <117e>   DW_AT_decl_file   : 7
    <117f>   DW_AT_decl_line   : 49
    <1180>   DW_AT_decl_column : 22
    <1181>   DW_AT_type        : <0x1174>
    <1185>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><118b>: Abbrev Number: 11 (DW_TAG_variable)
    <118c>   DW_AT_specification: <0xec9>
    <1190>   DW_AT_decl_file   : 1
    <1190>   DW_AT_decl_line   : 172
    <1191>   DW_AT_decl_column : 12
    <1192>   DW_AT_location    : 5 byte block: 3 4 0 0 20 	(DW_OP_addr: 20000004)
 <1><1198>: Abbrev Number: 11 (DW_TAG_variable)
    <1199>   DW_AT_specification: <0xee9>
    <119d>   DW_AT_decl_file   : 1
