Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x4d3 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 11 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x299ef): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x9753d): ../Core/Src/Drivers/I2C.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x57523): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 3 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x4fce6): signed char
 <1><31>: Abbrev Number: 5 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x2e54f): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 3 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0x9827d): unsigned char
 <1><44>: Abbrev Number: 3 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x7583d): short int
 <1><4b>: Abbrev Number: 3 (DW_TAG_base_type)
    <4c>   DW_AT_byte_size   : 2
    <4d>   DW_AT_encoding    : 7	(unsigned)
    <4e>   DW_AT_name        : (indirect string, offset: 0x970ba): short unsigned int
 <1><52>: Abbrev Number: 3 (DW_TAG_base_type)
    <53>   DW_AT_byte_size   : 4
    <54>   DW_AT_encoding    : 5	(signed)
    <55>   DW_AT_name        : (indirect string, offset: 0xcd5a): long int
 <1><59>: Abbrev Number: 5 (DW_TAG_typedef)
    <5a>   DW_AT_name        : (indirect string, offset: 0x652d9): __uint32_t
    <5e>   DW_AT_decl_file   : 2
    <5f>   DW_AT_decl_line   : 79
    <60>   DW_AT_decl_column : 25
    <61>   DW_AT_type        : <0x65>
 <1><65>: Abbrev Number: 3 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 4
    <67>   DW_AT_encoding    : 7	(unsigned)
    <68>   DW_AT_name        : (indirect string, offset: 0x3ccb2): long unsigned int
 <1><6c>: Abbrev Number: 3 (DW_TAG_base_type)
    <6d>   DW_AT_byte_size   : 8
    <6e>   DW_AT_encoding    : 5	(signed)
    <6f>   DW_AT_name        : (indirect string, offset: 0x48957): long long int
 <1><73>: Abbrev Number: 3 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 8
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0x20f43): long long unsigned int
 <1><7a>: Abbrev Number: 12 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : int
 <1><81>: Abbrev Number: 3 (DW_TAG_base_type)
    <82>   DW_AT_byte_size   : 4
    <83>   DW_AT_encoding    : 7	(unsigned)
    <84>   DW_AT_name        : (indirect string, offset: 0xc591): unsigned int
 <1><88>: Abbrev Number: 5 (DW_TAG_typedef)
    <89>   DW_AT_name        : (indirect string, offset: 0x2e551): uint8_t
    <8d>   DW_AT_decl_file   : 3
    <8e>   DW_AT_decl_line   : 24
    <8f>   DW_AT_decl_column : 19
    <90>   DW_AT_type        : <0x31>
 <1><94>: Abbrev Number: 5 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0xd74d4): uint32_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 48
    <9b>   DW_AT_decl_column : 20
    <9c>   DW_AT_type        : <0x59>
 <1><a0>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 6 (DW_TAG_structure_type)
    <a6>   DW_AT_byte_size   : 48
    <a7>   DW_AT_decl_file   : 4
    <a7>   DW_AT_decl_line   : 531
    <a9>   DW_AT_decl_column : 9
    <a9>   DW_AT_sibling     : <0x132>
 <2><ad>: Abbrev Number: 1 (DW_TAG_member)
    <ae>   DW_AT_name        : (indirect string, offset: 0x10f4): MODER
    <b2>   DW_AT_decl_file   : 4
    <b2>   DW_AT_decl_line   : 533
    <b4>   DW_AT_decl_column : 17
    <b4>   DW_AT_type        : <0xa0>
    <b8>   DW_AT_data_member_location: 0
 <2><b9>: Abbrev Number: 1 (DW_TAG_member)
    <ba>   DW_AT_name        : (indirect string, offset: 0x7a54b): OTYPER
    <be>   DW_AT_decl_file   : 4
    <be>   DW_AT_decl_line   : 534
    <c0>   DW_AT_decl_column : 17
    <c0>   DW_AT_type        : <0xa0>
    <c4>   DW_AT_data_member_location: 4
 <2><c5>: Abbrev Number: 1 (DW_TAG_member)
    <c6>   DW_AT_name        : (indirect string, offset: 0x89434): OSPEEDR
    <ca>   DW_AT_decl_file   : 4
    <ca>   DW_AT_decl_line   : 535
    <cc>   DW_AT_decl_column : 17
    <cc>   DW_AT_type        : <0xa0>
    <d0>   DW_AT_data_member_location: 8
 <2><d1>: Abbrev Number: 1 (DW_TAG_member)
    <d2>   DW_AT_name        : (indirect string, offset: 0x66ac3): PUPDR
    <d6>   DW_AT_decl_file   : 4
    <d6>   DW_AT_decl_line   : 536
    <d8>   DW_AT_decl_column : 17
    <d8>   DW_AT_type        : <0xa0>
    <dc>   DW_AT_data_member_location: 12
 <2><dd>: Abbrev Number: 2 (DW_TAG_member)
    <de>   DW_AT_name        : IDR
    <e2>   DW_AT_decl_file   : 4
    <e2>   DW_AT_decl_line   : 537
    <e4>   DW_AT_decl_column : 17
    <e4>   DW_AT_type        : <0xa0>
    <e8>   DW_AT_data_member_location: 16
 <2><e9>: Abbrev Number: 2 (DW_TAG_member)
    <ea>   DW_AT_name        : ODR
    <ee>   DW_AT_decl_file   : 4
    <ee>   DW_AT_decl_line   : 538
    <f0>   DW_AT_decl_column : 17
    <f0>   DW_AT_type        : <0xa0>
    <f4>   DW_AT_data_member_location: 20
 <2><f5>: Abbrev Number: 1 (DW_TAG_member)
    <f6>   DW_AT_name        : (indirect string, offset: 0x239c6): BSRR
    <fa>   DW_AT_decl_file   : 4
    <fa>   DW_AT_decl_line   : 539
    <fc>   DW_AT_decl_column : 17
    <fc>   DW_AT_type        : <0xa0>
    <100>   DW_AT_data_member_location: 24
 <2><101>: Abbrev Number: 1 (DW_TAG_member)
    <102>   DW_AT_name        : (indirect string, offset: 0x877c4): LCKR
    <106>   DW_AT_decl_file   : 4
    <106>   DW_AT_decl_line   : 540
    <108>   DW_AT_decl_column : 17
    <108>   DW_AT_type        : <0xa0>
    <10c>   DW_AT_data_member_location: 28
 <2><10d>: Abbrev Number: 2 (DW_TAG_member)
    <10e>   DW_AT_name        : AFR
    <112>   DW_AT_decl_file   : 4
    <112>   DW_AT_decl_line   : 541
    <114>   DW_AT_decl_column : 17
    <114>   DW_AT_type        : <0x142>
    <118>   DW_AT_data_member_location: 32
 <2><119>: Abbrev Number: 2 (DW_TAG_member)
    <11a>   DW_AT_name        : BRR
    <11e>   DW_AT_decl_file   : 4
    <11e>   DW_AT_decl_line   : 542
    <120>   DW_AT_decl_column : 17
    <120>   DW_AT_type        : <0xa0>
    <124>   DW_AT_data_member_location: 40
 <2><125>: Abbrev Number: 1 (DW_TAG_member)
    <126>   DW_AT_name        : (indirect string, offset: 0x1b92): ASCR
    <12a>   DW_AT_decl_file   : 4
    <12a>   DW_AT_decl_line   : 543
    <12c>   DW_AT_decl_column : 17
    <12c>   DW_AT_type        : <0xa0>
    <130>   DW_AT_data_member_location: 44
 <2><131>: Abbrev Number: 0
 <1><132>: Abbrev Number: 13 (DW_TAG_array_type)
    <133>   DW_AT_type        : <0xa0>
    <137>   DW_AT_sibling     : <0x142>
 <2><13b>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <13c>   DW_AT_type        : <0x81>
    <140>   DW_AT_upper_bound : 1
 <2><141>: Abbrev Number: 0
 <1><142>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <143>   DW_AT_type        : <0x132>
 <1><147>: Abbrev Number: 7 (DW_TAG_typedef)
    <148>   DW_AT_name        : (indirect string, offset: 0x991cb): GPIO_TypeDef
    <14c>   DW_AT_decl_file   : 4
    <14c>   DW_AT_decl_line   : 545
    <14e>   DW_AT_decl_column : 3
    <14e>   DW_AT_type        : <0xa5>
 <1><152>: Abbrev Number: 6 (DW_TAG_structure_type)
    <153>   DW_AT_byte_size   : 44
    <154>   DW_AT_decl_file   : 4
    <154>   DW_AT_decl_line   : 552
    <156>   DW_AT_decl_column : 9
    <156>   DW_AT_sibling     : <0x1df>
 <2><15a>: Abbrev Number: 2 (DW_TAG_member)
    <15b>   DW_AT_name        : CR1
    <15f>   DW_AT_decl_file   : 4
    <15f>   DW_AT_decl_line   : 554
    <161>   DW_AT_decl_column : 17
    <161>   DW_AT_type        : <0xa0>
    <165>   DW_AT_data_member_location: 0
 <2><166>: Abbrev Number: 2 (DW_TAG_member)
    <167>   DW_AT_name        : CR2
    <16b>   DW_AT_decl_file   : 4
    <16b>   DW_AT_decl_line   : 555
    <16d>   DW_AT_decl_column : 17
    <16d>   DW_AT_type        : <0xa0>
    <171>   DW_AT_data_member_location: 4
 <2><172>: Abbrev Number: 1 (DW_TAG_member)
    <173>   DW_AT_name        : (indirect string, offset: 0x173b9): OAR1
    <177>   DW_AT_decl_file   : 4
    <177>   DW_AT_decl_line   : 556
    <179>   DW_AT_decl_column : 17
    <179>   DW_AT_type        : <0xa0>
    <17d>   DW_AT_data_member_location: 8
 <2><17e>: Abbrev Number: 1 (DW_TAG_member)
    <17f>   DW_AT_name        : (indirect string, offset: 0x434eb): OAR2
    <183>   DW_AT_decl_file   : 4
    <183>   DW_AT_decl_line   : 557
    <185>   DW_AT_decl_column : 17
    <185>   DW_AT_type        : <0xa0>
    <189>   DW_AT_data_member_location: 12
 <2><18a>: Abbrev Number: 1 (DW_TAG_member)
    <18b>   DW_AT_name        : (indirect string, offset: 0x5d94b): TIMINGR
    <18f>   DW_AT_decl_file   : 4
    <18f>   DW_AT_decl_line   : 558
    <191>   DW_AT_decl_column : 17
    <191>   DW_AT_type        : <0xa0>
    <195>   DW_AT_data_member_location: 16
 <2><196>: Abbrev Number: 1 (DW_TAG_member)
    <197>   DW_AT_name        : (indirect string, offset: 0x80bf2): TIMEOUTR
    <19b>   DW_AT_decl_file   : 4
    <19b>   DW_AT_decl_line   : 559
    <19d>   DW_AT_decl_column : 17
    <19d>   DW_AT_type        : <0xa0>
    <1a1>   DW_AT_data_member_location: 20
 <2><1a2>: Abbrev Number: 2 (DW_TAG_member)
    <1a3>   DW_AT_name        : ISR
    <1a7>   DW_AT_decl_file   : 4
    <1a7>   DW_AT_decl_line   : 560
    <1a9>   DW_AT_decl_column : 17
    <1a9>   DW_AT_type        : <0xa0>
    <1ad>   DW_AT_data_member_location: 24
 <2><1ae>: Abbrev Number: 2 (DW_TAG_member)
    <1af>   DW_AT_name        : ICR
    <1b3>   DW_AT_decl_file   : 4
    <1b3>   DW_AT_decl_line   : 561
    <1b5>   DW_AT_decl_column : 17
    <1b5>   DW_AT_type        : <0xa0>
    <1b9>   DW_AT_data_member_location: 28
 <2><1ba>: Abbrev Number: 1 (DW_TAG_member)
    <1bb>   DW_AT_name        : (indirect string, offset: 0x6d8ef): PECR
    <1bf>   DW_AT_decl_file   : 4
    <1bf>   DW_AT_decl_line   : 562
    <1c1>   DW_AT_decl_column : 17
    <1c1>   DW_AT_type        : <0xa0>
    <1c5>   DW_AT_data_member_location: 32
 <2><1c6>: Abbrev Number: 1 (DW_TAG_member)
    <1c7>   DW_AT_name        : (indirect string, offset: 0x827d2): RXDR
    <1cb>   DW_AT_decl_file   : 4
    <1cb>   DW_AT_decl_line   : 563
    <1cd>   DW_AT_decl_column : 17
    <1cd>   DW_AT_type        : <0xa0>
    <1d1>   DW_AT_data_member_location: 36
 <2><1d2>: Abbrev Number: 1 (DW_TAG_member)
    <1d3>   DW_AT_name        : (indirect string, offset: 0x1e746): TXDR
    <1d7>   DW_AT_decl_file   : 4
    <1d7>   DW_AT_decl_line   : 564
    <1d9>   DW_AT_decl_column : 17
    <1d9>   DW_AT_type        : <0xa0>
    <1dd>   DW_AT_data_member_location: 40
 <2><1de>: Abbrev Number: 0
 <1><1df>: Abbrev Number: 7 (DW_TAG_typedef)
    <1e0>   DW_AT_name        : (indirect string, offset: 0x7c6f4): I2C_TypeDef
    <1e4>   DW_AT_decl_file   : 4
    <1e4>   DW_AT_decl_line   : 565
    <1e6>   DW_AT_decl_column : 3
    <1e6>   DW_AT_type        : <0x152>
 <1><1ea>: Abbrev Number: 6 (DW_TAG_structure_type)
    <1eb>   DW_AT_byte_size   : 152
    <1ec>   DW_AT_decl_file   : 4
    <1ec>   DW_AT_decl_line   : 685
    <1ee>   DW_AT_decl_column : 9
    <1ee>   DW_AT_sibling     : <0x3ba>
 <2><1f2>: Abbrev Number: 2 (DW_TAG_member)
    <1f3>   DW_AT_name        : CR
    <1f6>   DW_AT_decl_file   : 4
    <1f6>   DW_AT_decl_line   : 687
    <1f8>   DW_AT_decl_column : 17
    <1f8>   DW_AT_type        : <0xa0>
    <1fc>   DW_AT_data_member_location: 0
 <2><1fd>: Abbrev Number: 1 (DW_TAG_member)
    <1fe>   DW_AT_name        : (indirect string, offset: 0x6af01): ICSCR
    <202>   DW_AT_decl_file   : 4
    <202>   DW_AT_decl_line   : 688
    <204>   DW_AT_decl_column : 17
    <204>   DW_AT_type        : <0xa0>
    <208>   DW_AT_data_member_location: 4
 <2><209>: Abbrev Number: 1 (DW_TAG_member)
    <20a>   DW_AT_name        : (indirect string, offset: 0x34674): CFGR
    <20e>   DW_AT_decl_file   : 4
    <20e>   DW_AT_decl_line   : 689
    <210>   DW_AT_decl_column : 17
    <210>   DW_AT_type        : <0xa0>
    <214>   DW_AT_data_member_location: 8
 <2><215>: Abbrev Number: 1 (DW_TAG_member)
    <216>   DW_AT_name        : (indirect string, offset: 0x6f093): PLLCFGR
    <21a>   DW_AT_decl_file   : 4
    <21a>   DW_AT_decl_line   : 690
    <21c>   DW_AT_decl_column : 17
    <21c>   DW_AT_type        : <0xa0>
    <220>   DW_AT_data_member_location: 12
 <2><221>: Abbrev Number: 1 (DW_TAG_member)
    <222>   DW_AT_name        : (indirect string, offset: 0x3466d): PLLSAI1CFGR
    <226>   DW_AT_decl_file   : 4
    <226>   DW_AT_decl_line   : 691
    <228>   DW_AT_decl_column : 17
    <228>   DW_AT_type        : <0xa0>
    <22c>   DW_AT_data_member_location: 16
 <2><22d>: Abbrev Number: 1 (DW_TAG_member)
    <22e>   DW_AT_name        : (indirect string, offset: 0x6750c): PLLSAI2CFGR
    <232>   DW_AT_decl_file   : 4
    <232>   DW_AT_decl_line   : 692
    <234>   DW_AT_decl_column : 17
    <234>   DW_AT_type        : <0xa0>
    <238>   DW_AT_data_member_location: 20
 <2><239>: Abbrev Number: 1 (DW_TAG_member)
    <23a>   DW_AT_name        : (indirect string, offset: 0x1e2c): CIER
    <23e>   DW_AT_decl_file   : 4
    <23e>   DW_AT_decl_line   : 693
    <240>   DW_AT_decl_column : 17
    <240>   DW_AT_type        : <0xa0>
    <244>   DW_AT_data_member_location: 24
 <2><245>: Abbrev Number: 1 (DW_TAG_member)
    <246>   DW_AT_name        : (indirect string, offset: 0x21bc): CIFR
    <24a>   DW_AT_decl_file   : 4
    <24a>   DW_AT_decl_line   : 694
    <24c>   DW_AT_decl_column : 17
    <24c>   DW_AT_type        : <0xa0>
    <250>   DW_AT_data_member_location: 28
 <2><251>: Abbrev Number: 1 (DW_TAG_member)
    <252>   DW_AT_name        : (indirect string, offset: 0x14c7): CICR
    <256>   DW_AT_decl_file   : 4
    <256>   DW_AT_decl_line   : 695
    <258>   DW_AT_decl_column : 17
    <258>   DW_AT_type        : <0xa0>
    <25c>   DW_AT_data_member_location: 32
 <2><25d>: Abbrev Number: 1 (DW_TAG_member)
    <25e>   DW_AT_name        : (indirect string, offset: 0x94934): RESERVED0
    <262>   DW_AT_decl_file   : 4
    <262>   DW_AT_decl_line   : 696
    <264>   DW_AT_decl_column : 17
    <264>   DW_AT_type        : <0x94>
    <268>   DW_AT_data_member_location: 36
 <2><269>: Abbrev Number: 1 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0x7df1e): AHB1RSTR
    <26e>   DW_AT_decl_file   : 4
    <26e>   DW_AT_decl_line   : 697
    <270>   DW_AT_decl_column : 17
    <270>   DW_AT_type        : <0xa0>
    <274>   DW_AT_data_member_location: 40
 <2><275>: Abbrev Number: 1 (DW_TAG_member)
    <276>   DW_AT_name        : (indirect string, offset: 0x1d1de): AHB2RSTR
    <27a>   DW_AT_decl_file   : 4
    <27a>   DW_AT_decl_line   : 698
    <27c>   DW_AT_decl_column : 17
    <27c>   DW_AT_type        : <0xa0>
    <280>   DW_AT_data_member_location: 44
 <2><281>: Abbrev Number: 1 (DW_TAG_member)
    <282>   DW_AT_name        : (indirect string, offset: 0x342f4): AHB3RSTR
    <286>   DW_AT_decl_file   : 4
    <286>   DW_AT_decl_line   : 699
    <288>   DW_AT_decl_column : 17
    <288>   DW_AT_type        : <0xa0>
    <28c>   DW_AT_data_member_location: 48
 <2><28d>: Abbrev Number: 1 (DW_TAG_member)
    <28e>   DW_AT_name        : (indirect string, offset: 0x9493e): RESERVED1
    <292>   DW_AT_decl_file   : 4
    <292>   DW_AT_decl_line   : 700
    <294>   DW_AT_decl_column : 17
    <294>   DW_AT_type        : <0x94>
    <298>   DW_AT_data_member_location: 52
 <2><299>: Abbrev Number: 1 (DW_TAG_member)
    <29a>   DW_AT_name        : (indirect string, offset: 0x2025f): APB1RSTR1
    <29e>   DW_AT_decl_file   : 4
    <29e>   DW_AT_decl_line   : 701
    <2a0>   DW_AT_decl_column : 17
    <2a0>   DW_AT_type        : <0xa0>
    <2a4>   DW_AT_data_member_location: 56
 <2><2a5>: Abbrev Number: 1 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x20269): APB1RSTR2
    <2aa>   DW_AT_decl_file   : 4
    <2aa>   DW_AT_decl_line   : 702
    <2ac>   DW_AT_decl_column : 17
    <2ac>   DW_AT_type        : <0xa0>
    <2b0>   DW_AT_data_member_location: 60
 <2><2b1>: Abbrev Number: 1 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0x452d5): APB2RSTR
    <2b6>   DW_AT_decl_file   : 4
    <2b6>   DW_AT_decl_line   : 703
    <2b8>   DW_AT_decl_column : 17
    <2b8>   DW_AT_type        : <0xa0>
    <2bc>   DW_AT_data_member_location: 64
 <2><2bd>: Abbrev Number: 1 (DW_TAG_member)
    <2be>   DW_AT_name        : (indirect string, offset: 0x94948): RESERVED2
    <2c2>   DW_AT_decl_file   : 4
    <2c2>   DW_AT_decl_line   : 704
    <2c4>   DW_AT_decl_column : 17
    <2c4>   DW_AT_type        : <0x94>
    <2c8>   DW_AT_data_member_location: 68
 <2><2c9>: Abbrev Number: 1 (DW_TAG_member)
    <2ca>   DW_AT_name        : (indirect string, offset: 0xc557): AHB1ENR
    <2ce>   DW_AT_decl_file   : 4
    <2ce>   DW_AT_decl_line   : 705
    <2d0>   DW_AT_decl_column : 17
    <2d0>   DW_AT_type        : <0xa0>
    <2d4>   DW_AT_data_member_location: 72
 <2><2d5>: Abbrev Number: 1 (DW_TAG_member)
    <2d6>   DW_AT_name        : (indirect string, offset: 0x2a2be): AHB2ENR
    <2da>   DW_AT_decl_file   : 4
    <2da>   DW_AT_decl_line   : 706
    <2dc>   DW_AT_decl_column : 17
    <2dc>   DW_AT_type        : <0xa0>
    <2e0>   DW_AT_data_member_location: 76
 <2><2e1>: Abbrev Number: 1 (DW_TAG_member)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x477be): AHB3ENR
    <2e6>   DW_AT_decl_file   : 4
    <2e6>   DW_AT_decl_line   : 707
    <2e8>   DW_AT_decl_column : 17
    <2e8>   DW_AT_type        : <0xa0>
    <2ec>   DW_AT_data_member_location: 80
 <2><2ed>: Abbrev Number: 1 (DW_TAG_member)
    <2ee>   DW_AT_name        : (indirect string, offset: 0x94952): RESERVED3
    <2f2>   DW_AT_decl_file   : 4
    <2f2>   DW_AT_decl_line   : 708
    <2f4>   DW_AT_decl_column : 17
    <2f4>   DW_AT_type        : <0x94>
    <2f8>   DW_AT_data_member_location: 84
 <2><2f9>: Abbrev Number: 1 (DW_TAG_member)
    <2fa>   DW_AT_name        : (indirect string, offset: 0x5148): APB1ENR1
    <2fe>   DW_AT_decl_file   : 4
    <2fe>   DW_AT_decl_line   : 709
    <300>   DW_AT_decl_column : 17
    <300>   DW_AT_type        : <0xa0>
    <304>   DW_AT_data_member_location: 88
 <2><305>: Abbrev Number: 1 (DW_TAG_member)
    <306>   DW_AT_name        : (indirect string, offset: 0x5151): APB1ENR2
    <30a>   DW_AT_decl_file   : 4
    <30a>   DW_AT_decl_line   : 710
    <30c>   DW_AT_decl_column : 17
    <30c>   DW_AT_type        : <0xa0>
    <310>   DW_AT_data_member_location: 92
 <2><311>: Abbrev Number: 1 (DW_TAG_member)
    <312>   DW_AT_name        : (indirect string, offset: 0x12839): APB2ENR
    <316>   DW_AT_decl_file   : 4
    <316>   DW_AT_decl_line   : 711
    <318>   DW_AT_decl_column : 17
    <318>   DW_AT_type        : <0xa0>
    <31c>   DW_AT_data_member_location: 96
 <2><31d>: Abbrev Number: 1 (DW_TAG_member)
    <31e>   DW_AT_name        : (indirect string, offset: 0x58712): RESERVED4
    <322>   DW_AT_decl_file   : 4
    <322>   DW_AT_decl_line   : 712
    <324>   DW_AT_decl_column : 17
    <324>   DW_AT_type        : <0x94>
    <328>   DW_AT_data_member_location: 100
 <2><329>: Abbrev Number: 1 (DW_TAG_member)
    <32a>   DW_AT_name        : (indirect string, offset: 0x4921d): AHB1SMENR
    <32e>   DW_AT_decl_file   : 4
    <32e>   DW_AT_decl_line   : 713
    <330>   DW_AT_decl_column : 17
    <330>   DW_AT_type        : <0xa0>
    <334>   DW_AT_data_member_location: 104
 <2><335>: Abbrev Number: 1 (DW_TAG_member)
    <336>   DW_AT_name        : (indirect string, offset: 0x908da): AHB2SMENR
    <33a>   DW_AT_decl_file   : 4
    <33a>   DW_AT_decl_line   : 714
    <33c>   DW_AT_decl_column : 17
    <33c>   DW_AT_type        : <0xa0>
    <340>   DW_AT_data_member_location: 108
 <2><341>: Abbrev Number: 1 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0x3a543): AHB3SMENR
    <346>   DW_AT_decl_file   : 4
    <346>   DW_AT_decl_line   : 715
    <348>   DW_AT_decl_column : 17
    <348>   DW_AT_type        : <0xa0>
    <34c>   DW_AT_data_member_location: 112
 <2><34d>: Abbrev Number: 1 (DW_TAG_member)
    <34e>   DW_AT_name        : (indirect string, offset: 0x94980): RESERVED5
    <352>   DW_AT_decl_file   : 4
    <352>   DW_AT_decl_line   : 716
    <354>   DW_AT_decl_column : 17
    <354>   DW_AT_type        : <0x94>
    <358>   DW_AT_data_member_location: 116
 <2><359>: Abbrev Number: 1 (DW_TAG_member)
    <35a>   DW_AT_name        : (indirect string, offset: 0x59da): APB1SMENR1
    <35e>   DW_AT_decl_file   : 4
    <35e>   DW_AT_decl_line   : 717
    <360>   DW_AT_decl_column : 17
    <360>   DW_AT_type        : <0xa0>
    <364>   DW_AT_data_member_location: 120
 <2><365>: Abbrev Number: 1 (DW_TAG_member)
    <366>   DW_AT_name        : (indirect string, offset: 0x59e5): APB1SMENR2
    <36a>   DW_AT_decl_file   : 4
    <36a>   DW_AT_decl_line   : 718
    <36c>   DW_AT_decl_column : 17
    <36c>   DW_AT_type        : <0xa0>
    <370>   DW_AT_data_member_location: 124
 <2><371>: Abbrev Number: 1 (DW_TAG_member)
    <372>   DW_AT_name        : (indirect string, offset: 0x7f70a): APB2SMENR
    <376>   DW_AT_decl_file   : 4
    <376>   DW_AT_decl_line   : 719
    <378>   DW_AT_decl_column : 17
    <378>   DW_AT_type        : <0xa0>
    <37c>   DW_AT_data_member_location: 128
 <2><37d>: Abbrev Number: 1 (DW_TAG_member)
    <37e>   DW_AT_name        : (indirect string, offset: 0x9498a): RESERVED6
    <382>   DW_AT_decl_file   : 4
    <382>   DW_AT_decl_line   : 720
    <384>   DW_AT_decl_column : 17
    <384>   DW_AT_type        : <0x94>
    <388>   DW_AT_data_member_location: 132
 <2><389>: Abbrev Number: 1 (DW_TAG_member)
    <38a>   DW_AT_name        : (indirect string, offset: 0x30a10): CCIPR
    <38e>   DW_AT_decl_file   : 4
    <38e>   DW_AT_decl_line   : 721
    <390>   DW_AT_decl_column : 17
    <390>   DW_AT_type        : <0xa0>
    <394>   DW_AT_data_member_location: 136
 <2><395>: Abbrev Number: 1 (DW_TAG_member)
    <396>   DW_AT_name        : (indirect string, offset: 0x94994): RESERVED7
    <39a>   DW_AT_decl_file   : 4
    <39a>   DW_AT_decl_line   : 722
    <39c>   DW_AT_decl_column : 17
    <39c>   DW_AT_type        : <0x94>
    <3a0>   DW_AT_data_member_location: 140
 <2><3a1>: Abbrev Number: 1 (DW_TAG_member)
    <3a2>   DW_AT_name        : (indirect string, offset: 0x2950e): BDCR
    <3a6>   DW_AT_decl_file   : 4
    <3a6>   DW_AT_decl_line   : 723
    <3a8>   DW_AT_decl_column : 17
    <3a8>   DW_AT_type        : <0xa0>
    <3ac>   DW_AT_data_member_location: 144
 <2><3ad>: Abbrev Number: 2 (DW_TAG_member)
    <3ae>   DW_AT_name        : CSR
    <3b2>   DW_AT_decl_file   : 4
    <3b2>   DW_AT_decl_line   : 724
    <3b4>   DW_AT_decl_column : 17
    <3b4>   DW_AT_type        : <0xa0>
    <3b8>   DW_AT_data_member_location: 148
 <2><3b9>: Abbrev Number: 0
 <1><3ba>: Abbrev Number: 7 (DW_TAG_typedef)
    <3bb>   DW_AT_name        : (indirect string, offset: 0x49a7b): RCC_TypeDef
    <3bf>   DW_AT_decl_file   : 4
    <3bf>   DW_AT_decl_line   : 725
    <3c1>   DW_AT_decl_column : 3
    <3c1>   DW_AT_type        : <0x1ea>
 <1><3c5>: Abbrev Number: 15 (DW_TAG_variable)
    <3c6>   DW_AT_name        : (indirect string, offset: 0x8293a): tmpreg
    <3ca>   DW_AT_decl_file   : 1
    <3cb>   DW_AT_decl_line   : 5
    <3cc>   DW_AT_decl_column : 19
    <3cd>   DW_AT_type        : <0xa0>
    <3d1>   DW_AT_external    : 1
    <3d1>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><3d7>: Abbrev Number: 16 (DW_TAG_subprogram)
    <3d8>   DW_AT_external    : 1
    <3d8>   DW_AT_name        : (indirect string, offset: 0x293ad): I2C1_Config
    <3dc>   DW_AT_decl_file   : 1
    <3dd>   DW_AT_decl_line   : 98
    <3de>   DW_AT_decl_column : 6
    <3df>   DW_AT_prototyped  : 1
    <3df>   DW_AT_low_pc      : 0x8000770
    <3e3>   DW_AT_high_pc     : 0x144
    <3e7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3e9>   DW_AT_call_all_calls: 1
 <1><3e9>: Abbrev Number: 9 (DW_TAG_subprogram)
    <3ea>   DW_AT_external    : 1
    <3ea>   DW_AT_name        : (indirect string, offset: 0x6dc7): I2C1_Write
    <3ee>   DW_AT_decl_file   : 1
    <3ee>   DW_AT_decl_line   : 75
    <3ef>   DW_AT_decl_column : 6
    <3ef>   DW_AT_prototyped  : 1
    <3ef>   DW_AT_low_pc      : 0x80006e4
    <3f3>   DW_AT_high_pc     : 0x8c
    <3f7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3f9>   DW_AT_call_all_calls: 1
    <3f9>   DW_AT_sibling     : <0x428>
 <2><3fd>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <3fe>   DW_AT_name        : (indirect string, offset: 0x2dac0): devAddr
    <402>   DW_AT_decl_file   : 1
    <402>   DW_AT_decl_line   : 75
    <403>   DW_AT_decl_column : 25
    <404>   DW_AT_type        : <0x88>
    <408>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><40b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <40c>   DW_AT_name        : (indirect string, offset: 0x59d8b): regAddr
    <410>   DW_AT_decl_file   : 1
    <410>   DW_AT_decl_line   : 75
    <411>   DW_AT_decl_column : 42
    <412>   DW_AT_type        : <0x88>
    <416>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><419>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <41a>   DW_AT_name        : (indirect string, offset: 0x4a1e0): data
    <41e>   DW_AT_decl_file   : 1
    <41e>   DW_AT_decl_line   : 75
    <41f>   DW_AT_decl_column : 59
    <420>   DW_AT_type        : <0x88>
    <424>   DW_AT_location    : 2 byte block: 91 75 	(DW_OP_fbreg: -11)
 <2><427>: Abbrev Number: 0
 <1><428>: Abbrev Number: 17 (DW_TAG_subprogram)
    <429>   DW_AT_external    : 1
    <429>   DW_AT_name        : (indirect string, offset: 0x6dde5): I2C1_Read
    <42d>   DW_AT_decl_file   : 1
    <42e>   DW_AT_decl_line   : 35
    <42f>   DW_AT_decl_column : 9
    <430>   DW_AT_prototyped  : 1
    <430>   DW_AT_type        : <0x88>
    <434>   DW_AT_low_pc      : 0x8000634
    <438>   DW_AT_high_pc     : 0xb0
    <43c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <43e>   DW_AT_call_all_calls: 1
    <43e>   DW_AT_sibling     : <0x46e>
 <2><442>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <443>   DW_AT_name        : (indirect string, offset: 0x2dac0): devAddr
    <447>   DW_AT_decl_file   : 1
    <447>   DW_AT_decl_line   : 35
    <448>   DW_AT_decl_column : 27
    <449>   DW_AT_type        : <0x88>
    <44d>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><450>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <451>   DW_AT_name        : (indirect string, offset: 0x59d8b): regAddr
    <455>   DW_AT_decl_file   : 1
    <455>   DW_AT_decl_line   : 35
    <456>   DW_AT_decl_column : 44
    <457>   DW_AT_type        : <0x88>
    <45b>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><45e>: Abbrev Number: 18 (DW_TAG_variable)
    <45f>   DW_AT_name        : (indirect string, offset: 0x4a1e0): data
    <463>   DW_AT_decl_file   : 1
    <464>   DW_AT_decl_line   : 36
    <465>   DW_AT_decl_column : 10
    <466>   DW_AT_type        : <0x88>
    <46a>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><46d>: Abbrev Number: 0
 <1><46e>: Abbrev Number: 9 (DW_TAG_subprogram)
    <46f>   DW_AT_external    : 1
    <46f>   DW_AT_name        : (indirect string, offset: 0x3bfaa): I2C1_MultiRead
    <473>   DW_AT_decl_file   : 1
    <473>   DW_AT_decl_line   : 8
    <474>   DW_AT_decl_column : 6
    <474>   DW_AT_prototyped  : 1
    <474>   DW_AT_low_pc      : 0x8000560
    <478>   DW_AT_high_pc     : 0xd4
    <47c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <47e>   DW_AT_call_all_calls: 1
    <47e>   DW_AT_sibling     : <0x4d0>
 <2><482>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <483>   DW_AT_name        : (indirect string, offset: 0x2dac0): devAddr
    <487>   DW_AT_decl_file   : 1
    <487>   DW_AT_decl_line   : 8
    <488>   DW_AT_decl_column : 29
    <489>   DW_AT_type        : <0x88>
    <48d>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><490>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <491>   DW_AT_name        : (indirect string, offset: 0x59d8b): regAddr
    <495>   DW_AT_decl_file   : 1
    <495>   DW_AT_decl_line   : 8
    <496>   DW_AT_decl_column : 46
    <497>   DW_AT_type        : <0x88>
    <49b>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><49e>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <49f>   DW_AT_name        : buf
    <4a3>   DW_AT_decl_file   : 1
    <4a3>   DW_AT_decl_line   : 8
    <4a3>   DW_AT_decl_column : 64
    <4a4>   DW_AT_type        : <0x4d0>
    <4a8>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><4ab>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <4ac>   DW_AT_name        : len
    <4b0>   DW_AT_decl_file   : 1
    <4b0>   DW_AT_decl_line   : 8
    <4b0>   DW_AT_decl_column : 77
    <4b1>   DW_AT_type        : <0x88>
    <4b5>   DW_AT_location    : 2 byte block: 91 6d 	(DW_OP_fbreg: -19)
 <2><4b8>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <4b9>   DW_AT_low_pc      : 0x80005e0
    <4bd>   DW_AT_high_pc     : 0x30
 <3><4c1>: Abbrev Number: 20 (DW_TAG_variable)
    <4c2>   DW_AT_name        : i
    <4c4>   DW_AT_decl_file   : 1
    <4c5>   DW_AT_decl_line   : 25
    <4c6>   DW_AT_decl_column : 17
    <4c7>   DW_AT_type        : <0x88>
    <4cb>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <3><4ce>: Abbrev Number: 0
 <2><4cf>: Abbrev Number: 0
 <1><4d0>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <4d1>   DW_AT_byte_size   : 4
    <4d2>   DW_AT_type        : <0x88>
 <1><4d6>: Abbrev Number: 0
  Compilation Unit @ offset 0x4d7:
   Length:        0x201 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x15b
   Pointer Size:  4
 <0><4e3>: Abbrev Number: 8 (DW_TAG_compile_unit)
    <4e4>   DW_AT_producer    : (indirect string, offset: 0x299ef): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <4e8>   DW_AT_language    : 29	(C11)
    <4e9>   DW_AT_name        : (indirect string, offset: 0xa012f): ../Core/Src/Drivers/LSM6DS3.c
    <4ed>   DW_AT_comp_dir    : (indirect string, offset: 0x57523): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <4f1>   DW_AT_ranges      : 0x35
    <4f5>   DW_AT_low_pc      : 0
    <4f9>   DW_AT_stmt_list   : 0x7dd
    <4fd>   DW_AT_macros      : 0x1c406
 <1><501>: Abbrev Number: 1 (DW_TAG_base_type)
    <502>   DW_AT_byte_size   : 1
    <503>   DW_AT_encoding    : 6	(signed char)
    <504>   DW_AT_name        : (indirect string, offset: 0x4fce6): signed char
 <1><508>: Abbrev Number: 3 (DW_TAG_typedef)
    <509>   DW_AT_name        : (indirect string, offset: 0x2e54f): __uint8_t
    <50d>   DW_AT_decl_file   : 2
    <50e>   DW_AT_decl_line   : 43
    <50f>   DW_AT_decl_column : 24
    <510>   DW_AT_type        : <0x514>
 <1><514>: Abbrev Number: 1 (DW_TAG_base_type)
    <515>   DW_AT_byte_size   : 1
    <516>   DW_AT_encoding    : 8	(unsigned char)
    <517>   DW_AT_name        : (indirect string, offset: 0x9827d): unsigned char
 <1><51b>: Abbrev Number: 3 (DW_TAG_typedef)
    <51c>   DW_AT_name        : (indirect string, offset: 0x9ed39): __int16_t
    <520>   DW_AT_decl_file   : 2
    <521>   DW_AT_decl_line   : 55
    <522>   DW_AT_decl_column : 24
    <523>   DW_AT_type        : <0x527>
 <1><527>: Abbrev Number: 1 (DW_TAG_base_type)
    <528>   DW_AT_byte_size   : 2
    <529>   DW_AT_encoding    : 5	(signed)
    <52a>   DW_AT_name        : (indirect string, offset: 0x7583d): short int
 <1><52e>: Abbrev Number: 3 (DW_TAG_typedef)
    <52f>   DW_AT_name        : (indirect string, offset: 0xa145a): __uint16_t
    <533>   DW_AT_decl_file   : 2
    <534>   DW_AT_decl_line   : 57
    <535>   DW_AT_decl_column : 25
    <536>   DW_AT_type        : <0x53a>
 <1><53a>: Abbrev Number: 1 (DW_TAG_base_type)
    <53b>   DW_AT_byte_size   : 2
    <53c>   DW_AT_encoding    : 7	(unsigned)
    <53d>   DW_AT_name        : (indirect string, offset: 0x970ba): short unsigned int
 <1><541>: Abbrev Number: 1 (DW_TAG_base_type)
    <542>   DW_AT_byte_size   : 4
    <543>   DW_AT_encoding    : 5	(signed)
    <544>   DW_AT_name        : (indirect string, offset: 0xcd5a): long int
 <1><548>: Abbrev Number: 1 (DW_TAG_base_type)
    <549>   DW_AT_byte_size   : 4
    <54a>   DW_AT_encoding    : 7	(unsigned)
    <54b>   DW_AT_name        : (indirect string, offset: 0x3ccb2): long unsigned int
 <1><54f>: Abbrev Number: 1 (DW_TAG_base_type)
    <550>   DW_AT_byte_size   : 8
    <551>   DW_AT_encoding    : 5	(signed)
    <552>   DW_AT_name        : (indirect string, offset: 0x48957): long long int
 <1><556>: Abbrev Number: 1 (DW_TAG_base_type)
    <557>   DW_AT_byte_size   : 8
    <558>   DW_AT_encoding    : 7	(unsigned)
    <559>   DW_AT_name        : (indirect string, offset: 0x20f43): long long unsigned int
 <1><55d>: Abbrev Number: 9 (DW_TAG_base_type)
    <55e>   DW_AT_byte_size   : 4
    <55f>   DW_AT_encoding    : 5	(signed)
    <560>   DW_AT_name        : int
 <1><564>: Abbrev Number: 1 (DW_TAG_base_type)
    <565>   DW_AT_byte_size   : 4
    <566>   DW_AT_encoding    : 7	(unsigned)
    <567>   DW_AT_name        : (indirect string, offset: 0xc591): unsigned int
 <1><56b>: Abbrev Number: 1 (DW_TAG_base_type)
    <56c>   DW_AT_byte_size   : 8
    <56d>   DW_AT_encoding    : 4	(float)
    <56e>   DW_AT_name        : (indirect string, offset: 0x9e78c): long double
 <1><572>: Abbrev Number: 1 (DW_TAG_base_type)
    <573>   DW_AT_byte_size   : 1
    <574>   DW_AT_encoding    : 8	(unsigned char)
    <575>   DW_AT_name        : (indirect string, offset: 0xb968d): char
 <1><579>: Abbrev Number: 10 (DW_TAG_const_type)
    <57a>   DW_AT_type        : <0x572>
 <1><57e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <57f>   DW_AT_byte_size   : 4
    <57f>   DW_AT_type        : <0x579>
 <1><583>: Abbrev Number: 3 (DW_TAG_typedef)
    <584>   DW_AT_name        : (indirect string, offset: 0x2e551): uint8_t
    <588>   DW_AT_decl_file   : 3
    <589>   DW_AT_decl_line   : 24
    <58a>   DW_AT_decl_column : 19
    <58b>   DW_AT_type        : <0x508>
 <1><58f>: Abbrev Number: 3 (DW_TAG_typedef)
    <590>   DW_AT_name        : (indirect string, offset: 0x9ed3b): int16_t
    <594>   DW_AT_decl_file   : 3
    <595>   DW_AT_decl_line   : 32
    <596>   DW_AT_decl_column : 19
    <597>   DW_AT_type        : <0x51b>
 <1><59b>: Abbrev Number: 3 (DW_TAG_typedef)
    <59c>   DW_AT_name        : (indirect string, offset: 0xa145c): uint16_t
    <5a0>   DW_AT_decl_file   : 3
    <5a1>   DW_AT_decl_line   : 36
    <5a2>   DW_AT_decl_column : 20
    <5a3>   DW_AT_type        : <0x52e>
 <1><5a7>: Abbrev Number: 11 (DW_TAG_structure_type)
    <5a8>   DW_AT_byte_size   : 12
    <5a9>   DW_AT_decl_file   : 4
    <5aa>   DW_AT_decl_line   : 35
    <5ab>   DW_AT_decl_column : 9
    <5ac>   DW_AT_sibling     : <0x5f3>
 <2><5b0>: Abbrev Number: 4 (DW_TAG_member)
    <5b1>   DW_AT_name        : gx
    <5b4>   DW_AT_decl_file   : 4
    <5b4>   DW_AT_decl_line   : 36
    <5b5>   DW_AT_decl_column : 10
    <5b6>   DW_AT_type        : <0x58f>
    <5ba>   DW_AT_data_member_location: 0
 <2><5bb>: Abbrev Number: 4 (DW_TAG_member)
    <5bc>   DW_AT_name        : gy
    <5bf>   DW_AT_decl_file   : 4
    <5bf>   DW_AT_decl_line   : 36
    <5c0>   DW_AT_decl_column : 14
    <5c1>   DW_AT_type        : <0x58f>
    <5c5>   DW_AT_data_member_location: 2
 <2><5c6>: Abbrev Number: 4 (DW_TAG_member)
    <5c7>   DW_AT_name        : gz
    <5ca>   DW_AT_decl_file   : 4
    <5ca>   DW_AT_decl_line   : 36
    <5cb>   DW_AT_decl_column : 18
    <5cc>   DW_AT_type        : <0x58f>
    <5d0>   DW_AT_data_member_location: 4
 <2><5d1>: Abbrev Number: 4 (DW_TAG_member)
    <5d2>   DW_AT_name        : ax
    <5d5>   DW_AT_decl_file   : 4
    <5d5>   DW_AT_decl_line   : 37
    <5d6>   DW_AT_decl_column : 10
    <5d7>   DW_AT_type        : <0x58f>
    <5db>   DW_AT_data_member_location: 6
 <2><5dc>: Abbrev Number: 4 (DW_TAG_member)
    <5dd>   DW_AT_name        : ay
    <5e0>   DW_AT_decl_file   : 4
    <5e0>   DW_AT_decl_line   : 37
    <5e1>   DW_AT_decl_column : 14
    <5e2>   DW_AT_type        : <0x58f>
    <5e6>   DW_AT_data_member_location: 8
 <2><5e7>: Abbrev Number: 4 (DW_TAG_member)
    <5e8>   DW_AT_name        : az
    <5eb>   DW_AT_decl_file   : 4
    <5eb>   DW_AT_decl_line   : 37
    <5ec>   DW_AT_decl_column : 18
    <5ed>   DW_AT_type        : <0x58f>
    <5f1>   DW_AT_data_member_location: 10
 <2><5f2>: Abbrev Number: 0
 <1><5f3>: Abbrev Number: 3 (DW_TAG_typedef)
    <5f4>   DW_AT_name        : (indirect string, offset: 0xa09d0): LSM6DS3_Sample
    <5f8>   DW_AT_decl_file   : 4
    <5f9>   DW_AT_decl_line   : 38
    <5fa>   DW_AT_decl_column : 2
    <5fb>   DW_AT_type        : <0x5a7>
 <1><5ff>: Abbrev Number: 6 (DW_TAG_subprogram)
    <600>   DW_AT_external    : 1
    <600>   DW_AT_name        : (indirect string, offset: 0x3bfaa): I2C1_MultiRead
    <604>   DW_AT_decl_file   : 5
    <604>   DW_AT_decl_line   : 11
    <605>   DW_AT_decl_column : 6
    <605>   DW_AT_prototyped  : 1
    <605>   DW_AT_declaration : 1
    <605>   DW_AT_sibling     : <0x61e>
 <2><609>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <60a>   DW_AT_type        : <0x583>
 <2><60e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <60f>   DW_AT_type        : <0x583>
 <2><613>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <614>   DW_AT_type        : <0x61e>
 <2><618>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <619>   DW_AT_type        : <0x583>
 <2><61d>: Abbrev Number: 0
 <1><61e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <61f>   DW_AT_byte_size   : 4
    <61f>   DW_AT_type        : <0x583>
 <1><623>: Abbrev Number: 7 (DW_TAG_subprogram)
    <624>   DW_AT_external    : 1
    <624>   DW_AT_name        : (indirect string, offset: 0x9e4da): printf
    <628>   DW_AT_decl_file   : 6
    <629>   DW_AT_decl_line   : 206
    <62a>   DW_AT_decl_column : 5
    <62b>   DW_AT_prototyped  : 1
    <62b>   DW_AT_type        : <0x55d>
    <62f>   DW_AT_declaration : 1
    <62f>   DW_AT_sibling     : <0x63a>
 <2><633>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <634>   DW_AT_type        : <0x57e>
 <2><638>: Abbrev Number: 12 (DW_TAG_unspecified_parameters)
 <2><639>: Abbrev Number: 0
 <1><63a>: Abbrev Number: 6 (DW_TAG_subprogram)
    <63b>   DW_AT_external    : 1
    <63b>   DW_AT_name        : (indirect string, offset: 0x6dc7): I2C1_Write
    <63f>   DW_AT_decl_file   : 5
    <63f>   DW_AT_decl_line   : 13
    <640>   DW_AT_decl_column : 6
    <640>   DW_AT_prototyped  : 1
    <640>   DW_AT_declaration : 1
    <640>   DW_AT_sibling     : <0x654>
 <2><644>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <645>   DW_AT_type        : <0x583>
 <2><649>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <64a>   DW_AT_type        : <0x583>
 <2><64e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <64f>   DW_AT_type        : <0x583>
 <2><653>: Abbrev Number: 0
 <1><654>: Abbrev Number: 7 (DW_TAG_subprogram)
    <655>   DW_AT_external    : 1
    <655>   DW_AT_name        : (indirect string, offset: 0x6dde5): I2C1_Read
    <659>   DW_AT_decl_file   : 5
    <65a>   DW_AT_decl_line   : 12
    <65b>   DW_AT_decl_column : 9
    <65c>   DW_AT_prototyped  : 1
    <65c>   DW_AT_type        : <0x583>
    <660>   DW_AT_declaration : 1
    <660>   DW_AT_sibling     : <0x66f>
 <2><664>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <665>   DW_AT_type        : <0x583>
 <2><669>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <66a>   DW_AT_type        : <0x583>
 <2><66e>: Abbrev Number: 0
 <1><66f>: Abbrev Number: 13 (DW_TAG_subprogram)
    <670>   DW_AT_external    : 1
    <670>   DW_AT_name        : (indirect string, offset: 0x9f0f9): LSM6DS3_GyroAccelRead
    <674>   DW_AT_decl_file   : 1
    <675>   DW_AT_decl_line   : 23
    <676>   DW_AT_decl_column : 6
    <677>   DW_AT_prototyped  : 1
    <677>   DW_AT_low_pc      : 0x8000908
    <67b>   DW_AT_high_pc     : 0x8a
    <67f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <681>   DW_AT_call_all_tail_calls: 1
    <681>   DW_AT_sibling     : <0x6a4>
 <2><685>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <686>   DW_AT_name        : (indirect string, offset: 0x4a1e0): data
    <68a>   DW_AT_decl_file   : 1
    <68b>   DW_AT_decl_line   : 23
    <68c>   DW_AT_decl_column : 44
    <68d>   DW_AT_type        : <0x6a4>
    <691>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><694>: Abbrev Number: 15 (DW_TAG_variable)
    <695>   DW_AT_name        : buf
    <699>   DW_AT_decl_file   : 1
    <69a>   DW_AT_decl_line   : 24
    <69b>   DW_AT_decl_column : 10
    <69c>   DW_AT_type        : <0x6a9>
    <6a0>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><6a3>: Abbrev Number: 0
 <1><6a4>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <6a5>   DW_AT_byte_size   : 4
    <6a5>   DW_AT_type        : <0x5f3>
 <1><6a9>: Abbrev Number: 16 (DW_TAG_array_type)
    <6aa>   DW_AT_type        : <0x583>
    <6ae>   DW_AT_sibling     : <0x6b9>
 <2><6b2>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <6b3>   DW_AT_type        : <0x564>
    <6b7>   DW_AT_upper_bound : 11
 <2><6b8>: Abbrev Number: 0
 <1><6b9>: Abbrev Number: 18 (DW_TAG_subprogram)
    <6ba>   DW_AT_external    : 1
    <6ba>   DW_AT_name        : (indirect string, offset: 0x9f35d): LSM6DS3_Init
    <6be>   DW_AT_decl_file   : 1
    <6bf>   DW_AT_decl_line   : 7
    <6c0>   DW_AT_decl_column : 6
    <6c1>   DW_AT_prototyped  : 1
    <6c1>   DW_AT_low_pc      : 0x80008b4
    <6c5>   DW_AT_high_pc     : 0x54
    <6c9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6cb>   DW_AT_call_all_tail_calls: 1
 <2><6cb>: Abbrev Number: 19 (DW_TAG_variable)
    <6cc>   DW_AT_name        : (indirect string, offset: 0xa0179): result
    <6d0>   DW_AT_decl_file   : 1
    <6d1>   DW_AT_decl_line   : 8
    <6d2>   DW_AT_decl_column : 10
    <6d3>   DW_AT_type        : <0x583>
    <6d7>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><6da>: Abbrev Number: 0
 <1><6db>: Abbrev Number: 0
  Compilation Unit @ offset 0x6dc:
   Length:        0x3d8 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x27b
   Pointer Size:  4
 <0><6e8>: Abbrev Number: 9 (DW_TAG_compile_unit)
    <6e9>   DW_AT_producer    : (indirect string, offset: 0x299ef): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <6ed>   DW_AT_language    : 29	(C11)
    <6ee>   DW_AT_name        : (indirect string, offset: 0xa1e8a): ../Core/Src/Drivers/USART.c
    <6f2>   DW_AT_comp_dir    : (indirect string, offset: 0x57523): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <6f6>   DW_AT_ranges      : 0x4f
    <6fa>   DW_AT_low_pc      : 0
    <6fe>   DW_AT_stmt_list   : 0xed2
    <702>   DW_AT_macros      : 0x1d1cb
 <1><706>: Abbrev Number: 3 (DW_TAG_base_type)
    <707>   DW_AT_byte_size   : 1
    <708>   DW_AT_encoding    : 6	(signed char)
    <709>   DW_AT_name        : (indirect string, offset: 0x4fce6): signed char
 <1><70d>: Abbrev Number: 3 (DW_TAG_base_type)
    <70e>   DW_AT_byte_size   : 1
    <70f>   DW_AT_encoding    : 8	(unsigned char)
    <710>   DW_AT_name        : (indirect string, offset: 0x9827d): unsigned char
 <1><714>: Abbrev Number: 3 (DW_TAG_base_type)
    <715>   DW_AT_byte_size   : 2
    <716>   DW_AT_encoding    : 5	(signed)
    <717>   DW_AT_name        : (indirect string, offset: 0x7583d): short int
 <1><71b>: Abbrev Number: 3 (DW_TAG_base_type)
    <71c>   DW_AT_byte_size   : 2
    <71d>   DW_AT_encoding    : 7	(unsigned)
    <71e>   DW_AT_name        : (indirect string, offset: 0x970ba): short unsigned int
 <1><722>: Abbrev Number: 3 (DW_TAG_base_type)
    <723>   DW_AT_byte_size   : 4
    <724>   DW_AT_encoding    : 5	(signed)
    <725>   DW_AT_name        : (indirect string, offset: 0xcd5a): long int
 <1><729>: Abbrev Number: 6 (DW_TAG_typedef)
    <72a>   DW_AT_name        : (indirect string, offset: 0x652d9): __uint32_t
    <72e>   DW_AT_decl_file   : 2
    <72f>   DW_AT_decl_line   : 79
    <730>   DW_AT_decl_column : 25
    <731>   DW_AT_type        : <0x735>
 <1><735>: Abbrev Number: 3 (DW_TAG_base_type)
    <736>   DW_AT_byte_size   : 4
    <737>   DW_AT_encoding    : 7	(unsigned)
    <738>   DW_AT_name        : (indirect string, offset: 0x3ccb2): long unsigned int
 <1><73c>: Abbrev Number: 3 (DW_TAG_base_type)
    <73d>   DW_AT_byte_size   : 8
    <73e>   DW_AT_encoding    : 5	(signed)
    <73f>   DW_AT_name        : (indirect string, offset: 0x48957): long long int
 <1><743>: Abbrev Number: 3 (DW_TAG_base_type)
    <744>   DW_AT_byte_size   : 8
    <745>   DW_AT_encoding    : 7	(unsigned)
    <746>   DW_AT_name        : (indirect string, offset: 0x20f43): long long unsigned int
 <1><74a>: Abbrev Number: 10 (DW_TAG_base_type)
    <74b>   DW_AT_byte_size   : 4
    <74c>   DW_AT_encoding    : 5	(signed)
    <74d>   DW_AT_name        : int
 <1><751>: Abbrev Number: 3 (DW_TAG_base_type)
    <752>   DW_AT_byte_size   : 4
    <753>   DW_AT_encoding    : 7	(unsigned)
    <754>   DW_AT_name        : (indirect string, offset: 0xc591): unsigned int
 <1><758>: Abbrev Number: 6 (DW_TAG_typedef)
    <759>   DW_AT_name        : (indirect string, offset: 0xd74d4): uint32_t
    <75d>   DW_AT_decl_file   : 3
    <75e>   DW_AT_decl_line   : 48
    <75f>   DW_AT_decl_column : 20
    <760>   DW_AT_type        : <0x729>
 <1><764>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <765>   DW_AT_type        : <0x758>
 <1><769>: Abbrev Number: 4 (DW_TAG_structure_type)
    <76a>   DW_AT_byte_size   : 48
    <76b>   DW_AT_decl_file   : 4
    <76b>   DW_AT_decl_line   : 531
    <76d>   DW_AT_decl_column : 9
    <76d>   DW_AT_sibling     : <0x7f6>
 <2><771>: Abbrev Number: 1 (DW_TAG_member)
    <772>   DW_AT_name        : (indirect string, offset: 0x10f4): MODER
    <776>   DW_AT_decl_file   : 4
    <776>   DW_AT_decl_line   : 533
    <778>   DW_AT_decl_column : 17
    <778>   DW_AT_type        : <0x764>
    <77c>   DW_AT_data_member_location: 0
 <2><77d>: Abbrev Number: 1 (DW_TAG_member)
    <77e>   DW_AT_name        : (indirect string, offset: 0x7a54b): OTYPER
    <782>   DW_AT_decl_file   : 4
    <782>   DW_AT_decl_line   : 534
    <784>   DW_AT_decl_column : 17
    <784>   DW_AT_type        : <0x764>
    <788>   DW_AT_data_member_location: 4
 <2><789>: Abbrev Number: 1 (DW_TAG_member)
    <78a>   DW_AT_name        : (indirect string, offset: 0x89434): OSPEEDR
    <78e>   DW_AT_decl_file   : 4
    <78e>   DW_AT_decl_line   : 535
    <790>   DW_AT_decl_column : 17
    <790>   DW_AT_type        : <0x764>
    <794>   DW_AT_data_member_location: 8
 <2><795>: Abbrev Number: 1 (DW_TAG_member)
    <796>   DW_AT_name        : (indirect string, offset: 0x66ac3): PUPDR
    <79a>   DW_AT_decl_file   : 4
    <79a>   DW_AT_decl_line   : 536
    <79c>   DW_AT_decl_column : 17
    <79c>   DW_AT_type        : <0x764>
    <7a0>   DW_AT_data_member_location: 12
 <2><7a1>: Abbrev Number: 2 (DW_TAG_member)
    <7a2>   DW_AT_name        : IDR
    <7a6>   DW_AT_decl_file   : 4
    <7a6>   DW_AT_decl_line   : 537
    <7a8>   DW_AT_decl_column : 17
    <7a8>   DW_AT_type        : <0x764>
    <7ac>   DW_AT_data_member_location: 16
 <2><7ad>: Abbrev Number: 2 (DW_TAG_member)
    <7ae>   DW_AT_name        : ODR
    <7b2>   DW_AT_decl_file   : 4
    <7b2>   DW_AT_decl_line   : 538
    <7b4>   DW_AT_decl_column : 17
    <7b4>   DW_AT_type        : <0x764>
    <7b8>   DW_AT_data_member_location: 20
 <2><7b9>: Abbrev Number: 1 (DW_TAG_member)
    <7ba>   DW_AT_name        : (indirect string, offset: 0x239c6): BSRR
    <7be>   DW_AT_decl_file   : 4
    <7be>   DW_AT_decl_line   : 539
    <7c0>   DW_AT_decl_column : 17
    <7c0>   DW_AT_type        : <0x764>
    <7c4>   DW_AT_data_member_location: 24
 <2><7c5>: Abbrev Number: 1 (DW_TAG_member)
    <7c6>   DW_AT_name        : (indirect string, offset: 0x877c4): LCKR
    <7ca>   DW_AT_decl_file   : 4
    <7ca>   DW_AT_decl_line   : 540
    <7cc>   DW_AT_decl_column : 17
    <7cc>   DW_AT_type        : <0x764>
    <7d0>   DW_AT_data_member_location: 28
 <2><7d1>: Abbrev Number: 2 (DW_TAG_member)
    <7d2>   DW_AT_name        : AFR
    <7d6>   DW_AT_decl_file   : 4
    <7d6>   DW_AT_decl_line   : 541
    <7d8>   DW_AT_decl_column : 17
    <7d8>   DW_AT_type        : <0x806>
    <7dc>   DW_AT_data_member_location: 32
 <2><7dd>: Abbrev Number: 2 (DW_TAG_member)
    <7de>   DW_AT_name        : BRR
    <7e2>   DW_AT_decl_file   : 4
    <7e2>   DW_AT_decl_line   : 542
    <7e4>   DW_AT_decl_column : 17
    <7e4>   DW_AT_type        : <0x764>
    <7e8>   DW_AT_data_member_location: 40
 <2><7e9>: Abbrev Number: 1 (DW_TAG_member)
    <7ea>   DW_AT_name        : (indirect string, offset: 0x1b92): ASCR
    <7ee>   DW_AT_decl_file   : 4
    <7ee>   DW_AT_decl_line   : 543
    <7f0>   DW_AT_decl_column : 17
    <7f0>   DW_AT_type        : <0x764>
    <7f4>   DW_AT_data_member_location: 44
 <2><7f5>: Abbrev Number: 0
 <1><7f6>: Abbrev Number: 11 (DW_TAG_array_type)
    <7f7>   DW_AT_type        : <0x764>
    <7fb>   DW_AT_sibling     : <0x806>
 <2><7ff>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <800>   DW_AT_type        : <0x751>
    <804>   DW_AT_upper_bound : 1
 <2><805>: Abbrev Number: 0
 <1><806>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <807>   DW_AT_type        : <0x7f6>
 <1><80b>: Abbrev Number: 5 (DW_TAG_typedef)
    <80c>   DW_AT_name        : (indirect string, offset: 0x991cb): GPIO_TypeDef
    <810>   DW_AT_decl_file   : 4
    <810>   DW_AT_decl_line   : 545
    <812>   DW_AT_decl_column : 3
    <812>   DW_AT_type        : <0x769>
 <1><816>: Abbrev Number: 4 (DW_TAG_structure_type)
    <817>   DW_AT_byte_size   : 152
    <818>   DW_AT_decl_file   : 4
    <818>   DW_AT_decl_line   : 685
    <81a>   DW_AT_decl_column : 9
    <81a>   DW_AT_sibling     : <0x9e6>
 <2><81e>: Abbrev Number: 2 (DW_TAG_member)
    <81f>   DW_AT_name        : CR
    <822>   DW_AT_decl_file   : 4
    <822>   DW_AT_decl_line   : 687
    <824>   DW_AT_decl_column : 17
    <824>   DW_AT_type        : <0x764>
    <828>   DW_AT_data_member_location: 0
 <2><829>: Abbrev Number: 1 (DW_TAG_member)
    <82a>   DW_AT_name        : (indirect string, offset: 0x6af01): ICSCR
    <82e>   DW_AT_decl_file   : 4
    <82e>   DW_AT_decl_line   : 688
    <830>   DW_AT_decl_column : 17
    <830>   DW_AT_type        : <0x764>
    <834>   DW_AT_data_member_location: 4
 <2><835>: Abbrev Number: 1 (DW_TAG_member)
    <836>   DW_AT_name        : (indirect string, offset: 0x34674): CFGR
    <83a>   DW_AT_decl_file   : 4
    <83a>   DW_AT_decl_line   : 689
    <83c>   DW_AT_decl_column : 17
    <83c>   DW_AT_type        : <0x764>
    <840>   DW_AT_data_member_location: 8
 <2><841>: Abbrev Number: 1 (DW_TAG_member)
    <842>   DW_AT_name        : (indirect string, offset: 0x6f093): PLLCFGR
    <846>   DW_AT_decl_file   : 4
    <846>   DW_AT_decl_line   : 690
    <848>   DW_AT_decl_column : 17
    <848>   DW_AT_type        : <0x764>
    <84c>   DW_AT_data_member_location: 12
 <2><84d>: Abbrev Number: 1 (DW_TAG_member)
    <84e>   DW_AT_name        : (indirect string, offset: 0x3466d): PLLSAI1CFGR
    <852>   DW_AT_decl_file   : 4
    <852>   DW_AT_decl_line   : 691
    <854>   DW_AT_decl_column : 17
    <854>   DW_AT_type        : <0x764>
    <858>   DW_AT_data_member_location: 16
 <2><859>: Abbrev Number: 1 (DW_TAG_member)
    <85a>   DW_AT_name        : (indirect string, offset: 0x6750c): PLLSAI2CFGR
    <85e>   DW_AT_decl_file   : 4
    <85e>   DW_AT_decl_line   : 692
    <860>   DW_AT_decl_column : 17
    <860>   DW_AT_type        : <0x764>
    <864>   DW_AT_data_member_location: 20
 <2><865>: Abbrev Number: 1 (DW_TAG_member)
    <866>   DW_AT_name        : (indirect string, offset: 0x1e2c): CIER
    <86a>   DW_AT_decl_file   : 4
    <86a>   DW_AT_decl_line   : 693
    <86c>   DW_AT_decl_column : 17
    <86c>   DW_AT_type        : <0x764>
    <870>   DW_AT_data_member_location: 24
 <2><871>: Abbrev Number: 1 (DW_TAG_member)
    <872>   DW_AT_name        : (indirect string, offset: 0x21bc): CIFR
    <876>   DW_AT_decl_file   : 4
    <876>   DW_AT_decl_line   : 694
    <878>   DW_AT_decl_column : 17
    <878>   DW_AT_type        : <0x764>
    <87c>   DW_AT_data_member_location: 28
 <2><87d>: Abbrev Number: 1 (DW_TAG_member)
    <87e>   DW_AT_name        : (indirect string, offset: 0x14c7): CICR
    <882>   DW_AT_decl_file   : 4
    <882>   DW_AT_decl_line   : 695
    <884>   DW_AT_decl_column : 17
    <884>   DW_AT_type        : <0x764>
    <888>   DW_AT_data_member_location: 32
 <2><889>: Abbrev Number: 1 (DW_TAG_member)
    <88a>   DW_AT_name        : (indirect string, offset: 0x94934): RESERVED0
    <88e>   DW_AT_decl_file   : 4
    <88e>   DW_AT_decl_line   : 696
    <890>   DW_AT_decl_column : 17
    <890>   DW_AT_type        : <0x758>
    <894>   DW_AT_data_member_location: 36
 <2><895>: Abbrev Number: 1 (DW_TAG_member)
    <896>   DW_AT_name        : (indirect string, offset: 0x7df1e): AHB1RSTR
    <89a>   DW_AT_decl_file   : 4
    <89a>   DW_AT_decl_line   : 697
    <89c>   DW_AT_decl_column : 17
    <89c>   DW_AT_type        : <0x764>
    <8a0>   DW_AT_data_member_location: 40
 <2><8a1>: Abbrev Number: 1 (DW_TAG_member)
    <8a2>   DW_AT_name        : (indirect string, offset: 0x1d1de): AHB2RSTR
    <8a6>   DW_AT_decl_file   : 4
    <8a6>   DW_AT_decl_line   : 698
    <8a8>   DW_AT_decl_column : 17
    <8a8>   DW_AT_type        : <0x764>
    <8ac>   DW_AT_data_member_location: 44
 <2><8ad>: Abbrev Number: 1 (DW_TAG_member)
    <8ae>   DW_AT_name        : (indirect string, offset: 0x342f4): AHB3RSTR
    <8b2>   DW_AT_decl_file   : 4
    <8b2>   DW_AT_decl_line   : 699
    <8b4>   DW_AT_decl_column : 17
    <8b4>   DW_AT_type        : <0x764>
    <8b8>   DW_AT_data_member_location: 48
 <2><8b9>: Abbrev Number: 1 (DW_TAG_member)
    <8ba>   DW_AT_name        : (indirect string, offset: 0x9493e): RESERVED1
    <8be>   DW_AT_decl_file   : 4
    <8be>   DW_AT_decl_line   : 700
    <8c0>   DW_AT_decl_column : 17
    <8c0>   DW_AT_type        : <0x758>
    <8c4>   DW_AT_data_member_location: 52
 <2><8c5>: Abbrev Number: 1 (DW_TAG_member)
    <8c6>   DW_AT_name        : (indirect string, offset: 0x2025f): APB1RSTR1
    <8ca>   DW_AT_decl_file   : 4
    <8ca>   DW_AT_decl_line   : 701
    <8cc>   DW_AT_decl_column : 17
    <8cc>   DW_AT_type        : <0x764>
    <8d0>   DW_AT_data_member_location: 56
 <2><8d1>: Abbrev Number: 1 (DW_TAG_member)
    <8d2>   DW_AT_name        : (indirect string, offset: 0x20269): APB1RSTR2
    <8d6>   DW_AT_decl_file   : 4
    <8d6>   DW_AT_decl_line   : 702
    <8d8>   DW_AT_decl_column : 17
    <8d8>   DW_AT_type        : <0x764>
    <8dc>   DW_AT_data_member_location: 60
 <2><8dd>: Abbrev Number: 1 (DW_TAG_member)
    <8de>   DW_AT_name        : (indirect string, offset: 0x452d5): APB2RSTR
    <8e2>   DW_AT_decl_file   : 4
    <8e2>   DW_AT_decl_line   : 703
    <8e4>   DW_AT_decl_column : 17
    <8e4>   DW_AT_type        : <0x764>
    <8e8>   DW_AT_data_member_location: 64
 <2><8e9>: Abbrev Number: 1 (DW_TAG_member)
    <8ea>   DW_AT_name        : (indirect string, offset: 0x94948): RESERVED2
    <8ee>   DW_AT_decl_file   : 4
    <8ee>   DW_AT_decl_line   : 704
    <8f0>   DW_AT_decl_column : 17
    <8f0>   DW_AT_type        : <0x758>
    <8f4>   DW_AT_data_member_location: 68
 <2><8f5>: Abbrev Number: 1 (DW_TAG_member)
    <8f6>   DW_AT_name        : (indirect string, offset: 0xc557): AHB1ENR
    <8fa>   DW_AT_decl_file   : 4
    <8fa>   DW_AT_decl_line   : 705
    <8fc>   DW_AT_decl_column : 17
    <8fc>   DW_AT_type        : <0x764>
    <900>   DW_AT_data_member_location: 72
 <2><901>: Abbrev Number: 1 (DW_TAG_member)
    <902>   DW_AT_name        : (indirect string, offset: 0x2a2be): AHB2ENR
    <906>   DW_AT_decl_file   : 4
    <906>   DW_AT_decl_line   : 706
    <908>   DW_AT_decl_column : 17
    <908>   DW_AT_type        : <0x764>
    <90c>   DW_AT_data_member_location: 76
 <2><90d>: Abbrev Number: 1 (DW_TAG_member)
    <90e>   DW_AT_name        : (indirect string, offset: 0x477be): AHB3ENR
    <912>   DW_AT_decl_file   : 4
    <912>   DW_AT_decl_line   : 707
    <914>   DW_AT_decl_column : 17
    <914>   DW_AT_type        : <0x764>
    <918>   DW_AT_data_member_location: 80
 <2><919>: Abbrev Number: 1 (DW_TAG_member)
    <91a>   DW_AT_name        : (indirect string, offset: 0x94952): RESERVED3
    <91e>   DW_AT_decl_file   : 4
    <91e>   DW_AT_decl_line   : 708
    <920>   DW_AT_decl_column : 17
    <920>   DW_AT_type        : <0x758>
    <924>   DW_AT_data_member_location: 84
 <2><925>: Abbrev Number: 1 (DW_TAG_member)
    <926>   DW_AT_name        : (indirect string, offset: 0x5148): APB1ENR1
    <92a>   DW_AT_decl_file   : 4
    <92a>   DW_AT_decl_line   : 709
    <92c>   DW_AT_decl_column : 17
    <92c>   DW_AT_type        : <0x764>
    <930>   DW_AT_data_member_location: 88
 <2><931>: Abbrev Number: 1 (DW_TAG_member)
    <932>   DW_AT_name        : (indirect string, offset: 0x5151): APB1ENR2
    <936>   DW_AT_decl_file   : 4
    <936>   DW_AT_decl_line   : 710
    <938>   DW_AT_decl_column : 17
    <938>   DW_AT_type        : <0x764>
    <93c>   DW_AT_data_member_location: 92
 <2><93d>: Abbrev Number: 1 (DW_TAG_member)
    <93e>   DW_AT_name        : (indirect string, offset: 0x12839): APB2ENR
    <942>   DW_AT_decl_file   : 4
    <942>   DW_AT_decl_line   : 711
    <944>   DW_AT_decl_column : 17
    <944>   DW_AT_type        : <0x764>
    <948>   DW_AT_data_member_location: 96
 <2><949>: Abbrev Number: 1 (DW_TAG_member)
    <94a>   DW_AT_name        : (indirect string, offset: 0x58712): RESERVED4
    <94e>   DW_AT_decl_file   : 4
    <94e>   DW_AT_decl_line   : 712
    <950>   DW_AT_decl_column : 17
    <950>   DW_AT_type        : <0x758>
    <954>   DW_AT_data_member_location: 100
 <2><955>: Abbrev Number: 1 (DW_TAG_member)
    <956>   DW_AT_name        : (indirect string, offset: 0x4921d): AHB1SMENR
    <95a>   DW_AT_decl_file   : 4
    <95a>   DW_AT_decl_line   : 713
    <95c>   DW_AT_decl_column : 17
    <95c>   DW_AT_type        : <0x764>
    <960>   DW_AT_data_member_location: 104
 <2><961>: Abbrev Number: 1 (DW_TAG_member)
    <962>   DW_AT_name        : (indirect string, offset: 0x908da): AHB2SMENR
    <966>   DW_AT_decl_file   : 4
    <966>   DW_AT_decl_line   : 714
    <968>   DW_AT_decl_column : 17
    <968>   DW_AT_type        : <0x764>
    <96c>   DW_AT_data_member_location: 108
 <2><96d>: Abbrev Number: 1 (DW_TAG_member)
    <96e>   DW_AT_name        : (indirect string, offset: 0x3a543): AHB3SMENR
    <972>   DW_AT_decl_file   : 4
    <972>   DW_AT_decl_line   : 715
    <974>   DW_AT_decl_column : 17
    <974>   DW_AT_type        : <0x764>
    <978>   DW_AT_data_member_location: 112
 <2><979>: Abbrev Number: 1 (DW_TAG_member)
    <97a>   DW_AT_name        : (indirect string, offset: 0x94980): RESERVED5
    <97e>   DW_AT_decl_file   : 4
    <97e>   DW_AT_decl_line   : 716
    <980>   DW_AT_decl_column : 17
    <980>   DW_AT_type        : <0x758>
    <984>   DW_AT_data_member_location: 116
 <2><985>: Abbrev Number: 1 (DW_TAG_member)
    <986>   DW_AT_name        : (indirect string, offset: 0x59da): APB1SMENR1
    <98a>   DW_AT_decl_file   : 4
    <98a>   DW_AT_decl_line   : 717
    <98c>   DW_AT_decl_column : 17
    <98c>   DW_AT_type        : <0x764>
    <990>   DW_AT_data_member_location: 120
 <2><991>: Abbrev Number: 1 (DW_TAG_member)
    <992>   DW_AT_name        : (indirect string, offset: 0x59e5): APB1SMENR2
    <996>   DW_AT_decl_file   : 4
    <996>   DW_AT_decl_line   : 718
    <998>   DW_AT_decl_column : 17
    <998>   DW_AT_type        : <0x764>
    <99c>   DW_AT_data_member_location: 124
 <2><99d>: Abbrev Number: 1 (DW_TAG_member)
    <99e>   DW_AT_name        : (indirect string, offset: 0x7f70a): APB2SMENR
    <9a2>   DW_AT_decl_file   : 4
    <9a2>   DW_AT_decl_line   : 719
    <9a4>   DW_AT_decl_column : 17
    <9a4>   DW_AT_type        : <0x764>
    <9a8>   DW_AT_data_member_location: 128
 <2><9a9>: Abbrev Number: 1 (DW_TAG_member)
    <9aa>   DW_AT_name        : (indirect string, offset: 0x9498a): RESERVED6
    <9ae>   DW_AT_decl_file   : 4
    <9ae>   DW_AT_decl_line   : 720
    <9b0>   DW_AT_decl_column : 17
    <9b0>   DW_AT_type        : <0x758>
    <9b4>   DW_AT_data_member_location: 132
 <2><9b5>: Abbrev Number: 1 (DW_TAG_member)
    <9b6>   DW_AT_name        : (indirect string, offset: 0x30a10): CCIPR
    <9ba>   DW_AT_decl_file   : 4
    <9ba>   DW_AT_decl_line   : 721
    <9bc>   DW_AT_decl_column : 17
    <9bc>   DW_AT_type        : <0x764>
    <9c0>   DW_AT_data_member_location: 136
 <2><9c1>: Abbrev Number: 1 (DW_TAG_member)
    <9c2>   DW_AT_name        : (indirect string, offset: 0x94994): RESERVED7
    <9c6>   DW_AT_decl_file   : 4
    <9c6>   DW_AT_decl_line   : 722
    <9c8>   DW_AT_decl_column : 17
    <9c8>   DW_AT_type        : <0x758>
    <9cc>   DW_AT_data_member_location: 140
 <2><9cd>: Abbrev Number: 1 (DW_TAG_member)
    <9ce>   DW_AT_name        : (indirect string, offset: 0x2950e): BDCR
    <9d2>   DW_AT_decl_file   : 4
    <9d2>   DW_AT_decl_line   : 723
    <9d4>   DW_AT_decl_column : 17
    <9d4>   DW_AT_type        : <0x764>
    <9d8>   DW_AT_data_member_location: 144
 <2><9d9>: Abbrev Number: 2 (DW_TAG_member)
    <9da>   DW_AT_name        : CSR
    <9de>   DW_AT_decl_file   : 4
    <9de>   DW_AT_decl_line   : 724
    <9e0>   DW_AT_decl_column : 17
    <9e0>   DW_AT_type        : <0x764>
    <9e4>   DW_AT_data_member_location: 148
 <2><9e5>: Abbrev Number: 0
 <1><9e6>: Abbrev Number: 5 (DW_TAG_typedef)
    <9e7>   DW_AT_name        : (indirect string, offset: 0x49a7b): RCC_TypeDef
    <9eb>   DW_AT_decl_file   : 4
    <9eb>   DW_AT_decl_line   : 725
    <9ed>   DW_AT_decl_column : 3
    <9ed>   DW_AT_type        : <0x816>
 <1><9f1>: Abbrev Number: 4 (DW_TAG_structure_type)
    <9f2>   DW_AT_byte_size   : 44
    <9f3>   DW_AT_decl_file   : 4
    <9f3>   DW_AT_decl_line   : 950
    <9f5>   DW_AT_decl_column : 9
    <9f5>   DW_AT_sibling     : <0xa7e>
 <2><9f9>: Abbrev Number: 2 (DW_TAG_member)
    <9fa>   DW_AT_name        : CR1
    <9fe>   DW_AT_decl_file   : 4
    <9fe>   DW_AT_decl_line   : 952
    <a00>   DW_AT_decl_column : 17
    <a00>   DW_AT_type        : <0x764>
    <a04>   DW_AT_data_member_location: 0
 <2><a05>: Abbrev Number: 2 (DW_TAG_member)
    <a06>   DW_AT_name        : CR2
    <a0a>   DW_AT_decl_file   : 4
    <a0a>   DW_AT_decl_line   : 953
    <a0c>   DW_AT_decl_column : 17
    <a0c>   DW_AT_type        : <0x764>
    <a10>   DW_AT_data_member_location: 4
 <2><a11>: Abbrev Number: 2 (DW_TAG_member)
    <a12>   DW_AT_name        : CR3
    <a16>   DW_AT_decl_file   : 4
    <a16>   DW_AT_decl_line   : 954
    <a18>   DW_AT_decl_column : 17
    <a18>   DW_AT_type        : <0x764>
    <a1c>   DW_AT_data_member_location: 8
 <2><a1d>: Abbrev Number: 2 (DW_TAG_member)
    <a1e>   DW_AT_name        : BRR
    <a22>   DW_AT_decl_file   : 4
    <a22>   DW_AT_decl_line   : 955
    <a24>   DW_AT_decl_column : 17
    <a24>   DW_AT_type        : <0x764>
    <a28>   DW_AT_data_member_location: 12
 <2><a29>: Abbrev Number: 1 (DW_TAG_member)
    <a2a>   DW_AT_name        : (indirect string, offset: 0xa1ea6): GTPR
    <a2e>   DW_AT_decl_file   : 4
    <a2e>   DW_AT_decl_line   : 956
    <a30>   DW_AT_decl_column : 17
    <a30>   DW_AT_type        : <0x764>
    <a34>   DW_AT_data_member_location: 16
 <2><a35>: Abbrev Number: 1 (DW_TAG_member)
    <a36>   DW_AT_name        : (indirect string, offset: 0xa1eab): RTOR
    <a3a>   DW_AT_decl_file   : 4
    <a3a>   DW_AT_decl_line   : 957
    <a3c>   DW_AT_decl_column : 17
    <a3c>   DW_AT_type        : <0x764>
    <a40>   DW_AT_data_member_location: 20
 <2><a41>: Abbrev Number: 2 (DW_TAG_member)
    <a42>   DW_AT_name        : RQR
    <a46>   DW_AT_decl_file   : 4
    <a46>   DW_AT_decl_line   : 958
    <a48>   DW_AT_decl_column : 17
    <a48>   DW_AT_type        : <0x764>
    <a4c>   DW_AT_data_member_location: 24
 <2><a4d>: Abbrev Number: 2 (DW_TAG_member)
    <a4e>   DW_AT_name        : ISR
    <a52>   DW_AT_decl_file   : 4
    <a52>   DW_AT_decl_line   : 959
    <a54>   DW_AT_decl_column : 17
    <a54>   DW_AT_type        : <0x764>
    <a58>   DW_AT_data_member_location: 28
 <2><a59>: Abbrev Number: 2 (DW_TAG_member)
    <a5a>   DW_AT_name        : ICR
    <a5e>   DW_AT_decl_file   : 4
    <a5e>   DW_AT_decl_line   : 960
    <a60>   DW_AT_decl_column : 17
    <a60>   DW_AT_type        : <0x764>
    <a64>   DW_AT_data_member_location: 32
 <2><a65>: Abbrev Number: 2 (DW_TAG_member)
    <a66>   DW_AT_name        : RDR
    <a6a>   DW_AT_decl_file   : 4
    <a6a>   DW_AT_decl_line   : 961
    <a6c>   DW_AT_decl_column : 17
    <a6c>   DW_AT_type        : <0x764>
    <a70>   DW_AT_data_member_location: 36
 <2><a71>: Abbrev Number: 2 (DW_TAG_member)
    <a72>   DW_AT_name        : TDR
    <a76>   DW_AT_decl_file   : 4
    <a76>   DW_AT_decl_line   : 962
    <a78>   DW_AT_decl_column : 17
    <a78>   DW_AT_type        : <0x764>
    <a7c>   DW_AT_data_member_location: 40
 <2><a7d>: Abbrev Number: 0
 <1><a7e>: Abbrev Number: 5 (DW_TAG_typedef)
    <a7f>   DW_AT_name        : (indirect string, offset: 0xa1ebd): USART_TypeDef
    <a83>   DW_AT_decl_file   : 4
    <a83>   DW_AT_decl_line   : 963
    <a85>   DW_AT_decl_column : 3
    <a85>   DW_AT_type        : <0x9f1>
 <1><a89>: Abbrev Number: 3 (DW_TAG_base_type)
    <a8a>   DW_AT_byte_size   : 8
    <a8b>   DW_AT_encoding    : 4	(float)
    <a8c>   DW_AT_name        : (indirect string, offset: 0x9e78c): long double
 <1><a90>: Abbrev Number: 3 (DW_TAG_base_type)
    <a91>   DW_AT_byte_size   : 1
    <a92>   DW_AT_encoding    : 8	(unsigned char)
    <a93>   DW_AT_name        : (indirect string, offset: 0xb968d): char
 <1><a97>: Abbrev Number: 8 (DW_TAG_subprogram)
    <a98>   DW_AT_external    : 1
    <a98>   DW_AT_name        : (indirect string, offset: 0xa1eb0): USART2_Print
    <a9c>   DW_AT_decl_file   : 1
    <a9c>   DW_AT_decl_line   : 48
    <a9d>   DW_AT_decl_column : 6
    <a9d>   DW_AT_prototyped  : 1
    <a9d>   DW_AT_low_pc      : 0x8000a74
    <aa1>   DW_AT_high_pc     : 0x28
    <aa5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <aa7>   DW_AT_call_all_calls: 1
 <1><aa7>: Abbrev Number: 8 (DW_TAG_subprogram)
    <aa8>   DW_AT_external    : 1
    <aa8>   DW_AT_name        : (indirect string, offset: 0xa1e7c): USART2_Config
    <aac>   DW_AT_decl_file   : 1
    <aac>   DW_AT_decl_line   : 7
    <aad>   DW_AT_decl_column : 6
    <aad>   DW_AT_prototyped  : 1
    <aad>   DW_AT_low_pc      : 0x8000994
    <ab1>   DW_AT_high_pc     : 0xe0
    <ab5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ab7>   DW_AT_call_all_calls: 1
 <1><ab7>: Abbrev Number: 0
  Compilation Unit @ offset 0xab8:
   Length:        0x126 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x332
   Pointer Size:  4
 <0><ac4>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <ac5>   DW_AT_producer    : (indirect string, offset: 0x299ef): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <ac9>   DW_AT_language    : 29	(C11)
    <aca>   DW_AT_name        : (indirect string, offset: 0xbc7b8): ../Core/Src/freertos_hooks.c
    <ace>   DW_AT_comp_dir    : (indirect string, offset: 0x57523): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <ad2>   DW_AT_ranges      : 0x69
    <ad6>   DW_AT_low_pc      : 0
    <ada>   DW_AT_stmt_list   : 0x15cf
    <ade>   DW_AT_macros      : 0x1d3f4
 <1><ae2>: Abbrev Number: 7 (DW_TAG_base_type)
    <ae3>   DW_AT_byte_size   : 4
    <ae4>   DW_AT_encoding    : 5	(signed)
    <ae5>   DW_AT_name        : int
 <1><ae9>: Abbrev Number: 1 (DW_TAG_base_type)
    <aea>   DW_AT_byte_size   : 4
    <aeb>   DW_AT_encoding    : 7	(unsigned)
    <aec>   DW_AT_name        : (indirect string, offset: 0xc591): unsigned int
 <1><af0>: Abbrev Number: 1 (DW_TAG_base_type)
    <af1>   DW_AT_byte_size   : 8
    <af2>   DW_AT_encoding    : 5	(signed)
    <af3>   DW_AT_name        : (indirect string, offset: 0x48957): long long int
 <1><af7>: Abbrev Number: 1 (DW_TAG_base_type)
    <af8>   DW_AT_byte_size   : 8
    <af9>   DW_AT_encoding    : 4	(float)
    <afa>   DW_AT_name        : (indirect string, offset: 0x9e78c): long double
 <1><afe>: Abbrev Number: 1 (DW_TAG_base_type)
    <aff>   DW_AT_byte_size   : 1
    <b00>   DW_AT_encoding    : 6	(signed char)
    <b01>   DW_AT_name        : (indirect string, offset: 0x4fce6): signed char
 <1><b05>: Abbrev Number: 2 (DW_TAG_typedef)
    <b06>   DW_AT_name        : (indirect string, offset: 0x2e54f): __uint8_t
    <b0a>   DW_AT_decl_file   : 2
    <b0b>   DW_AT_decl_line   : 43
    <b0c>   DW_AT_decl_column : 24
    <b0d>   DW_AT_type        : <0xb11>
 <1><b11>: Abbrev Number: 1 (DW_TAG_base_type)
    <b12>   DW_AT_byte_size   : 1
    <b13>   DW_AT_encoding    : 8	(unsigned char)
    <b14>   DW_AT_name        : (indirect string, offset: 0x9827d): unsigned char
 <1><b18>: Abbrev Number: 1 (DW_TAG_base_type)
    <b19>   DW_AT_byte_size   : 2
    <b1a>   DW_AT_encoding    : 5	(signed)
    <b1b>   DW_AT_name        : (indirect string, offset: 0x7583d): short int
 <1><b1f>: Abbrev Number: 1 (DW_TAG_base_type)
    <b20>   DW_AT_byte_size   : 2
    <b21>   DW_AT_encoding    : 7	(unsigned)
    <b22>   DW_AT_name        : (indirect string, offset: 0x970ba): short unsigned int
 <1><b26>: Abbrev Number: 1 (DW_TAG_base_type)
    <b27>   DW_AT_byte_size   : 4
    <b28>   DW_AT_encoding    : 5	(signed)
    <b29>   DW_AT_name        : (indirect string, offset: 0xcd5a): long int
 <1><b2d>: Abbrev Number: 1 (DW_TAG_base_type)
    <b2e>   DW_AT_byte_size   : 4
    <b2f>   DW_AT_encoding    : 7	(unsigned)
    <b30>   DW_AT_name        : (indirect string, offset: 0x3ccb2): long unsigned int
 <1><b34>: Abbrev Number: 1 (DW_TAG_base_type)
    <b35>   DW_AT_byte_size   : 8
    <b36>   DW_AT_encoding    : 7	(unsigned)
    <b37>   DW_AT_name        : (indirect string, offset: 0x20f43): long long unsigned int
 <1><b3b>: Abbrev Number: 2 (DW_TAG_typedef)
    <b3c>   DW_AT_name        : (indirect string, offset: 0x2e551): uint8_t
    <b40>   DW_AT_decl_file   : 3
    <b41>   DW_AT_decl_line   : 24
    <b42>   DW_AT_decl_column : 19
    <b43>   DW_AT_type        : <0xb05>
 <1><b47>: Abbrev Number: 3 (DW_TAG_const_type)
    <b48>   DW_AT_type        : <0xb3b>
 <1><b4c>: Abbrev Number: 2 (DW_TAG_typedef)
    <b4d>   DW_AT_name        : (indirect string, offset: 0xe2422): TaskHandle_t
    <b51>   DW_AT_decl_file   : 4
    <b52>   DW_AT_decl_line   : 95
    <b53>   DW_AT_decl_column : 46
    <b54>   DW_AT_type        : <0xb58>
 <1><b58>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b59>   DW_AT_byte_size   : 4
    <b59>   DW_AT_type        : <0xb5d>
 <1><b5d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <b5e>   DW_AT_name        : (indirect string, offset: 0xe0867): tskTaskControlBlock
    <b62>   DW_AT_declaration : 1
 <1><b62>: Abbrev Number: 1 (DW_TAG_base_type)
    <b63>   DW_AT_byte_size   : 1
    <b64>   DW_AT_encoding    : 8	(unsigned char)
    <b65>   DW_AT_name        : (indirect string, offset: 0xb968d): char
 <1><b69>: Abbrev Number: 9 (DW_TAG_array_type)
    <b6a>   DW_AT_type        : <0xb47>
    <b6e>   DW_AT_sibling     : <0xb79>
 <2><b72>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <b73>   DW_AT_type        : <0xae9>
    <b77>   DW_AT_upper_bound : 6
 <2><b78>: Abbrev Number: 0
 <1><b79>: Abbrev Number: 3 (DW_TAG_const_type)
    <b7a>   DW_AT_type        : <0xb69>
 <1><b7e>: Abbrev Number: 11 (DW_TAG_variable)
    <b7f>   DW_AT_name        : (indirect string, offset: 0xb07e3): CHANNEL_OFFSET_TAB
    <b83>   DW_AT_decl_file   : 5
    <b84>   DW_AT_decl_line   : 49
    <b85>   DW_AT_decl_column : 22
    <b86>   DW_AT_type        : <0xb79>
    <b8a>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><b90>: Abbrev Number: 12 (DW_TAG_subprogram)
    <b91>   DW_AT_external    : 1
    <b91>   DW_AT_name        : (indirect string, offset: 0xba679): HAL_IncTick
    <b95>   DW_AT_decl_file   : 6
    <b96>   DW_AT_decl_line   : 651
    <b98>   DW_AT_decl_column : 20
    <b99>   DW_AT_prototyped  : 1
    <b99>   DW_AT_declaration : 1
 <1><b99>: Abbrev Number: 13 (DW_TAG_subprogram)
    <b9a>   DW_AT_external    : 1
    <b9a>   DW_AT_name        : (indirect string, offset: 0xc1863): vApplicationTickHook
    <b9e>   DW_AT_decl_file   : 1
    <b9f>   DW_AT_decl_line   : 11
    <ba0>   DW_AT_decl_column : 6
    <ba1>   DW_AT_prototyped  : 1
    <ba1>   DW_AT_low_pc      : 0x8000aaa
    <ba5>   DW_AT_high_pc     : 0xc
    <ba9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bab>   DW_AT_call_all_tail_calls: 1
 <1><bab>: Abbrev Number: 14 (DW_TAG_subprogram)
    <bac>   DW_AT_external    : 1
    <bac>   DW_AT_name        : (indirect string, offset: 0xbc2a9): vApplicationStackOverflowHook
    <bb0>   DW_AT_decl_file   : 1
    <bb1>   DW_AT_decl_line   : 5
    <bb2>   DW_AT_decl_column : 6
    <bb3>   DW_AT_prototyped  : 1
    <bb3>   DW_AT_low_pc      : 0x8000a9c
    <bb7>   DW_AT_high_pc     : 0xe
    <bbb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bbd>   DW_AT_call_all_calls: 1
    <bbd>   DW_AT_sibling     : <0xbdc>
 <2><bc1>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <bc2>   DW_AT_name        : (indirect string, offset: 0xd6f7f): xTask
    <bc6>   DW_AT_decl_file   : 1
    <bc6>   DW_AT_decl_line   : 5
    <bc6>   DW_AT_decl_column : 49
    <bc7>   DW_AT_type        : <0xb4c>
    <bcb>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><bce>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <bcf>   DW_AT_name        : (indirect string, offset: 0xbacd6): pcTaskName
    <bd3>   DW_AT_decl_file   : 1
    <bd3>   DW_AT_decl_line   : 5
    <bd3>   DW_AT_decl_column : 62
    <bd4>   DW_AT_type        : <0xbdc>
    <bd8>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><bdb>: Abbrev Number: 0
 <1><bdc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdd>   DW_AT_byte_size   : 4
    <bdd>   DW_AT_type        : <0xb62>
 <1><be1>: Abbrev Number: 0
  Compilation Unit @ offset 0xbe2:
   Length:        0x819 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x404
   Pointer Size:  4
 <0><bee>: Abbrev Number: 23 (DW_TAG_compile_unit)
    <bef>   DW_AT_producer    : (indirect string, offset: 0x299ef): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <bf3>   DW_AT_language    : 29	(C11)
    <bf4>   DW_AT_name        : (indirect string, offset: 0xec643): ../Core/Src/main.c
    <bf8>   DW_AT_comp_dir    : (indirect string, offset: 0x57523): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <bfc>   DW_AT_ranges      : 0x82
    <c00>   DW_AT_low_pc      : 0
    <c04>   DW_AT_stmt_list   : 0x1d90
    <c08>   DW_AT_macros      : 0x25f30
 <1><c0c>: Abbrev Number: 5 (DW_TAG_base_type)
    <c0d>   DW_AT_byte_size   : 1
    <c0e>   DW_AT_encoding    : 6	(signed char)
    <c0f>   DW_AT_name        : (indirect string, offset: 0x4fce6): signed char
 <1><c13>: Abbrev Number: 3 (DW_TAG_typedef)
    <c14>   DW_AT_name        : (indirect string, offset: 0x2e54f): __uint8_t
    <c18>   DW_AT_decl_file   : 3
    <c19>   DW_AT_decl_line   : 43
    <c1a>   DW_AT_decl_column : 24
    <c1b>   DW_AT_type        : <0xc1f>
 <1><c1f>: Abbrev Number: 5 (DW_TAG_base_type)
    <c20>   DW_AT_byte_size   : 1
    <c21>   DW_AT_encoding    : 8	(unsigned char)
    <c22>   DW_AT_name        : (indirect string, offset: 0x9827d): unsigned char
 <1><c26>: Abbrev Number: 3 (DW_TAG_typedef)
    <c27>   DW_AT_name        : (indirect string, offset: 0x9ed39): __int16_t
    <c2b>   DW_AT_decl_file   : 3
    <c2c>   DW_AT_decl_line   : 55
    <c2d>   DW_AT_decl_column : 24
    <c2e>   DW_AT_type        : <0xc32>
 <1><c32>: Abbrev Number: 5 (DW_TAG_base_type)
    <c33>   DW_AT_byte_size   : 2
    <c34>   DW_AT_encoding    : 5	(signed)
    <c35>   DW_AT_name        : (indirect string, offset: 0x7583d): short int
 <1><c39>: Abbrev Number: 5 (DW_TAG_base_type)
    <c3a>   DW_AT_byte_size   : 2
    <c3b>   DW_AT_encoding    : 7	(unsigned)
    <c3c>   DW_AT_name        : (indirect string, offset: 0x970ba): short unsigned int
 <1><c40>: Abbrev Number: 5 (DW_TAG_base_type)
    <c41>   DW_AT_byte_size   : 4
    <c42>   DW_AT_encoding    : 5	(signed)
    <c43>   DW_AT_name        : (indirect string, offset: 0xcd5a): long int
 <1><c47>: Abbrev Number: 3 (DW_TAG_typedef)
    <c48>   DW_AT_name        : (indirect string, offset: 0x652d9): __uint32_t
    <c4c>   DW_AT_decl_file   : 3
    <c4d>   DW_AT_decl_line   : 79
    <c4e>   DW_AT_decl_column : 25
    <c4f>   DW_AT_type        : <0xc53>
 <1><c53>: Abbrev Number: 5 (DW_TAG_base_type)
    <c54>   DW_AT_byte_size   : 4
    <c55>   DW_AT_encoding    : 7	(unsigned)
    <c56>   DW_AT_name        : (indirect string, offset: 0x3ccb2): long unsigned int
 <1><c5a>: Abbrev Number: 5 (DW_TAG_base_type)
    <c5b>   DW_AT_byte_size   : 8
    <c5c>   DW_AT_encoding    : 5	(signed)
    <c5d>   DW_AT_name        : (indirect string, offset: 0x48957): long long int
 <1><c61>: Abbrev Number: 3 (DW_TAG_typedef)
    <c62>   DW_AT_name        : (indirect string, offset: 0xec4f1): __uint64_t
    <c66>   DW_AT_decl_file   : 3
    <c67>   DW_AT_decl_line   : 105
    <c68>   DW_AT_decl_column : 25
    <c69>   DW_AT_type        : <0xc6d>
 <1><c6d>: Abbrev Number: 5 (DW_TAG_base_type)
    <c6e>   DW_AT_byte_size   : 8
    <c6f>   DW_AT_encoding    : 7	(unsigned)
    <c70>   DW_AT_name        : (indirect string, offset: 0x20f43): long long unsigned int
 <1><c74>: Abbrev Number: 24 (DW_TAG_base_type)
    <c75>   DW_AT_byte_size   : 4
    <c76>   DW_AT_encoding    : 5	(signed)
    <c77>   DW_AT_name        : int
 <1><c7b>: Abbrev Number: 5 (DW_TAG_base_type)
    <c7c>   DW_AT_byte_size   : 4
    <c7d>   DW_AT_encoding    : 7	(unsigned)
    <c7e>   DW_AT_name        : (indirect string, offset: 0xc591): unsigned int
 <1><c82>: Abbrev Number: 5 (DW_TAG_base_type)
    <c83>   DW_AT_byte_size   : 8
    <c84>   DW_AT_encoding    : 4	(float)
    <c85>   DW_AT_name        : (indirect string, offset: 0x9e78c): long double
 <1><c89>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <c8a>   DW_AT_byte_size   : 4
 <1><c8b>: Abbrev Number: 6 (DW_TAG_const_type)
    <c8c>   DW_AT_type        : <0xc89>
 <1><c90>: Abbrev Number: 5 (DW_TAG_base_type)
    <c91>   DW_AT_byte_size   : 1
    <c92>   DW_AT_encoding    : 8	(unsigned char)
    <c93>   DW_AT_name        : (indirect string, offset: 0xb968d): char
 <1><c97>: Abbrev Number: 6 (DW_TAG_const_type)
    <c98>   DW_AT_type        : <0xc90>
 <1><c9c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <c9d>   DW_AT_byte_size   : 4
    <c9d>   DW_AT_type        : <0xc97>
 <1><ca1>: Abbrev Number: 6 (DW_TAG_const_type)
    <ca2>   DW_AT_type        : <0xc9c>
 <1><ca6>: Abbrev Number: 3 (DW_TAG_typedef)
    <ca7>   DW_AT_name        : (indirect string, offset: 0x2e551): uint8_t
    <cab>   DW_AT_decl_file   : 4
    <cac>   DW_AT_decl_line   : 24
    <cad>   DW_AT_decl_column : 19
    <cae>   DW_AT_type        : <0xc13>
 <1><cb2>: Abbrev Number: 6 (DW_TAG_const_type)
    <cb3>   DW_AT_type        : <0xca6>
 <1><cb7>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb8>   DW_AT_name        : (indirect string, offset: 0x9ed3b): int16_t
    <cbc>   DW_AT_decl_file   : 4
    <cbd>   DW_AT_decl_line   : 32
    <cbe>   DW_AT_decl_column : 19
    <cbf>   DW_AT_type        : <0xc26>
 <1><cc3>: Abbrev Number: 3 (DW_TAG_typedef)
    <cc4>   DW_AT_name        : (indirect string, offset: 0xd74d4): uint32_t
    <cc8>   DW_AT_decl_file   : 4
    <cc9>   DW_AT_decl_line   : 48
    <cca>   DW_AT_decl_column : 20
    <ccb>   DW_AT_type        : <0xc47>
 <1><ccf>: Abbrev Number: 16 (DW_TAG_volatile_type)
    <cd0>   DW_AT_type        : <0xcc3>
 <1><cd4>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd5>   DW_AT_name        : (indirect string, offset: 0xec4f3): uint64_t
    <cd9>   DW_AT_decl_file   : 4
    <cda>   DW_AT_decl_line   : 60
    <cdb>   DW_AT_decl_column : 20
    <cdc>   DW_AT_type        : <0xc61>
 <1><ce0>: Abbrev Number: 17 (DW_TAG_structure_type)
    <ce1>   DW_AT_byte_size   : 48
    <ce2>   DW_AT_decl_file   : 5
    <ce2>   DW_AT_decl_line   : 531
    <ce4>   DW_AT_decl_column : 9
    <ce4>   DW_AT_sibling     : <0xd6d>
 <2><ce8>: Abbrev Number: 1 (DW_TAG_member)
    <ce9>   DW_AT_name        : (indirect string, offset: 0x10f4): MODER
    <ced>   DW_AT_decl_file   : 5
    <ced>   DW_AT_decl_line   : 533
    <cef>   DW_AT_decl_column : 17
    <cef>   DW_AT_type        : <0xccf>
    <cf3>   DW_AT_data_member_location: 0
 <2><cf4>: Abbrev Number: 1 (DW_TAG_member)
    <cf5>   DW_AT_name        : (indirect string, offset: 0x7a54b): OTYPER
    <cf9>   DW_AT_decl_file   : 5
    <cf9>   DW_AT_decl_line   : 534
    <cfb>   DW_AT_decl_column : 17
    <cfb>   DW_AT_type        : <0xccf>
    <cff>   DW_AT_data_member_location: 4
 <2><d00>: Abbrev Number: 1 (DW_TAG_member)
    <d01>   DW_AT_name        : (indirect string, offset: 0x89434): OSPEEDR
    <d05>   DW_AT_decl_file   : 5
    <d05>   DW_AT_decl_line   : 535
    <d07>   DW_AT_decl_column : 17
    <d07>   DW_AT_type        : <0xccf>
    <d0b>   DW_AT_data_member_location: 8
 <2><d0c>: Abbrev Number: 1 (DW_TAG_member)
    <d0d>   DW_AT_name        : (indirect string, offset: 0x66ac3): PUPDR
    <d11>   DW_AT_decl_file   : 5
    <d11>   DW_AT_decl_line   : 536
    <d13>   DW_AT_decl_column : 17
    <d13>   DW_AT_type        : <0xccf>
    <d17>   DW_AT_data_member_location: 12
 <2><d18>: Abbrev Number: 10 (DW_TAG_member)
    <d19>   DW_AT_name        : IDR
    <d1d>   DW_AT_decl_file   : 5
    <d1d>   DW_AT_decl_line   : 537
    <d1f>   DW_AT_decl_column : 17
    <d1f>   DW_AT_type        : <0xccf>
    <d23>   DW_AT_data_member_location: 16
 <2><d24>: Abbrev Number: 10 (DW_TAG_member)
    <d25>   DW_AT_name        : ODR
    <d29>   DW_AT_decl_file   : 5
    <d29>   DW_AT_decl_line   : 538
    <d2b>   DW_AT_decl_column : 17
    <d2b>   DW_AT_type        : <0xccf>
    <d2f>   DW_AT_data_member_location: 20
 <2><d30>: Abbrev Number: 1 (DW_TAG_member)
    <d31>   DW_AT_name        : (indirect string, offset: 0x239c6): BSRR
    <d35>   DW_AT_decl_file   : 5
    <d35>   DW_AT_decl_line   : 539
    <d37>   DW_AT_decl_column : 17
    <d37>   DW_AT_type        : <0xccf>
    <d3b>   DW_AT_data_member_location: 24
 <2><d3c>: Abbrev Number: 1 (DW_TAG_member)
    <d3d>   DW_AT_name        : (indirect string, offset: 0x877c4): LCKR
    <d41>   DW_AT_decl_file   : 5
    <d41>   DW_AT_decl_line   : 540
    <d43>   DW_AT_decl_column : 17
    <d43>   DW_AT_type        : <0xccf>
    <d47>   DW_AT_data_member_location: 28
 <2><d48>: Abbrev Number: 10 (DW_TAG_member)
    <d49>   DW_AT_name        : AFR
    <d4d>   DW_AT_decl_file   : 5
    <d4d>   DW_AT_decl_line   : 541
    <d4f>   DW_AT_decl_column : 17
    <d4f>   DW_AT_type        : <0xd7d>
    <d53>   DW_AT_data_member_location: 32
 <2><d54>: Abbrev Number: 10 (DW_TAG_member)
    <d55>   DW_AT_name        : BRR
    <d59>   DW_AT_decl_file   : 5
    <d59>   DW_AT_decl_line   : 542
    <d5b>   DW_AT_decl_column : 17
    <d5b>   DW_AT_type        : <0xccf>
    <d5f>   DW_AT_data_member_location: 40
 <2><d60>: Abbrev Number: 1 (DW_TAG_member)
    <d61>   DW_AT_name        : (indirect string, offset: 0x1b92): ASCR
    <d65>   DW_AT_decl_file   : 5
    <d65>   DW_AT_decl_line   : 543
    <d67>   DW_AT_decl_column : 17
    <d67>   DW_AT_type        : <0xccf>
    <d6b>   DW_AT_data_member_location: 44
 <2><d6c>: Abbrev Number: 0
 <1><d6d>: Abbrev Number: 18 (DW_TAG_array_type)
    <d6e>   DW_AT_type        : <0xccf>
    <d72>   DW_AT_sibling     : <0xd7d>
 <2><d76>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <d77>   DW_AT_type        : <0xc7b>
    <d7b>   DW_AT_upper_bound : 1
 <2><d7c>: Abbrev Number: 0
 <1><d7d>: Abbrev Number: 16 (DW_TAG_volatile_type)
    <d7e>   DW_AT_type        : <0xd6d>
 <1><d82>: Abbrev Number: 20 (DW_TAG_typedef)
    <d83>   DW_AT_name        : (indirect string, offset: 0x991cb): GPIO_TypeDef
    <d87>   DW_AT_decl_file   : 5
    <d87>   DW_AT_decl_line   : 545
    <d89>   DW_AT_decl_column : 3
    <d89>   DW_AT_type        : <0xce0>
 <1><d8d>: Abbrev Number: 17 (DW_TAG_structure_type)
    <d8e>   DW_AT_byte_size   : 152
    <d8f>   DW_AT_decl_file   : 5
    <d8f>   DW_AT_decl_line   : 685
    <d91>   DW_AT_decl_column : 9
    <d91>   DW_AT_sibling     : <0xf5d>
 <2><d95>: Abbrev Number: 10 (DW_TAG_member)
    <d96>   DW_AT_name        : CR
    <d99>   DW_AT_decl_file   : 5
    <d99>   DW_AT_decl_line   : 687
    <d9b>   DW_AT_decl_column : 17
    <d9b>   DW_AT_type        : <0xccf>
    <d9f>   DW_AT_data_member_location: 0
 <2><da0>: Abbrev Number: 1 (DW_TAG_member)
    <da1>   DW_AT_name        : (indirect string, offset: 0x6af01): ICSCR
    <da5>   DW_AT_decl_file   : 5
    <da5>   DW_AT_decl_line   : 688
    <da7>   DW_AT_decl_column : 17
    <da7>   DW_AT_type        : <0xccf>
    <dab>   DW_AT_data_member_location: 4
 <2><dac>: Abbrev Number: 1 (DW_TAG_member)
    <dad>   DW_AT_name        : (indirect string, offset: 0x34674): CFGR
    <db1>   DW_AT_decl_file   : 5
    <db1>   DW_AT_decl_line   : 689
    <db3>   DW_AT_decl_column : 17
    <db3>   DW_AT_type        : <0xccf>
    <db7>   DW_AT_data_member_location: 8
 <2><db8>: Abbrev Number: 1 (DW_TAG_member)
    <db9>   DW_AT_name        : (indirect string, offset: 0x6f093): PLLCFGR
    <dbd>   DW_AT_decl_file   : 5
    <dbd>   DW_AT_decl_line   : 690
    <dbf>   DW_AT_decl_column : 17
    <dbf>   DW_AT_type        : <0xccf>
    <dc3>   DW_AT_data_member_location: 12
 <2><dc4>: Abbrev Number: 1 (DW_TAG_member)
    <dc5>   DW_AT_name        : (indirect string, offset: 0x3466d): PLLSAI1CFGR
    <dc9>   DW_AT_decl_file   : 5
    <dc9>   DW_AT_decl_line   : 691
    <dcb>   DW_AT_decl_column : 17
    <dcb>   DW_AT_type        : <0xccf>
    <dcf>   DW_AT_data_member_location: 16
 <2><dd0>: Abbrev Number: 1 (DW_TAG_member)
    <dd1>   DW_AT_name        : (indirect string, offset: 0x6750c): PLLSAI2CFGR
    <dd5>   DW_AT_decl_file   : 5
    <dd5>   DW_AT_decl_line   : 692
    <dd7>   DW_AT_decl_column : 17
    <dd7>   DW_AT_type        : <0xccf>
    <ddb>   DW_AT_data_member_location: 20
 <2><ddc>: Abbrev Number: 1 (DW_TAG_member)
    <ddd>   DW_AT_name        : (indirect string, offset: 0x1e2c): CIER
    <de1>   DW_AT_decl_file   : 5
    <de1>   DW_AT_decl_line   : 693
    <de3>   DW_AT_decl_column : 17
    <de3>   DW_AT_type        : <0xccf>
    <de7>   DW_AT_data_member_location: 24
 <2><de8>: Abbrev Number: 1 (DW_TAG_member)
    <de9>   DW_AT_name        : (indirect string, offset: 0x21bc): CIFR
    <ded>   DW_AT_decl_file   : 5
    <ded>   DW_AT_decl_line   : 694
    <def>   DW_AT_decl_column : 17
    <def>   DW_AT_type        : <0xccf>
    <df3>   DW_AT_data_member_location: 28
 <2><df4>: Abbrev Number: 1 (DW_TAG_member)
    <df5>   DW_AT_name        : (indirect string, offset: 0x14c7): CICR
    <df9>   DW_AT_decl_file   : 5
    <df9>   DW_AT_decl_line   : 695
    <dfb>   DW_AT_decl_column : 17
    <dfb>   DW_AT_type        : <0xccf>
    <dff>   DW_AT_data_member_location: 32
 <2><e00>: Abbrev Number: 1 (DW_TAG_member)
    <e01>   DW_AT_name        : (indirect string, offset: 0x94934): RESERVED0
    <e05>   DW_AT_decl_file   : 5
    <e05>   DW_AT_decl_line   : 696
    <e07>   DW_AT_decl_column : 17
    <e07>   DW_AT_type        : <0xcc3>
    <e0b>   DW_AT_data_member_location: 36
 <2><e0c>: Abbrev Number: 1 (DW_TAG_member)
    <e0d>   DW_AT_name        : (indirect string, offset: 0x7df1e): AHB1RSTR
    <e11>   DW_AT_decl_file   : 5
    <e11>   DW_AT_decl_line   : 697
    <e13>   DW_AT_decl_column : 17
    <e13>   DW_AT_type        : <0xccf>
    <e17>   DW_AT_data_member_location: 40
 <2><e18>: Abbrev Number: 1 (DW_TAG_member)
    <e19>   DW_AT_name        : (indirect string, offset: 0x1d1de): AHB2RSTR
    <e1d>   DW_AT_decl_file   : 5
    <e1d>   DW_AT_decl_line   : 698
    <e1f>   DW_AT_decl_column : 17
    <e1f>   DW_AT_type        : <0xccf>
    <e23>   DW_AT_data_member_location: 44
 <2><e24>: Abbrev Number: 1 (DW_TAG_member)
    <e25>   DW_AT_name        : (indirect string, offset: 0x342f4): AHB3RSTR
    <e29>   DW_AT_decl_file   : 5
    <e29>   DW_AT_decl_line   : 699
    <e2b>   DW_AT_decl_column : 17
    <e2b>   DW_AT_type        : <0xccf>
    <e2f>   DW_AT_data_member_location: 48
 <2><e30>: Abbrev Number: 1 (DW_TAG_member)
    <e31>   DW_AT_name        : (indirect string, offset: 0x9493e): RESERVED1
    <e35>   DW_AT_decl_file   : 5
    <e35>   DW_AT_decl_line   : 700
    <e37>   DW_AT_decl_column : 17
    <e37>   DW_AT_type        : <0xcc3>
    <e3b>   DW_AT_data_member_location: 52
 <2><e3c>: Abbrev Number: 1 (DW_TAG_member)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x2025f): APB1RSTR1
    <e41>   DW_AT_decl_file   : 5
    <e41>   DW_AT_decl_line   : 701
    <e43>   DW_AT_decl_column : 17
    <e43>   DW_AT_type        : <0xccf>
    <e47>   DW_AT_data_member_location: 56
 <2><e48>: Abbrev Number: 1 (DW_TAG_member)
    <e49>   DW_AT_name        : (indirect string, offset: 0x20269): APB1RSTR2
    <e4d>   DW_AT_decl_file   : 5
    <e4d>   DW_AT_decl_line   : 702
    <e4f>   DW_AT_decl_column : 17
    <e4f>   DW_AT_type        : <0xccf>
    <e53>   DW_AT_data_member_location: 60
 <2><e54>: Abbrev Number: 1 (DW_TAG_member)
    <e55>   DW_AT_name        : (indirect string, offset: 0x452d5): APB2RSTR
    <e59>   DW_AT_decl_file   : 5
    <e59>   DW_AT_decl_line   : 703
    <e5b>   DW_AT_decl_column : 17
    <e5b>   DW_AT_type        : <0xccf>
    <e5f>   DW_AT_data_member_location: 64
 <2><e60>: Abbrev Number: 1 (DW_TAG_member)
    <e61>   DW_AT_name        : (indirect string, offset: 0x94948): RESERVED2
    <e65>   DW_AT_decl_file   : 5
    <e65>   DW_AT_decl_line   : 704
    <e67>   DW_AT_decl_column : 17
    <e67>   DW_AT_type        : <0xcc3>
    <e6b>   DW_AT_data_member_location: 68
 <2><e6c>: Abbrev Number: 1 (DW_TAG_member)
    <e6d>   DW_AT_name        : (indirect string, offset: 0xc557): AHB1ENR
    <e71>   DW_AT_decl_file   : 5
    <e71>   DW_AT_decl_line   : 705
    <e73>   DW_AT_decl_column : 17
    <e73>   DW_AT_type        : <0xccf>
    <e77>   DW_AT_data_member_location: 72
 <2><e78>: Abbrev Number: 1 (DW_TAG_member)
    <e79>   DW_AT_name        : (indirect string, offset: 0x2a2be): AHB2ENR
    <e7d>   DW_AT_decl_file   : 5
    <e7d>   DW_AT_decl_line   : 706
    <e7f>   DW_AT_decl_column : 17
    <e7f>   DW_AT_type        : <0xccf>
    <e83>   DW_AT_data_member_location: 76
 <2><e84>: Abbrev Number: 1 (DW_TAG_member)
    <e85>   DW_AT_name        : (indirect string, offset: 0x477be): AHB3ENR
    <e89>   DW_AT_decl_file   : 5
    <e89>   DW_AT_decl_line   : 707
    <e8b>   DW_AT_decl_column : 17
    <e8b>   DW_AT_type        : <0xccf>
    <e8f>   DW_AT_data_member_location: 80
 <2><e90>: Abbrev Number: 1 (DW_TAG_member)
    <e91>   DW_AT_name        : (indirect string, offset: 0x94952): RESERVED3
    <e95>   DW_AT_decl_file   : 5
    <e95>   DW_AT_decl_line   : 708
    <e97>   DW_AT_decl_column : 17
    <e97>   DW_AT_type        : <0xcc3>
    <e9b>   DW_AT_data_member_location: 84
 <2><e9c>: Abbrev Number: 1 (DW_TAG_member)
    <e9d>   DW_AT_name        : (indirect string, offset: 0x5148): APB1ENR1
    <ea1>   DW_AT_decl_file   : 5
    <ea1>   DW_AT_decl_line   : 709
    <ea3>   DW_AT_decl_column : 17
    <ea3>   DW_AT_type        : <0xccf>
    <ea7>   DW_AT_data_member_location: 88
 <2><ea8>: Abbrev Number: 1 (DW_TAG_member)
    <ea9>   DW_AT_name        : (indirect string, offset: 0x5151): APB1ENR2
    <ead>   DW_AT_decl_file   : 5
    <ead>   DW_AT_decl_line   : 710
    <eaf>   DW_AT_decl_column : 17
    <eaf>   DW_AT_type        : <0xccf>
    <eb3>   DW_AT_data_member_location: 92
 <2><eb4>: Abbrev Number: 1 (DW_TAG_member)
    <eb5>   DW_AT_name        : (indirect string, offset: 0x12839): APB2ENR
    <eb9>   DW_AT_decl_file   : 5
    <eb9>   DW_AT_decl_line   : 711
    <ebb>   DW_AT_decl_column : 17
    <ebb>   DW_AT_type        : <0xccf>
    <ebf>   DW_AT_data_member_location: 96
 <2><ec0>: Abbrev Number: 1 (DW_TAG_member)
    <ec1>   DW_AT_name        : (indirect string, offset: 0x58712): RESERVED4
    <ec5>   DW_AT_decl_file   : 5
    <ec5>   DW_AT_decl_line   : 712
    <ec7>   DW_AT_decl_column : 17
    <ec7>   DW_AT_type        : <0xcc3>
    <ecb>   DW_AT_data_member_location: 100
 <2><ecc>: Abbrev Number: 1 (DW_TAG_member)
    <ecd>   DW_AT_name        : (indirect string, offset: 0x4921d): AHB1SMENR
    <ed1>   DW_AT_decl_file   : 5
    <ed1>   DW_AT_decl_line   : 713
    <ed3>   DW_AT_decl_column : 17
    <ed3>   DW_AT_type        : <0xccf>
    <ed7>   DW_AT_data_member_location: 104
 <2><ed8>: Abbrev Number: 1 (DW_TAG_member)
    <ed9>   DW_AT_name        : (indirect string, offset: 0x908da): AHB2SMENR
    <edd>   DW_AT_decl_file   : 5
    <edd>   DW_AT_decl_line   : 714
    <edf>   DW_AT_decl_column : 17
    <edf>   DW_AT_type        : <0xccf>
    <ee3>   DW_AT_data_member_location: 108
 <2><ee4>: Abbrev Number: 1 (DW_TAG_member)
    <ee5>   DW_AT_name        : (indirect string, offset: 0x3a543): AHB3SMENR
    <ee9>   DW_AT_decl_file   : 5
    <ee9>   DW_AT_decl_line   : 715
    <eeb>   DW_AT_decl_column : 17
    <eeb>   DW_AT_type        : <0xccf>
    <eef>   DW_AT_data_member_location: 112
 <2><ef0>: Abbrev Number: 1 (DW_TAG_member)
    <ef1>   DW_AT_name        : (indirect string, offset: 0x94980): RESERVED5
    <ef5>   DW_AT_decl_file   : 5
    <ef5>   DW_AT_decl_line   : 716
    <ef7>   DW_AT_decl_column : 17
    <ef7>   DW_AT_type        : <0xcc3>
    <efb>   DW_AT_data_member_location: 116
 <2><efc>: Abbrev Number: 1 (DW_TAG_member)
    <efd>   DW_AT_name        : (indirect string, offset: 0x59da): APB1SMENR1
    <f01>   DW_AT_decl_file   : 5
    <f01>   DW_AT_decl_line   : 717
    <f03>   DW_AT_decl_column : 17
    <f03>   DW_AT_type        : <0xccf>
    <f07>   DW_AT_data_member_location: 120
 <2><f08>: Abbrev Number: 1 (DW_TAG_member)
    <f09>   DW_AT_name        : (indirect string, offset: 0x59e5): APB1SMENR2
    <f0d>   DW_AT_decl_file   : 5
    <f0d>   DW_AT_decl_line   : 718
    <f0f>   DW_AT_decl_column : 17
    <f0f>   DW_AT_type        : <0xccf>
    <f13>   DW_AT_data_member_location: 124
 <2><f14>: Abbrev Number: 1 (DW_TAG_member)
    <f15>   DW_AT_name        : (indirect string, offset: 0x7f70a): APB2SMENR
    <f19>   DW_AT_decl_file   : 5
    <f19>   DW_AT_decl_line   : 719
    <f1b>   DW_AT_decl_column : 17
    <f1b>   DW_AT_type        : <0xccf>
    <f1f>   DW_AT_data_member_location: 128
 <2><f20>: Abbrev Number: 1 (DW_TAG_member)
    <f21>   DW_AT_name        : (indirect string, offset: 0x9498a): RESERVED6
    <f25>   DW_AT_decl_file   : 5
    <f25>   DW_AT_decl_line   : 720
    <f27>   DW_AT_decl_column : 17
    <f27>   DW_AT_type        : <0xcc3>
    <f2b>   DW_AT_data_member_location: 132
 <2><f2c>: Abbrev Number: 1 (DW_TAG_member)
    <f2d>   DW_AT_name        : (indirect string, offset: 0x30a10): CCIPR
    <f31>   DW_AT_decl_file   : 5
    <f31>   DW_AT_decl_line   : 721
    <f33>   DW_AT_decl_column : 17
    <f33>   DW_AT_type        : <0xccf>
    <f37>   DW_AT_data_member_location: 136
 <2><f38>: Abbrev Number: 1 (DW_TAG_member)
    <f39>   DW_AT_name        : (indirect string, offset: 0x94994): RESERVED7
    <f3d>   DW_AT_decl_file   : 5
    <f3d>   DW_AT_decl_line   : 722
    <f3f>   DW_AT_decl_column : 17
    <f3f>   DW_AT_type        : <0xcc3>
    <f43>   DW_AT_data_member_location: 140
 <2><f44>: Abbrev Number: 1 (DW_TAG_member)
    <f45>   DW_AT_name        : (indirect string, offset: 0x2950e): BDCR
    <f49>   DW_AT_decl_file   : 5
    <f49>   DW_AT_decl_line   : 723
    <f4b>   DW_AT_decl_column : 17
    <f4b>   DW_AT_type        : <0xccf>
    <f4f>   DW_AT_data_member_location: 144
 <2><f50>: Abbrev Number: 10 (DW_TAG_member)
    <f51>   DW_AT_name        : CSR
    <f55>   DW_AT_decl_file   : 5
    <f55>   DW_AT_decl_line   : 724
    <f57>   DW_AT_decl_column : 17
    <f57>   DW_AT_type        : <0xccf>
    <f5b>   DW_AT_data_member_location: 148
 <2><f5c>: Abbrev Number: 0
 <1><f5d>: Abbrev Number: 20 (DW_TAG_typedef)
    <f5e>   DW_AT_name        : (indirect string, offset: 0x49a7b): RCC_TypeDef
    <f62>   DW_AT_decl_file   : 5
    <f62>   DW_AT_decl_line   : 725
    <f64>   DW_AT_decl_column : 3
    <f64>   DW_AT_type        : <0xd8d>
 <1><f68>: Abbrev Number: 3 (DW_TAG_typedef)
    <f69>   DW_AT_name        : (indirect string, offset: 0xc4bbc): TaskFunction_t
    <f6d>   DW_AT_decl_file   : 6
    <f6e>   DW_AT_decl_line   : 36
    <f6f>   DW_AT_decl_column : 17
    <f70>   DW_AT_type        : <0xf74>
 <1><f74>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <f75>   DW_AT_byte_size   : 4
    <f75>   DW_AT_type        : <0xf79>
 <1><f79>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <f7a>   DW_AT_prototyped  : 1
    <f7a>   DW_AT_sibling     : <0xf84>
 <2><f7e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <f7f>   DW_AT_type        : <0xc89>
 <2><f83>: Abbrev Number: 0
 <1><f84>: Abbrev Number: 3 (DW_TAG_typedef)
    <f85>   DW_AT_name        : (indirect string, offset: 0xe5eaf): StackType_t
    <f89>   DW_AT_decl_file   : 7
    <f8a>   DW_AT_decl_line   : 58
    <f8b>   DW_AT_decl_column : 26
    <f8c>   DW_AT_type        : <0xcc3>
 <1><f90>: Abbrev Number: 6 (DW_TAG_const_type)
    <f91>   DW_AT_type        : <0xf84>
 <1><f95>: Abbrev Number: 3 (DW_TAG_typedef)
    <f96>   DW_AT_name        : (indirect string, offset: 0xec3d9): BaseType_t
    <f9a>   DW_AT_decl_file   : 7
    <f9b>   DW_AT_decl_line   : 59
    <f9c>   DW_AT_decl_column : 26
    <f9d>   DW_AT_type        : <0xc40>
 <1><fa1>: Abbrev Number: 3 (DW_TAG_typedef)
    <fa2>   DW_AT_name        : (indirect string, offset: 0xec3d8): UBaseType_t
    <fa6>   DW_AT_decl_file   : 7
    <fa7>   DW_AT_decl_line   : 60
    <fa8>   DW_AT_decl_column : 26
    <fa9>   DW_AT_type        : <0xc53>
 <1><fad>: Abbrev Number: 3 (DW_TAG_typedef)
    <fae>   DW_AT_name        : (indirect string, offset: 0xca9ab): TickType_t
    <fb2>   DW_AT_decl_file   : 7
    <fb3>   DW_AT_decl_line   : 66
    <fb4>   DW_AT_decl_column : 26
    <fb5>   DW_AT_type        : <0xcc3>
 <1><fb9>: Abbrev Number: 6 (DW_TAG_const_type)
    <fba>   DW_AT_type        : <0xfad>
 <1><fbe>: Abbrev Number: 3 (DW_TAG_typedef)
    <fbf>   DW_AT_name        : (indirect string, offset: 0xe2422): TaskHandle_t
    <fc3>   DW_AT_decl_file   : 8
    <fc4>   DW_AT_decl_line   : 95
    <fc5>   DW_AT_decl_column : 46
    <fc6>   DW_AT_type        : <0xfca>
