Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x126 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x3c767): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x54cc2): ../Core/Src/freertos_hooks.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x7fb10): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 7 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 1 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0x12ac1): unsigned int
 <1><38>: Abbrev Number: 1 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x69985): long long int

 <1><191>: Abbrev Number: 5 (DW_TAG_base_type)
    <192>   DW_AT_byte_size   : 2
    <193>   DW_AT_encoding    : 7	(unsigned)
    <194>   DW_AT_name        : (indirect string, offset: 0xde34b): short unsigned int
 <1><198>: Abbrev Number: 5 (DW_TAG_base_type)
    <199>   DW_AT_byte_size   : 4
    <19a>   DW_AT_encoding    : 5	(signed)
    <19b>   DW_AT_name        : (indirect string, offset: 0x135b8): long int
 <1><19f>: Abbrev Number: 3 (DW_TAG_typedef)
    <1a0>   DW_AT_name        : (indirect string, offset: 0xe8b47): __uint32_t
    <1a4>   DW_AT_decl_file   : 3
    <1a5>   DW_AT_decl_line   : 79
    <1a6>   DW_AT_decl_column : 25
    <1a7>   DW_AT_type        : <0x1ab>
 <1><1ab>: Abbrev Number: 5 (DW_TAG_base_type)
    <1ac>   DW_AT_byte_size   : 4
    <1ad>   DW_AT_encoding    : 7	(unsigned)
    <1ae>   DW_AT_name        : (indirect string, offset: 0x58285): long unsigned int
 <1><1b2>: Abbrev Number: 3 (DW_TAG_typedef)
    <1b3>   DW_AT_name        : (indirect string, offset: 0xe8a7d): __uint64_t
    <1b7>   DW_AT_decl_file   : 3
    <1b8>   DW_AT_decl_line   : 105
    <1b9>   DW_AT_decl_column : 25
    <1ba>   DW_AT_type        : <0x1be>
 <1><1be>: Abbrev Number: 5 (DW_TAG_base_type)
    <1bf>   DW_AT_byte_size   : 8
    <1c0>   DW_AT_encoding    : 7	(unsigned)
    <1c1>   DW_AT_name        : (indirect string, offset: 0x3004c): long long unsigned int
 <1><1c5>: Abbrev Number: 3 (DW_TAG_typedef)
    <1c6>   DW_AT_name        : (indirect string, offset: 0x4354f): uint8_t
    <1ca>   DW_AT_decl_file   : 4
    <1cb>   DW_AT_decl_line   : 24
    <1cc>   DW_AT_decl_column : 19
    <1cd>   DW_AT_type        : <0x177>
 <1><1d1>: Abbrev Number: 6 (DW_TAG_const_type)
    <1d2>   DW_AT_type        : <0x1c5>
 <1><1d6>: Abbrev Number: 3 (DW_TAG_typedef)
    <1d7>   DW_AT_name        : (indirect string, offset: 0xa82d1): uint32_t
    <1db>   DW_AT_decl_file   : 4
    <1dc>   DW_AT_decl_line   : 48
    <1dd>   DW_AT_decl_column : 20
    <1de>   DW_AT_type        : <0x19f>
 <1><1e2>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <1e3>   DW_AT_type        : <0x1d6>
 <1><1e7>: Abbrev Number: 3 (DW_TAG_typedef)
    <1e8>   DW_AT_name        : (indirect string, offset: 0xe8a7f): uint64_t
    <1ec>   DW_AT_decl_file   : 4
    <1ed>   DW_AT_decl_line   : 60
    <1ee>   DW_AT_decl_column : 20
    <1ef>   DW_AT_type        : <0x1b2>
 <1><1f3>: Abbrev Number: 3 (DW_TAG_typedef)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x6da98): TaskFunction_t
    <1f8>   DW_AT_decl_file   : 5
    <1f9>   DW_AT_decl_line   : 36
    <1fa>   DW_AT_decl_column : 17
    <1fb>   DW_AT_type        : <0x1ff>
 <1><1ff>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <200>   DW_AT_byte_size   : 4
    <200>   DW_AT_type        : <0x204>
 <1><204>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <205>   DW_AT_prototyped  : 1
    <205>   DW_AT_sibling     : <0x20f>
 <2><209>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <20a>   DW_AT_type        : <0x20f>
 <2><20e>: Abbrev Number: 0
 <1><20f>: Abbrev Number: 24 (DW_TAG_pointer_type)
    <210>   DW_AT_byte_size   : 4
 <1><211>: Abbrev Number: 6 (DW_TAG_const_type)
    <212>   DW_AT_type        : <0x20f>
 <1><216>: Abbrev Number: 3 (DW_TAG_typedef)
    <217>   DW_AT_name        : (indirect string, offset: 0xd522e): StackType_t
    <21b>   DW_AT_decl_file   : 6
    <21c>   DW_AT_decl_line   : 58
    <21d>   DW_AT_decl_column : 26
    <21e>   DW_AT_type        : <0x1d6>
 <1><222>: Abbrev Number: 6 (DW_TAG_const_type)
    <223>   DW_AT_type        : <0x216>
 <1><227>: Abbrev Number: 3 (DW_TAG_typedef)
    <228>   DW_AT_name        : (indirect string, offset: 0xe8cbc): BaseType_t
    <22c>   DW_AT_decl_file   : 6
    <22d>   DW_AT_decl_line   : 59
    <22e>   DW_AT_decl_column : 26
    <22f>   DW_AT_type        : <0x198>
 <1><233>: Abbrev Number: 3 (DW_TAG_typedef)
    <234>   DW_AT_name        : (indirect string, offset: 0xe8cbb): UBaseType_t
    <238>   DW_AT_decl_file   : 6
    <239>   DW_AT_decl_line   : 60
    <23a>   DW_AT_decl_column : 26
    <23b>   DW_AT_type        : <0x1ab>
 <1><23f>: Abbrev Number: 3 (DW_TAG_typedef)
    <240>   DW_AT_name        : (indirect string, offset: 0x8004b): TickType_t
    <244>   DW_AT_decl_file   : 6
    <245>   DW_AT_decl_line   : 66
    <246>   DW_AT_decl_column : 26
    <247>   DW_AT_type        : <0x1d6>
 <1><24b>: Abbrev Number: 6 (DW_TAG_const_type)
    <24c>   DW_AT_type        : <0x23f>
 <1><250>: Abbrev Number: 3 (DW_TAG_typedef)
    <251>   DW_AT_name        : (indirect string, offset: 0xc99d6): TaskHandle_t
    <255>   DW_AT_decl_file   : 7
    <256>   DW_AT_decl_line   : 95
    <257>   DW_AT_decl_column : 46
    <258>   DW_AT_type        : <0x25c>
 <1><25c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <25d>   DW_AT_byte_size   : 4
    <25d>   DW_AT_type        : <0x261>
 <1><261>: Abbrev Number: 25 (DW_TAG_structure_type)
    <262>   DW_AT_name        : (indirect string, offset: 0xc511a): tskTaskControlBlock
    <266>   DW_AT_declaration : 1
 <1><266>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <267>   DW_AT_byte_size   : 4
    <267>   DW_AT_type        : <0x277>
 <1><26b>: Abbrev Number: 6 (DW_TAG_const_type)
    <26c>   DW_AT_type        : <0x266>
 <1><270>: Abbrev Number: 5 (DW_TAG_base_type)
    <271>   DW_AT_byte_size   : 1
    <272>   DW_AT_encoding    : 8	(unsigned char)
    <273>   DW_AT_name        : (indirect string, offset: 0x4ad84): char
 <1><277>: Abbrev Number: 6 (DW_TAG_const_type)
    <278>   DW_AT_type        : <0x270>
 <1><27c>: Abbrev Number: 14 (DW_TAG_structure_type)
    <27d>   DW_AT_byte_size   : 48
    <27e>   DW_AT_decl_file   : 8
    <27e>   DW_AT_decl_line   : 531
    <280>   DW_AT_decl_column : 9
    <280>   DW_AT_sibling     : <0x309>
 <2><284>: Abbrev Number: 1 (DW_TAG_member)
    <285>   DW_AT_name        : (indirect string, offset: 0xe88ba): MODER
    <289>   DW_AT_decl_file   : 8
    <289>   DW_AT_decl_line   : 533
    <28b>   DW_AT_decl_column : 17
    <28b>   DW_AT_type        : <0x1e2>
    <28f>   DW_AT_data_member_location: 0
 <2><290>: Abbrev Number: 1 (DW_TAG_member)
    <291>   DW_AT_name        : (indirect string, offset: 0xe8bb4): OTYPER
    <295>   DW_AT_decl_file   : 8
    <295>   DW_AT_decl_line   : 534
    <297>   DW_AT_decl_column : 17
    <297>   DW_AT_type        : <0x1e2>
    <29b>   DW_AT_data_member_location: 4
 <2><29c>: Abbrev Number: 1 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0xe8c1d): OSPEEDR
    <2a1>   DW_AT_decl_file   : 8
    <2a1>   DW_AT_decl_line   : 535
    <2a3>   DW_AT_decl_column : 17
    <2a3>   DW_AT_type        : <0x1e2>
    <2a7>   DW_AT_data_member_location: 8
 <2><2a8>: Abbrev Number: 1 (DW_TAG_member)
    <2a9>   DW_AT_name        : (indirect string, offset: 0xe8b52): PUPDR
    <2ad>   DW_AT_decl_file   : 8
    <2ad>   DW_AT_decl_line   : 536
    <2af>   DW_AT_decl_column : 17
    <2af>   DW_AT_type        : <0x1e2>
    <2b3>   DW_AT_data_member_location: 12
 <2><2b4>: Abbrev Number: 8 (DW_TAG_member)
    <2b5>   DW_AT_name        : IDR
    <2b9>   DW_AT_decl_file   : 8
    <2b9>   DW_AT_decl_line   : 537
    <2bb>   DW_AT_decl_column : 17
    <2bb>   DW_AT_type        : <0x1e2>
    <2bf>   DW_AT_data_member_location: 16
 <2><2c0>: Abbrev Number: 8 (DW_TAG_member)
    <2c1>   DW_AT_name        : ODR
    <2c5>   DW_AT_decl_file   : 8
    <2c5>   DW_AT_decl_line   : 538
    <2c7>   DW_AT_decl_column : 17
    <2c7>   DW_AT_type        : <0x1e2>
    <2cb>   DW_AT_data_member_location: 20
 <2><2cc>: Abbrev Number: 1 (DW_TAG_member)
    <2cd>   DW_AT_name        : (indirect string, offset: 0xe8985): BSRR
    <2d1>   DW_AT_decl_file   : 8
    <2d1>   DW_AT_decl_line   : 539
    <2d3>   DW_AT_decl_column : 17
    <2d3>   DW_AT_type        : <0x1e2>
    <2d7>   DW_AT_data_member_location: 24
 <2><2d8>: Abbrev Number: 1 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0xe8c04): LCKR
    <2dd>   DW_AT_decl_file   : 8
    <2dd>   DW_AT_decl_line   : 540
    <2df>   DW_AT_decl_column : 17
    <2df>   DW_AT_type        : <0x1e2>
    <2e3>   DW_AT_data_member_location: 28
 <2><2e4>: Abbrev Number: 8 (DW_TAG_member)
    <2e5>   DW_AT_name        : AFR
    <2e9>   DW_AT_decl_file   : 8
    <2e9>   DW_AT_decl_line   : 541
    <2eb>   DW_AT_decl_column : 17
    <2eb>   DW_AT_type        : <0x319>
    <2ef>   DW_AT_data_member_location: 32
 <2><2f0>: Abbrev Number: 8 (DW_TAG_member)
    <2f1>   DW_AT_name        : BRR
    <2f5>   DW_AT_decl_file   : 8
    <2f5>   DW_AT_decl_line   : 542
    <2f7>   DW_AT_decl_column : 17
    <2f7>   DW_AT_type        : <0x1e2>
    <2fb>   DW_AT_data_member_location: 40
 <2><2fc>: Abbrev Number: 1 (DW_TAG_member)
    <2fd>   DW_AT_name        : (indirect string, offset: 0xe88c5): ASCR
    <301>   DW_AT_decl_file   : 8
    <301>   DW_AT_decl_line   : 543
    <303>   DW_AT_decl_column : 17
    <303>   DW_AT_type        : <0x1e2>
    <307>   DW_AT_data_member_location: 44
 <2><308>: Abbrev Number: 0
 <1><309>: Abbrev Number: 15 (DW_TAG_array_type)
    <30a>   DW_AT_type        : <0x1e2>
    <30e>   DW_AT_sibling     : <0x319>
 <2><312>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <313>   DW_AT_type        : <0x15b>
    <317>   DW_AT_upper_bound : 1
 <2><318>: Abbrev Number: 0
 <1><319>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <31a>   DW_AT_type        : <0x309>
 <1><31e>: Abbrev Number: 17 (DW_TAG_typedef)
    <31f>   DW_AT_name        : (indirect string, offset: 0xe8cc7): GPIO_TypeDef
    <323>   DW_AT_decl_file   : 8
    <323>   DW_AT_decl_line   : 545
    <325>   DW_AT_decl_column : 3
    <325>   DW_AT_type        : <0x27c>
 <1><329>: Abbrev Number: 14 (DW_TAG_structure_type)
    <32a>   DW_AT_byte_size   : 152
    <32b>   DW_AT_decl_file   : 8
    <32b>   DW_AT_decl_line   : 685
    <32d>   DW_AT_decl_column : 9
    <32d>   DW_AT_sibling     : <0x4f9>
 <2><331>: Abbrev Number: 8 (DW_TAG_member)
    <332>   DW_AT_name        : CR
    <335>   DW_AT_decl_file   : 8
    <335>   DW_AT_decl_line   : 687
    <337>   DW_AT_decl_column : 17
    <337>   DW_AT_type        : <0x1e2>
    <33b>   DW_AT_data_member_location: 0
 <2><33c>: Abbrev Number: 1 (DW_TAG_member)
    <33d>   DW_AT_name        : (indirect string, offset: 0xe8acd): ICSCR
    <341>   DW_AT_decl_file   : 8
    <341>   DW_AT_decl_line   : 688
    <343>   DW_AT_decl_column : 17
    <343>   DW_AT_type        : <0x1e2>
    <347>   DW_AT_data_member_location: 4
 <2><348>: Abbrev Number: 1 (DW_TAG_member)
    <349>   DW_AT_name        : (indirect string, offset: 0xe89f9): CFGR
    <34d>   DW_AT_decl_file   : 8
    <34d>   DW_AT_decl_line   : 689
    <34f>   DW_AT_decl_column : 17
    <34f>   DW_AT_type        : <0x1e2>
    <353>   DW_AT_data_member_location: 8
 <2><354>: Abbrev Number: 1 (DW_TAG_member)
    <355>   DW_AT_name        : (indirect string, offset: 0xe8b97): PLLCFGR
    <359>   DW_AT_decl_file   : 8
    <359>   DW_AT_decl_line   : 690
    <35b>   DW_AT_decl_column : 17
    <35b>   DW_AT_type        : <0x1e2>
    <35f>   DW_AT_data_member_location: 12
 <2><360>: Abbrev Number: 1 (DW_TAG_member)
    <361>   DW_AT_name        : (indirect string, offset: 0xe89f2): PLLSAI1CFGR
    <365>   DW_AT_decl_file   : 8
    <365>   DW_AT_decl_line   : 691
    <367>   DW_AT_decl_column : 17
    <367>   DW_AT_type        : <0x1e2>
    <36b>   DW_AT_data_member_location: 16
 <2><36c>: Abbrev Number: 1 (DW_TAG_member)
    <36d>   DW_AT_name        : (indirect string, offset: 0xe8b5d): PLLSAI2CFGR
    <371>   DW_AT_decl_file   : 8
    <371>   DW_AT_decl_line   : 692
    <373>   DW_AT_decl_column : 17
    <373>   DW_AT_type        : <0x1e2>
    <377>   DW_AT_data_member_location: 20
 <2><378>: Abbrev Number: 1 (DW_TAG_member)
    <379>   DW_AT_name        : (indirect string, offset: 0xe88cf): CIER
    <37d>   DW_AT_decl_file   : 8
    <37d>   DW_AT_decl_line   : 693
    <37f>   DW_AT_decl_column : 17
    <37f>   DW_AT_type        : <0x1e2>
    <383>   DW_AT_data_member_location: 24
 <2><384>: Abbrev Number: 1 (DW_TAG_member)
    <385>   DW_AT_name        : (indirect string, offset: 0xe88ca): CIFR
    <389>   DW_AT_decl_file   : 8
    <389>   DW_AT_decl_line   : 694
    <38b>   DW_AT_decl_column : 17
    <38b>   DW_AT_type        : <0x1e2>
    <38f>   DW_AT_data_member_location: 28
 <2><390>: Abbrev Number: 1 (DW_TAG_member)
    <391>   DW_AT_name        : (indirect string, offset: 0xe88c0): CICR
    <395>   DW_AT_decl_file   : 8
    <395>   DW_AT_decl_line   : 695
    <397>   DW_AT_decl_column : 17
    <397>   DW_AT_type        : <0x1e2>
    <39b>   DW_AT_data_member_location: 32
 <2><39c>: Abbrev Number: 1 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0xe8c6d): RESERVED0
    <3a1>   DW_AT_decl_file   : 8
    <3a1>   DW_AT_decl_line   : 696
    <3a3>   DW_AT_decl_column : 17
    <3a3>   DW_AT_type        : <0x1d6>
    <3a7>   DW_AT_data_member_location: 36
 <2><3a8>: Abbrev Number: 1 (DW_TAG_member)
    <3a9>   DW_AT_name        : (indirect string, offset: 0xe8bbb): AHB1RSTR
    <3ad>   DW_AT_decl_file   : 8
    <3ad>   DW_AT_decl_line   : 697
    <3af>   DW_AT_decl_column : 17
    <3af>   DW_AT_type        : <0x1e2>
    <3b3>   DW_AT_data_member_location: 40
 <2><3b4>: Abbrev Number: 1 (DW_TAG_member)
    <3b5>   DW_AT_name        : (indirect string, offset: 0xe8916): AHB2RSTR
    <3b9>   DW_AT_decl_file   : 8
    <3b9>   DW_AT_decl_line   : 698
    <3bb>   DW_AT_decl_column : 17
    <3bb>   DW_AT_type        : <0x1e2>
    <3bf>   DW_AT_data_member_location: 44
 <2><3c0>: Abbrev Number: 1 (DW_TAG_member)
    <3c1>   DW_AT_name        : (indirect string, offset: 0xe89e9): AHB3RSTR
    <3c5>   DW_AT_decl_file   : 8
    <3c5>   DW_AT_decl_line   : 699
    <3c7>   DW_AT_decl_column : 17
    <3c7>   DW_AT_type        : <0x1e2>
    <3cb>   DW_AT_data_member_location: 48
 <2><3cc>: Abbrev Number: 1 (DW_TAG_member)
    <3cd>   DW_AT_name        : (indirect string, offset: 0xe8c77): RESERVED1
    <3d1>   DW_AT_decl_file   : 8
    <3d1>   DW_AT_decl_line   : 700
    <3d3>   DW_AT_decl_column : 17
    <3d3>   DW_AT_type        : <0x1d6>
    <3d7>   DW_AT_data_member_location: 52
 <2><3d8>: Abbrev Number: 1 (DW_TAG_member)
    <3d9>   DW_AT_name        : (indirect string, offset: 0xe895f): APB1RSTR1
    <3dd>   DW_AT_decl_file   : 8
    <3dd>   DW_AT_decl_line   : 701
    <3df>   DW_AT_decl_column : 17
    <3df>   DW_AT_type        : <0x1e2>
    <3e3>   DW_AT_data_member_location: 56
 <2><3e4>: Abbrev Number: 1 (DW_TAG_member)
    <3e5>   DW_AT_name        : (indirect string, offset: 0xe8969): APB1RSTR2
    <3e9>   DW_AT_decl_file   : 8
    <3e9>   DW_AT_decl_line   : 702
    <3eb>   DW_AT_decl_column : 17
    <3eb>   DW_AT_type        : <0x1e2>
    <3ef>   DW_AT_data_member_location: 60
 <2><3f0>: Abbrev Number: 1 (DW_TAG_member)
    <3f1>   DW_AT_name        : (indirect string, offset: 0xe8a3c): APB2RSTR
    <3f5>   DW_AT_decl_file   : 8
    <3f5>   DW_AT_decl_line   : 703
    <3f7>   DW_AT_decl_column : 17
    <3f7>   DW_AT_type        : <0x1e2>
    <3fb>   DW_AT_data_member_location: 64
 <2><3fc>: Abbrev Number: 1 (DW_TAG_member)
    <3fd>   DW_AT_name        : (indirect string, offset: 0xe8c81): RESERVED2
    <401>   DW_AT_decl_file   : 8
    <401>   DW_AT_decl_line   : 704
    <403>   DW_AT_decl_column : 17
    <403>   DW_AT_type        : <0x1d6>
    <407>   DW_AT_data_member_location: 68
 <2><408>: Abbrev Number: 1 (DW_TAG_member)
    <409>   DW_AT_name        : (indirect string, offset: 0xe8909): AHB1ENR
    <40d>   DW_AT_decl_file   : 8
    <40d>   DW_AT_decl_line   : 705
    <40f>   DW_AT_decl_column : 17
    <40f>   DW_AT_type        : <0x1e2>
    <413>   DW_AT_data_member_location: 72
 <2><414>: Abbrev Number: 1 (DW_TAG_member)
    <415>   DW_AT_name        : (indirect string, offset: 0xe899e): AHB2ENR
    <419>   DW_AT_decl_file   : 8
    <419>   DW_AT_decl_line   : 706
    <41b>   DW_AT_decl_column : 17
    <41b>   DW_AT_type        : <0x1e2>
    <41f>   DW_AT_data_member_location: 76
 <2><420>: Abbrev Number: 1 (DW_TAG_member)
    <421>   DW_AT_name        : (indirect string, offset: 0xe8a5c): AHB3ENR
    <425>   DW_AT_decl_file   : 8
    <425>   DW_AT_decl_line   : 707
    <427>   DW_AT_decl_column : 17
    <427>   DW_AT_type        : <0x1e2>
    <42b>   DW_AT_data_member_location: 80
 <2><42c>: Abbrev Number: 1 (DW_TAG_member)
    <42d>   DW_AT_name        : (indirect string, offset: 0xe8c8b): RESERVED3
    <431>   DW_AT_decl_file   : 8
    <431>   DW_AT_decl_line   : 708
    <433>   DW_AT_decl_column : 17
    <433>   DW_AT_type        : <0x1d6>
    <437>   DW_AT_data_member_location: 84
 <2><438>: Abbrev Number: 1 (DW_TAG_member)
    <439>   DW_AT_name        : (indirect string, offset: 0xe88d4): APB1ENR1
    <43d>   DW_AT_decl_file   : 8
    <43d>   DW_AT_decl_line   : 709
    <43f>   DW_AT_decl_column : 17
    <43f>   DW_AT_type        : <0x1e2>
    <443>   DW_AT_data_member_location: 88
 <2><444>: Abbrev Number: 1 (DW_TAG_member)
    <445>   DW_AT_name        : (indirect string, offset: 0xe88dd): APB1ENR2
    <449>   DW_AT_decl_file   : 8
    <449>   DW_AT_decl_line   : 710
    <44b>   DW_AT_decl_column : 17
    <44b>   DW_AT_type        : <0x1e2>
    <44f>   DW_AT_data_member_location: 92
 <2><450>: Abbrev Number: 1 (DW_TAG_member)
    <451>   DW_AT_name        : (indirect string, offset: 0xe891f): APB2ENR
    <455>   DW_AT_decl_file   : 8
    <455>   DW_AT_decl_line   : 711
    <457>   DW_AT_decl_column : 17
    <457>   DW_AT_type        : <0x1e2>
    <45b>   DW_AT_data_member_location: 96
 <2><45c>: Abbrev Number: 1 (DW_TAG_member)
    <45d>   DW_AT_name        : (indirect string, offset: 0xe8af2): RESERVED4
    <461>   DW_AT_decl_file   : 8
    <461>   DW_AT_decl_line   : 712
    <463>   DW_AT_decl_column : 17
    <463>   DW_AT_type        : <0x1d6>
    <467>   DW_AT_data_member_location: 100
 <2><468>: Abbrev Number: 1 (DW_TAG_member)
    <469>   DW_AT_name        : (indirect string, offset: 0xe8a73): AHB1SMENR
    <46d>   DW_AT_decl_file   : 8
    <46d>   DW_AT_decl_line   : 713
    <46f>   DW_AT_decl_column : 17
    <46f>   DW_AT_type        : <0x1e2>
    <473>   DW_AT_data_member_location: 104
 <2><474>: Abbrev Number: 1 (DW_TAG_member)
    <475>   DW_AT_name        : (indirect string, offset: 0xe8c4b): AHB2SMENR
    <479>   DW_AT_decl_file   : 8
    <479>   DW_AT_decl_line   : 714
    <47b>   DW_AT_decl_column : 17
    <47b>   DW_AT_type        : <0x1e2>
    <47f>   DW_AT_data_member_location: 108
 <2><480>: Abbrev Number: 1 (DW_TAG_member)
    <481>   DW_AT_name        : (indirect string, offset: 0xe8a17): AHB3SMENR
    <485>   DW_AT_decl_file   : 8
    <485>   DW_AT_decl_line   : 715
    <487>   DW_AT_decl_column : 17
    <487>   DW_AT_type        : <0x1e2>
    <48b>   DW_AT_data_member_location: 112
 <2><48c>: Abbrev Number: 1 (DW_TAG_member)
    <48d>   DW_AT_name        : (indirect string, offset: 0xe8c95): RESERVED5
    <491>   DW_AT_decl_file   : 8
    <491>   DW_AT_decl_line   : 716
    <493>   DW_AT_decl_column : 17
    <493>   DW_AT_type        : <0x1d6>
    <497>   DW_AT_data_member_location: 116
 <2><498>: Abbrev Number: 1 (DW_TAG_member)
    <499>   DW_AT_name        : (indirect string, offset: 0xe88e6): APB1SMENR1
    <49d>   DW_AT_decl_file   : 8
    <49d>   DW_AT_decl_line   : 717
    <49f>   DW_AT_decl_column : 17
    <49f>   DW_AT_type        : <0x1e2>
    <4a3>   DW_AT_data_member_location: 120
 <2><4a4>: Abbrev Number: 1 (DW_TAG_member)
    <4a5>   DW_AT_name        : (indirect string, offset: 0xe88f1): APB1SMENR2
    <4a9>   DW_AT_decl_file   : 8
    <4a9>   DW_AT_decl_line   : 718
    <4ab>   DW_AT_decl_column : 17
    <4ab>   DW_AT_type        : <0x1e2>
    <4af>   DW_AT_data_member_location: 124
 <2><4b0>: Abbrev Number: 1 (DW_TAG_member)
    <4b1>   DW_AT_name        : (indirect string, offset: 0xe8baa): APB2SMENR
    <4b5>   DW_AT_decl_file   : 8
    <4b5>   DW_AT_decl_line   : 719
    <4b7>   DW_AT_decl_column : 17
    <4b7>   DW_AT_type        : <0x1e2>
    <4bb>   DW_AT_data_member_location: 128
 <2><4bc>: Abbrev Number: 1 (DW_TAG_member)
    <4bd>   DW_AT_name        : (indirect string, offset: 0xe8afc): RESERVED6
    <4c1>   DW_AT_decl_file   : 8
    <4c1>   DW_AT_decl_line   : 720
    <4c3>   DW_AT_decl_column : 17
    <4c3>   DW_AT_type        : <0x1d6>
    <4c7>   DW_AT_data_member_location: 132
 <2><4c8>: Abbrev Number: 1 (DW_TAG_member)
    <4c9>   DW_AT_name        : (indirect string, offset: 0xe89c6): CCIPR
    <4cd>   DW_AT_decl_file   : 8
    <4cd>   DW_AT_decl_line   : 721
    <4cf>   DW_AT_decl_column : 17
    <4cf>   DW_AT_type        : <0x1e2>
    <4d3>   DW_AT_data_member_location: 136
 <2><4d4>: Abbrev Number: 1 (DW_TAG_member)
    <4d5>   DW_AT_name        : (indirect string, offset: 0xe8c9f): RESERVED7
    <4d9>   DW_AT_decl_file   : 8
    <4d9>   DW_AT_decl_line   : 722
    <4db>   DW_AT_decl_column : 17
    <4db>   DW_AT_type        : <0x1d6>
    <4df>   DW_AT_data_member_location: 140
 <2><4e0>: Abbrev Number: 1 (DW_TAG_member)
    <4e1>   DW_AT_name        : (indirect string, offset: 0xe8999): BDCR
    <4e5>   DW_AT_decl_file   : 8
    <4e5>   DW_AT_decl_line   : 723
    <4e7>   DW_AT_decl_column : 17
    <4e7>   DW_AT_type        : <0x1e2>
    <4eb>   DW_AT_data_member_location: 144
 <2><4ec>: Abbrev Number: 8 (DW_TAG_member)
    <4ed>   DW_AT_name        : CSR
    <4f1>   DW_AT_decl_file   : 8
    <4f1>   DW_AT_decl_line   : 724
    <4f3>   DW_AT_decl_column : 17
    <4f3>   DW_AT_type        : <0x1e2>
    <4f7>   DW_AT_data_member_location: 148
 <2><4f8>: Abbrev Number: 0
 <1><4f9>: Abbrev Number: 17 (DW_TAG_typedef)
    <4fa>   DW_AT_name        : (indirect string, offset: 0xe8a88): RCC_TypeDef
    <4fe>   DW_AT_decl_file   : 8
    <4fe>   DW_AT_decl_line   : 725
    <500>   DW_AT_decl_column : 3
    <500>   DW_AT_type        : <0x329>
 <1><504>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <505>   DW_AT_encoding    : 7	(unsigned)
    <506>   DW_AT_byte_size   : 1
    <507>   DW_AT_type        : <0x183>
    <50b>   DW_AT_decl_file   : 9
    <50c>   DW_AT_decl_line   : 39
    <50d>   DW_AT_decl_column : 1
    <50e>   DW_AT_sibling     : <0x52b>
 <2><512>: Abbrev Number: 10 (DW_TAG_enumerator)
    <513>   DW_AT_name        : (indirect string, offset: 0xe89fe): HAL_OK
    <517>   DW_AT_const_value : 0
 <2><518>: Abbrev Number: 10 (DW_TAG_enumerator)
    <519>   DW_AT_name        : (indirect string, offset: 0xe8b3d): HAL_ERROR
    <51d>   DW_AT_const_value : 1
 <2><51e>: Abbrev Number: 10 (DW_TAG_enumerator)
    <51f>   DW_AT_name        : (indirect string, offset: 0xe8956): HAL_BUSY
    <523>   DW_AT_const_value : 2
 <2><524>: Abbrev Number: 10 (DW_TAG_enumerator)
    <525>   DW_AT_name        : (indirect string, offset: 0xe89a6): HAL_TIMEOUT
    <529>   DW_AT_const_value : 3
 <2><52a>: Abbrev Number: 0
 <1><52b>: Abbrev Number: 3 (DW_TAG_typedef)
    <52c>   DW_AT_name        : (indirect string, offset: 0xe8ca9): HAL_StatusTypeDef
    <530>   DW_AT_decl_file   : 9
    <531>   DW_AT_decl_line   : 44
    <532>   DW_AT_decl_column : 3
    <533>   DW_AT_type        : <0x504>
 <1><537>: Abbrev Number: 12 (DW_TAG_structure_type)
    <538>   DW_AT_byte_size   : 28
    <539>   DW_AT_decl_file   : 10
    <539>   DW_AT_decl_line   : 45
    <53a>   DW_AT_decl_column : 9
    <53a>   DW_AT_sibling     : <0x58c>
 <2><53e>: Abbrev Number: 2 (DW_TAG_member)
    <53f>   DW_AT_name        : (indirect string, offset: 0xe8b69): PLLState
    <543>   DW_AT_decl_file   : 10
    <543>   DW_AT_decl_line   : 47
    <544>   DW_AT_decl_column : 12
    <544>   DW_AT_type        : <0x1d6>
    <548>   DW_AT_data_member_location: 0
 <2><549>: Abbrev Number: 2 (DW_TAG_member)
    <54a>   DW_AT_name        : (indirect string, offset: 0xe8b8d): PLLSource
    <54e>   DW_AT_decl_file   : 10
    <54e>   DW_AT_decl_line   : 50
    <54f>   DW_AT_decl_column : 12
    <54f>   DW_AT_type        : <0x1d6>
    <553>   DW_AT_data_member_location: 4
 <2><554>: Abbrev Number: 2 (DW_TAG_member)
    <555>   DW_AT_name        : (indirect string, offset: 0xe8b58): PLLM
    <559>   DW_AT_decl_file   : 10
    <559>   DW_AT_decl_line   : 53
    <55a>   DW_AT_decl_column : 12
    <55a>   DW_AT_type        : <0x1d6>
    <55e>   DW_AT_data_member_location: 8
 <2><55f>: Abbrev Number: 2 (DW_TAG_member)
    <560>   DW_AT_name        : (indirect string, offset: 0xe8be1): PLLN
    <564>   DW_AT_decl_file   : 10
    <564>   DW_AT_decl_line   : 57
    <565>   DW_AT_decl_column : 12
    <565>   DW_AT_type        : <0x1d6>
    <569>   DW_AT_data_member_location: 12
 <2><56a>: Abbrev Number: 2 (DW_TAG_member)
    <56b>   DW_AT_name        : (indirect string, offset: 0xe8be6): PLLP
    <56f>   DW_AT_decl_file   : 10
    <56f>   DW_AT_decl_line   : 61
    <570>   DW_AT_decl_column : 12
    <570>   DW_AT_type        : <0x1d6>
    <574>   DW_AT_data_member_location: 16
 <2><575>: Abbrev Number: 2 (DW_TAG_member)
    <576>   DW_AT_name        : (indirect string, offset: 0xa839d): PLLQ
    <57a>   DW_AT_decl_file   : 10
    <57a>   DW_AT_decl_line   : 65
    <57b>   DW_AT_decl_column : 12
    <57b>   DW_AT_type        : <0x1d6>
    <57f>   DW_AT_data_member_location: 20
 <2><580>: Abbrev Number: 2 (DW_TAG_member)
    <581>   DW_AT_name        : (indirect string, offset: 0xe8beb): PLLR
    <585>   DW_AT_decl_file   : 10
    <585>   DW_AT_decl_line   : 68
    <586>   DW_AT_decl_column : 12
    <586>   DW_AT_type        : <0x1d6>
    <58a>   DW_AT_data_member_location: 24
 <2><58b>: Abbrev Number: 0
 <1><58c>: Abbrev Number: 3 (DW_TAG_typedef)
    <58d>   DW_AT_name        : (indirect string, offset: 0xe8b2a): RCC_PLLInitTypeDef
    <591>   DW_AT_decl_file   : 10
    <592>   DW_AT_decl_line   : 73
    <593>   DW_AT_decl_column : 2
    <594>   DW_AT_type        : <0x537>
 <1><598>: Abbrev Number: 12 (DW_TAG_structure_type)
    <599>   DW_AT_byte_size   : 68
    <59a>   DW_AT_decl_file   : 10
    <59a>   DW_AT_decl_line   : 78
    <59b>   DW_AT_decl_column : 9
    <59b>   DW_AT_sibling     : <0x61b>
 <2><59f>: Abbrev Number: 2 (DW_TAG_member)
    <5a0>   DW_AT_name        : (indirect string, offset: 0xe8bc4): OscillatorType
    <5a4>   DW_AT_decl_file   : 10
    <5a4>   DW_AT_decl_line   : 80
    <5a5>   DW_AT_decl_column : 12
    <5a5>   DW_AT_type        : <0x1d6>
    <5a9>   DW_AT_data_member_location: 0
 <2><5aa>: Abbrev Number: 2 (DW_TAG_member)
    <5ab>   DW_AT_name        : (indirect string, offset: 0xe8b72): HSEState
    <5af>   DW_AT_decl_file   : 10
    <5af>   DW_AT_decl_line   : 83
    <5b0>   DW_AT_decl_column : 12
    <5b0>   DW_AT_type        : <0x1d6>
    <5b4>   DW_AT_data_member_location: 4
 <2><5b5>: Abbrev Number: 2 (DW_TAG_member)
    <5b6>   DW_AT_name        : (indirect string, offset: 0xe8a33): LSEState
    <5ba>   DW_AT_decl_file   : 10
    <5ba>   DW_AT_decl_line   : 86
    <5bb>   DW_AT_decl_column : 12
    <5bb>   DW_AT_type        : <0x1d6>
    <5bf>   DW_AT_data_member_location: 8
 <2><5c0>: Abbrev Number: 2 (DW_TAG_member)
    <5c1>   DW_AT_name        : (indirect string, offset: 0xe8a53): HSIState
    <5c5>   DW_AT_decl_file   : 10
    <5c5>   DW_AT_decl_line   : 89
    <5c6>   DW_AT_decl_column : 12
    <5c6>   DW_AT_type        : <0x1d6>
    <5ca>   DW_AT_data_member_location: 12
 <2><5cb>: Abbrev Number: 2 (DW_TAG_member)
    <5cc>   DW_AT_name        : (indirect string, offset: 0xe8c09): HSICalibrationValue
    <5d0>   DW_AT_decl_file   : 10
    <5d0>   DW_AT_decl_line   : 92
    <5d1>   DW_AT_decl_column : 12
    <5d1>   DW_AT_type        : <0x1d6>
    <5d5>   DW_AT_data_member_location: 16
 <2><5d6>: Abbrev Number: 2 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0xe8a0e): LSIState
    <5db>   DW_AT_decl_file   : 10
    <5db>   DW_AT_decl_line   : 98
    <5dc>   DW_AT_decl_column : 12
    <5dc>   DW_AT_type        : <0x1d6>
    <5e0>   DW_AT_data_member_location: 20
 <2><5e1>: Abbrev Number: 2 (DW_TAG_member)
    <5e2>   DW_AT_name        : (indirect string, offset: 0xe8a05): MSIState
    <5e6>   DW_AT_decl_file   : 10
    <5e6>   DW_AT_decl_line   : 106
    <5e7>   DW_AT_decl_column : 12
    <5e7>   DW_AT_type        : <0x1d6>
    <5eb>   DW_AT_data_member_location: 24
 <2><5ec>: Abbrev Number: 2 (DW_TAG_member)
    <5ed>   DW_AT_name        : (indirect string, offset: 0xe89b2): MSICalibrationValue
    <5f1>   DW_AT_decl_file   : 10
    <5f1>   DW_AT_decl_line   : 109
    <5f2>   DW_AT_decl_column : 12
    <5f2>   DW_AT_type        : <0x1d6>
    <5f6>   DW_AT_data_member_location: 28
 <2><5f7>: Abbrev Number: 2 (DW_TAG_member)
    <5f8>   DW_AT_name        : (indirect string, offset: 0xe8a9e): MSIClockRange
    <5fc>   DW_AT_decl_file   : 10
    <5fc>   DW_AT_decl_line   : 112
    <5fd>   DW_AT_decl_column : 12
    <5fd>   DW_AT_type        : <0x1d6>
    <601>   DW_AT_data_member_location: 32
 <2><602>: Abbrev Number: 2 (DW_TAG_member)
    <603>   DW_AT_name        : (indirect string, offset: 0xe8b9f): HSI48State
    <607>   DW_AT_decl_file   : 10
    <607>   DW_AT_decl_line   : 115
    <608>   DW_AT_decl_column : 12
    <608>   DW_AT_type        : <0x1d6>
    <60c>   DW_AT_data_member_location: 36
 <2><60d>: Abbrev Number: 27 (DW_TAG_member)
    <60e>   DW_AT_name        : PLL
    <612>   DW_AT_decl_file   : 10
    <613>   DW_AT_decl_line   : 118
    <614>   DW_AT_decl_column : 22
    <615>   DW_AT_type        : <0x58c>
    <619>   DW_AT_data_member_location: 40
 <2><61a>: Abbrev Number: 0
 <1><61b>: Abbrev Number: 3 (DW_TAG_typedef)
    <61c>   DW_AT_name        : (indirect string, offset: 0xe8aac): RCC_OscInitTypeDef
    <620>   DW_AT_decl_file   : 10
    <621>   DW_AT_decl_line   : 120
    <622>   DW_AT_decl_column : 2
    <623>   DW_AT_type        : <0x598>
 <1><627>: Abbrev Number: 12 (DW_TAG_structure_type)
    <628>   DW_AT_byte_size   : 20
    <629>   DW_AT_decl_file   : 10
    <629>   DW_AT_decl_line   : 125
    <62a>   DW_AT_decl_column : 9
    <62a>   DW_AT_sibling     : <0x666>
 <2><62e>: Abbrev Number: 2 (DW_TAG_member)
    <62f>   DW_AT_name        : (indirect string, offset: 0xe89cc): ClockType
    <633>   DW_AT_decl_file   : 10
    <633>   DW_AT_decl_line   : 127
    <634>   DW_AT_decl_column : 12
    <634>   DW_AT_type        : <0x1d6>
    <638>   DW_AT_data_member_location: 0
 <2><639>: Abbrev Number: 2 (DW_TAG_member)
    <63a>   DW_AT_name        : (indirect string, offset: 0xe8b12): SYSCLKSource
    <63e>   DW_AT_decl_file   : 10
    <63e>   DW_AT_decl_line   : 130
    <63f>   DW_AT_decl_column : 12
    <63f>   DW_AT_type        : <0x1d6>
    <643>   DW_AT_data_member_location: 4
 <2><644>: Abbrev Number: 2 (DW_TAG_member)
    <645>   DW_AT_name        : (indirect string, offset: 0xe8bd3): AHBCLKDivider
    <649>   DW_AT_decl_file   : 10
    <649>   DW_AT_decl_line   : 133
    <64a>   DW_AT_decl_column : 12
    <64a>   DW_AT_type        : <0x1d6>
    <64e>   DW_AT_data_member_location: 8
 <2><64f>: Abbrev Number: 2 (DW_TAG_member)
    <650>   DW_AT_name        : (indirect string, offset: 0xe8927): APB1CLKDivider
    <654>   DW_AT_decl_file   : 10
    <654>   DW_AT_decl_line   : 136
    <655>   DW_AT_decl_column : 12
    <655>   DW_AT_type        : <0x1d6>
    <659>   DW_AT_data_member_location: 12
 <2><65a>: Abbrev Number: 2 (DW_TAG_member)
    <65b>   DW_AT_name        : (indirect string, offset: 0xe8a64): APB2CLKDivider
    <65f>   DW_AT_decl_file   : 10
    <65f>   DW_AT_decl_line   : 139
    <660>   DW_AT_decl_column : 12
    <660>   DW_AT_type        : <0x1d6>
    <664>   DW_AT_data_member_location: 16
 <2><665>: Abbrev Number: 0
 <1><666>: Abbrev Number: 3 (DW_TAG_typedef)
    <667>   DW_AT_name        : (indirect string, offset: 0xe89d6): RCC_ClkInitTypeDef
    <66b>   DW_AT_decl_file   : 10
    <66c>   DW_AT_decl_line   : 142
    <66d>   DW_AT_decl_column : 2
    <66e>   DW_AT_type        : <0x627>
 <1><672>: Abbrev Number: 6 (DW_TAG_const_type)
    <673>   DW_AT_type        : <0x666>
 <1><677>: Abbrev Number: 15 (DW_TAG_array_type)
    <678>   DW_AT_type        : <0x1d1>
    <67c>   DW_AT_sibling     : <0x687>
 <2><680>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <681>   DW_AT_type        : <0x15b>
    <685>   DW_AT_upper_bound : 6
 <2><686>: Abbrev Number: 0
 <1><687>: Abbrev Number: 6 (DW_TAG_const_type)
    <688>   DW_AT_type        : <0x677>
 <1><68c>: Abbrev Number: 9 (DW_TAG_variable)
    <68d>   DW_AT_name        : (indirect string, offset: 0x2d6ad): CHANNEL_OFFSET_TAB
    <691>   DW_AT_decl_file   : 12
    <692>   DW_AT_decl_line   : 49
    <693>   DW_AT_decl_column : 22
    <694>   DW_AT_type        : <0x687>
    <698>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><69e>: Abbrev Number: 11 (DW_TAG_subprogram)
    <69f>   DW_AT_external    : 1
    <69f>   DW_AT_name        : (indirect string, offset: 0xe8bf0): HAL_RCC_ClockConfig
    <6a3>   DW_AT_decl_file   : 10
    <6a4>   DW_AT_decl_line   : 4837
    <6a6>   DW_AT_decl_column : 19
    <6a7>   DW_AT_prototyped  : 1
    <6a7>   DW_AT_type        : <0x52b>
    <6ab>   DW_AT_declaration : 1
    <6ab>   DW_AT_sibling     : <0x6ba>
 <2><6af>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <6b0>   DW_AT_type        : <0x6ba>
 <2><6b4>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <6b5>   DW_AT_type        : <0x1d6>
 <2><6b9>: Abbrev Number: 0
 <1><6ba>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6bb>   DW_AT_byte_size   : 4
    <6bb>   DW_AT_type        : <0x672>
 <1><6bf>: Abbrev Number: 11 (DW_TAG_subprogram)
    <6c0>   DW_AT_external    : 1
    <6c0>   DW_AT_name        : (indirect string, offset: 0xe8b7b): HAL_RCC_OscConfig
    <6c4>   DW_AT_decl_file   : 10
    <6c5>   DW_AT_decl_line   : 4836
    <6c7>   DW_AT_decl_column : 19
    <6c8>   DW_AT_prototyped  : 1
    <6c8>   DW_AT_type        : <0x52b>
    <6cc>   DW_AT_declaration : 1
    <6cc>   DW_AT_sibling     : <0x6d6>
 <2><6d0>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <6d1>   DW_AT_type        : <0x6d6>
 <2><6d5>: Abbrev Number: 0
 <1><6d6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6d7>   DW_AT_byte_size   : 4
    <6d7>   DW_AT_type        : <0x61b>
 <1><6db>: Abbrev Number: 11 (DW_TAG_subprogram)
    <6dc>   DW_AT_external    : 1
    <6dc>   DW_AT_name        : (indirect string, offset: 0xe8936): HAL_PWREx_ControlVoltageScaling
    <6e0>   DW_AT_decl_file   : 11
    <6e1>   DW_AT_decl_line   : 837
    <6e3>   DW_AT_decl_column : 19
    <6e4>   DW_AT_prototyped  : 1
    <6e4>   DW_AT_type        : <0x52b>
    <6e8>   DW_AT_declaration : 1
    <6e8>   DW_AT_sibling     : <0x6f2>
 <2><6ec>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <6ed>   DW_AT_type        : <0x1d6>
 <2><6f1>: Abbrev Number: 0
 <1><6f2>: Abbrev Number: 11 (DW_TAG_subprogram)
    <6f3>   DW_AT_external    : 1
    <6f3>   DW_AT_name        : (indirect string, offset: 0xe8b06): xTaskCreate
    <6f7>   DW_AT_decl_file   : 7
    <6f8>   DW_AT_decl_line   : 385
    <6fa>   DW_AT_decl_column : 16
    <6fb>   DW_AT_prototyped  : 1
    <6fb>   DW_AT_type        : <0x227>
    <6ff>   DW_AT_declaration : 1
    <6ff>   DW_AT_sibling     : <0x722>
 <2><703>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <704>   DW_AT_type        : <0x1f3>
 <2><708>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <709>   DW_AT_type        : <0x26b>
 <2><70d>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <70e>   DW_AT_type        : <0x222>
 <2><712>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <713>   DW_AT_type        : <0x211>
 <2><717>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <718>   DW_AT_type        : <0x233>
 <2><71c>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <71d>   DW_AT_type        : <0x727>
 <2><721>: Abbrev Number: 0
 <1><722>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <723>   DW_AT_byte_size   : 4
    <723>   DW_AT_type        : <0x250>
 <1><727>: Abbrev Number: 6 (DW_TAG_const_type)
    <728>   DW_AT_type        : <0x722>
 <1><72c>: Abbrev Number: 28 (DW_TAG_subprogram)
    <72d>   DW_AT_external    : 1
    <72d>   DW_AT_name        : (indirect string, offset: 0xe8ae7): vTaskDelay
    <731>   DW_AT_decl_file   : 7
    <732>   DW_AT_decl_line   : 859
    <734>   DW_AT_decl_column : 6
    <735>   DW_AT_prototyped  : 1
    <735>   DW_AT_declaration : 1
    <735>   DW_AT_sibling     : <0x73f>
 <2><739>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <73a>   DW_AT_type        : <0x24b>
 <2><73e>: Abbrev Number: 0
 <1><73f>: Abbrev Number: 18 (DW_TAG_subprogram)
    <740>   DW_AT_external    : 1
    <740>   DW_AT_name        : (indirect string, offset: 0x6454e): vApplicationTickHook
    <744>   DW_AT_decl_file   : 7
    <744>   DW_AT_decl_line   : 1986
    <746>   DW_AT_decl_column : 10
    <747>   DW_AT_prototyped  : 1
    <747>   DW_AT_declaration : 1
 <1><747>: Abbrev Number: 18 (DW_TAG_subprogram)
    <748>   DW_AT_external    : 1
    <748>   DW_AT_name        : (indirect string, offset: 0xe8ad3): vTaskStartScheduler
    <74c>   DW_AT_decl_file   : 7
    <74c>   DW_AT_decl_line   : 1520
    <74e>   DW_AT_decl_column : 6
    <74f>   DW_AT_prototyped  : 1
    <74f>   DW_AT_declaration : 1
 <1><74f>: Abbrev Number: 29 (DW_TAG_subprogram)
    <750>   DW_AT_external    : 1
    <750>   DW_AT_name        : (indirect string, offset: 0xe8c64): HAL_Init
    <754>   DW_AT_decl_file   : 13
    <755>   DW_AT_decl_line   : 636
    <757>   DW_AT_decl_column : 19
    <758>   DW_AT_prototyped  : 1
    <758>   DW_AT_type        : <0x52b>
    <75c>   DW_AT_declaration : 1
 <1><75c>: Abbrev Number: 30 (DW_TAG_subprogram)
    <75d>   DW_AT_external    : 1
    <75d>   DW_AT_name        : (indirect string, offset: 0xe8a45): Error_Handler
    <761>   DW_AT_decl_file   : 1
    <762>   DW_AT_decl_line   : 115
    <763>   DW_AT_decl_column : 6
    <764>   DW_AT_prototyped  : 1
    <764>   DW_AT_low_pc      : 0x80007a0
    <768>   DW_AT_high_pc     : 0xc
    <76c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <76e>   DW_AT_call_all_calls: 1
    <76e>   DW_AT_sibling     : <0x783>
 <2><772>: Abbrev Number: 31 (DW_TAG_inlined_subroutine)
    <773>   DW_AT_abstract_origin: <0x84f>
    <777>   DW_AT_low_pc      : 0x80007a4
    <77b>   DW_AT_high_pc     : 0x4
    <77f>   DW_AT_call_file   : 1
    <780>   DW_AT_call_line   : 117
    <781>   DW_AT_call_column : 3
 <2><782>: Abbrev Number: 0
 <1><783>: Abbrev Number: 19 (DW_TAG_subprogram)
    <784>   DW_AT_external    : 1
    <784>   DW_AT_name        : (indirect string, offset: 0xe8c25): SystemClock_Config
    <788>   DW_AT_decl_file   : 1
    <788>   DW_AT_decl_line   : 74
    <789>   DW_AT_decl_column : 6
    <789>   DW_AT_prototyped  : 1
    <789>   DW_AT_low_pc      : 0x80006fc
    <78d>   DW_AT_high_pc     : 0xa4
    <791>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <793>   DW_AT_call_all_tail_calls: 1
    <793>   DW_AT_sibling     : <0x7b8>
 <2><797>: Abbrev Number: 9 (DW_TAG_variable)
    <798>   DW_AT_name        : (indirect string, offset: 0xe8973): RCC_OscInitStruct
    <79c>   DW_AT_decl_file   : 1
    <79d>   DW_AT_decl_line   : 76
    <79e>   DW_AT_decl_column : 22
    <79f>   DW_AT_type        : <0x61b>
    <7a3>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><7a7>: Abbrev Number: 9 (DW_TAG_variable)
    <7a8>   DW_AT_name        : (indirect string, offset: 0xe8a21): RCC_ClkInitStruct
    <7ac>   DW_AT_decl_file   : 1
    <7ad>   DW_AT_decl_line   : 77
    <7ae>   DW_AT_decl_column : 22
    <7af>   DW_AT_type        : <0x666>
    <7b3>   DW_AT_location    : 3 byte block: 91 a0 7f 	(DW_OP_fbreg: -96)
 <2><7b7>: Abbrev Number: 0
 <1><7b8>: Abbrev Number: 20 (DW_TAG_subprogram)
    <7b9>   DW_AT_external    : 1
    <7b9>   DW_AT_name        : (indirect string, offset: 0xe8c55): GPIOPortConfig
    <7bd>   DW_AT_decl_file   : 1
    <7bd>   DW_AT_decl_line   : 55
    <7be>   DW_AT_decl_column : 6
    <7be>   DW_AT_prototyped  : 1
    <7be>   DW_AT_low_pc      : 0x8000670
    <7c2>   DW_AT_high_pc     : 0x8c
    <7c6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7c8>   DW_AT_call_all_calls: 1
 <1><7c8>: Abbrev Number: 32 (DW_TAG_subprogram)
    <7c9>   DW_AT_name        : (indirect string, offset: 0xe898a): prvCreateTasks
    <7cd>   DW_AT_decl_file   : 1
    <7ce>   DW_AT_decl_line   : 50
    <7cf>   DW_AT_decl_column : 13
    <7d0>   DW_AT_prototyped  : 1
    <7d0>   DW_AT_low_pc      : 0x8000644
    <7d4>   DW_AT_high_pc     : 0x2c
    <7d8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7da>   DW_AT_call_all_tail_calls: 1
    <7da>   DW_AT_sibling     : <0x7f1>
 <2><7de>: Abbrev Number: 9 (DW_TAG_variable)
    <7df>   DW_AT_name        : (indirect string, offset: 0xe8cd4): rate
    <7e3>   DW_AT_decl_file   : 1
    <7e4>   DW_AT_decl_line   : 51
    <7e5>   DW_AT_decl_column : 18
    <7e6>   DW_AT_type        : <0x1d6>
    <7ea>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <2><7f0>: Abbrev Number: 0
 <1><7f1>: Abbrev Number: 20 (DW_TAG_subprogram)
    <7f2>   DW_AT_external    : 1
    <7f2>   DW_AT_name        : (indirect string, offset: 0xe88b0): I2CConfig
    <7f6>   DW_AT_decl_file   : 1
    <7f6>   DW_AT_decl_line   : 44
    <7f7>   DW_AT_decl_column : 6
    <7f7>   DW_AT_prototyped  : 1
    <7f7>   DW_AT_low_pc      : 0x8000636
    <7fb>   DW_AT_high_pc     : 0xe
    <7ff>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <801>   DW_AT_call_all_calls: 1
 <1><801>: Abbrev Number: 19 (DW_TAG_subprogram)
    <802>   DW_AT_external    : 1
    <802>   DW_AT_name        : (indirect string, offset: 0xe8b1f): vHeartbeat
    <806>   DW_AT_decl_file   : 1
    <806>   DW_AT_decl_line   : 33
    <807>   DW_AT_decl_column : 6
    <807>   DW_AT_prototyped  : 1
    <807>   DW_AT_low_pc      : 0x80004f4
    <80b>   DW_AT_high_pc     : 0x142
    <80f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <811>   DW_AT_call_all_tail_calls: 1
    <811>   DW_AT_sibling     : <0x834>
 <2><815>: Abbrev Number: 33 (DW_TAG_formal_parameter)
    <816>   DW_AT_name        : (indirect string, offset: 0xe88fc): pvParameters
    <81a>   DW_AT_decl_file   : 1
    <81b>   DW_AT_decl_line   : 33
    <81c>   DW_AT_decl_column : 23
    <81d>   DW_AT_type        : <0x20f>
    <821>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><824>: Abbrev Number: 9 (DW_TAG_variable)
    <825>   DW_AT_name        : (indirect string, offset: 0xe8cd4): rate
    <829>   DW_AT_decl_file   : 1
    <82a>   DW_AT_decl_line   : 34
    <82b>   DW_AT_decl_column : 12
    <82c>   DW_AT_type        : <0x834>
    <830>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><833>: Abbrev Number: 0
 <1><834>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <835>   DW_AT_byte_size   : 4
    <835>   DW_AT_type        : <0x1d6>
 <1><839>: Abbrev Number: 34 (DW_TAG_subprogram)
    <83a>   DW_AT_external    : 1
    <83a>   DW_AT_name        : (indirect string, offset: 0xe8911): main
    <83e>   DW_AT_decl_file   : 1
    <83f>   DW_AT_decl_line   : 16
    <840>   DW_AT_decl_column : 5
    <841>   DW_AT_prototyped  : 1
    <841>   DW_AT_type        : <0x154>
    <845>   DW_AT_low_pc      : 0x80004d2
    <849>   DW_AT_high_pc     : 0x22
    <84d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <84f>   DW_AT_call_all_tail_calls: 1
 <1><84f>: Abbrev Number: 35 (DW_TAG_subprogram)
    <850>   DW_AT_name        : (indirect string, offset: 0xe8abf): __disable_irq
    <854>   DW_AT_decl_file   : 2
    <855>   DW_AT_decl_line   : 207
    <856>   DW_AT_decl_column : 27
    <857>   DW_AT_prototyped  : 1
    <857>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><858>: Abbrev Number: 0
  Compilation Unit @ offset 0x859:
   Length:        0x2fd (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x310
   Pointer Size:  4
 <0><865>: Abbrev Number: 7 (DW_TAG_compile_unit)
    <866>   DW_AT_producer    : (indirect string, offset: 0x3c767): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <86a>   DW_AT_language    : 29	(C11)
    <86b>   DW_AT_name        : (indirect string, offset: 0xe8cec): ../Core/Src/stm32l4xx_hal_msp.c
    <86f>   DW_AT_comp_dir    : (indirect string, offset: 0x7fb10): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <873>   DW_AT_ranges      : 0x5f
    <877>   DW_AT_low_pc      : 0
    <87b>   DW_AT_stmt_list   : 0x10cc
    <87f>   DW_AT_macros      : 0x25088
 <1><883>: Abbrev Number: 2 (DW_TAG_base_type)
    <884>   DW_AT_byte_size   : 1
    <885>   DW_AT_encoding    : 6	(signed char)
    <886>   DW_AT_name        : (indirect string, offset: 0x751ec): signed char
 <1><88a>: Abbrev Number: 3 (DW_TAG_typedef)
    <88b>   DW_AT_name        : (indirect string, offset: 0x4354d): __uint8_t
    <88f>   DW_AT_decl_file   : 2
    <890>   DW_AT_decl_line   : 43
    <891>   DW_AT_decl_column : 24
    <892>   DW_AT_type        : <0x896>
 <1><896>: Abbrev Number: 2 (DW_TAG_base_type)
    <897>   DW_AT_byte_size   : 1
    <898>   DW_AT_encoding    : 8	(unsigned char)
    <899>   DW_AT_name        : (indirect string, offset: 0xdfda1): unsigned char
 <1><89d>: Abbrev Number: 2 (DW_TAG_base_type)
    <89e>   DW_AT_byte_size   : 2
    <89f>   DW_AT_encoding    : 5	(signed)
    <8a0>   DW_AT_name        : (indirect string, offset: 0xac250): short int
 <1><8a4>: Abbrev Number: 2 (DW_TAG_base_type)
    <8a5>   DW_AT_byte_size   : 2
    <8a6>   DW_AT_encoding    : 7	(unsigned)
    <8a7>   DW_AT_name        : (indirect string, offset: 0xde34b): short unsigned int
 <1><8ab>: Abbrev Number: 2 (DW_TAG_base_type)
    <8ac>   DW_AT_byte_size   : 4
    <8ad>   DW_AT_encoding    : 5	(signed)
    <8ae>   DW_AT_name        : (indirect string, offset: 0x135b8): long int
 <1><8b2>: Abbrev Number: 3 (DW_TAG_typedef)
    <8b3>   DW_AT_name        : (indirect string, offset: 0xe8b47): __uint32_t
    <8b7>   DW_AT_decl_file   : 2
    <8b8>   DW_AT_decl_line   : 79
    <8b9>   DW_AT_decl_column : 25
    <8ba>   DW_AT_type        : <0x8be>
 <1><8be>: Abbrev Number: 2 (DW_TAG_base_type)
    <8bf>   DW_AT_byte_size   : 4
    <8c0>   DW_AT_encoding    : 7	(unsigned)
    <8c1>   DW_AT_name        : (indirect string, offset: 0x58285): long unsigned int
 <1><8c5>: Abbrev Number: 2 (DW_TAG_base_type)
    <8c6>   DW_AT_byte_size   : 8
    <8c7>   DW_AT_encoding    : 5	(signed)
    <8c8>   DW_AT_name        : (indirect string, offset: 0x69985): long long int
 <1><8cc>: Abbrev Number: 2 (DW_TAG_base_type)
    <8cd>   DW_AT_byte_size   : 8
    <8ce>   DW_AT_encoding    : 7	(unsigned)
    <8cf>   DW_AT_name        : (indirect string, offset: 0x3004c): long long unsigned int
 <1><8d3>: Abbrev Number: 8 (DW_TAG_base_type)
    <8d4>   DW_AT_byte_size   : 4
    <8d5>   DW_AT_encoding    : 5	(signed)
    <8d6>   DW_AT_name        : int
 <1><8da>: Abbrev Number: 2 (DW_TAG_base_type)
    <8db>   DW_AT_byte_size   : 4
    <8dc>   DW_AT_encoding    : 7	(unsigned)
    <8dd>   DW_AT_name        : (indirect string, offset: 0x12ac1): unsigned int
 <1><8e1>: Abbrev Number: 3 (DW_TAG_typedef)
    <8e2>   DW_AT_name        : (indirect string, offset: 0x4354f): uint8_t
    <8e6>   DW_AT_decl_file   : 3
    <8e7>   DW_AT_decl_line   : 24
    <8e8>   DW_AT_decl_column : 19
    <8e9>   DW_AT_type        : <0x88a>
 <1><8ed>: Abbrev Number: 5 (DW_TAG_const_type)
    <8ee>   DW_AT_type        : <0x8e1>
 <1><8f2>: Abbrev Number: 3 (DW_TAG_typedef)
    <8f3>   DW_AT_name        : (indirect string, offset: 0xa82d1): uint32_t
    <8f7>   DW_AT_decl_file   : 3
    <8f8>   DW_AT_decl_line   : 48
    <8f9>   DW_AT_decl_column : 20
    <8fa>   DW_AT_type        : <0x8b2>
 <1><8fe>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <8ff>   DW_AT_type        : <0x8f2>
 <1><903>: Abbrev Number: 10 (DW_TAG_structure_type)
    <904>   DW_AT_byte_size   : 152
    <905>   DW_AT_decl_file   : 4
    <906>   DW_AT_decl_line   : 685
    <908>   DW_AT_decl_column : 9
    <909>   DW_AT_sibling     : <0xad5>
 <2><90d>: Abbrev Number: 6 (DW_TAG_member)
    <90e>   DW_AT_name        : CR
    <911>   DW_AT_decl_file   : 4
    <911>   DW_AT_decl_line   : 687
    <913>   DW_AT_decl_column : 17
    <913>   DW_AT_type        : <0x8fe>
    <917>   DW_AT_data_member_location: 0
 <2><918>: Abbrev Number: 1 (DW_TAG_member)
    <919>   DW_AT_name        : (indirect string, offset: 0xe8acd): ICSCR
    <91d>   DW_AT_decl_file   : 4
    <91d>   DW_AT_decl_line   : 688
    <91f>   DW_AT_decl_column : 17
    <91f>   DW_AT_type        : <0x8fe>
    <923>   DW_AT_data_member_location: 4
 <2><924>: Abbrev Number: 1 (DW_TAG_member)
    <925>   DW_AT_name        : (indirect string, offset: 0xe89f9): CFGR
    <929>   DW_AT_decl_file   : 4
    <929>   DW_AT_decl_line   : 689
    <92b>   DW_AT_decl_column : 17
    <92b>   DW_AT_type        : <0x8fe>
    <92f>   DW_AT_data_member_location: 8
 <2><930>: Abbrev Number: 1 (DW_TAG_member)
    <931>   DW_AT_name        : (indirect string, offset: 0xe8b97): PLLCFGR
    <935>   DW_AT_decl_file   : 4
    <935>   DW_AT_decl_line   : 690
    <937>   DW_AT_decl_column : 17
    <937>   DW_AT_type        : <0x8fe>
    <93b>   DW_AT_data_member_location: 12
 <2><93c>: Abbrev Number: 1 (DW_TAG_member)
    <93d>   DW_AT_name        : (indirect string, offset: 0xe89f2): PLLSAI1CFGR
    <941>   DW_AT_decl_file   : 4
    <941>   DW_AT_decl_line   : 691
    <943>   DW_AT_decl_column : 17
    <943>   DW_AT_type        : <0x8fe>
    <947>   DW_AT_data_member_location: 16
 <2><948>: Abbrev Number: 1 (DW_TAG_member)
    <949>   DW_AT_name        : (indirect string, offset: 0xe8b5d): PLLSAI2CFGR
    <94d>   DW_AT_decl_file   : 4
    <94d>   DW_AT_decl_line   : 692
    <94f>   DW_AT_decl_column : 17
    <94f>   DW_AT_type        : <0x8fe>
    <953>   DW_AT_data_member_location: 20
 <2><954>: Abbrev Number: 1 (DW_TAG_member)
    <955>   DW_AT_name        : (indirect string, offset: 0xe88cf): CIER
    <959>   DW_AT_decl_file   : 4
    <959>   DW_AT_decl_line   : 693
    <95b>   DW_AT_decl_column : 17
    <95b>   DW_AT_type        : <0x8fe>
    <95f>   DW_AT_data_member_location: 24
 <2><960>: Abbrev Number: 1 (DW_TAG_member)
    <961>   DW_AT_name        : (indirect string, offset: 0xe88ca): CIFR
    <965>   DW_AT_decl_file   : 4
    <965>   DW_AT_decl_line   : 694
    <967>   DW_AT_decl_column : 17
    <967>   DW_AT_type        : <0x8fe>
    <96b>   DW_AT_data_member_location: 28
 <2><96c>: Abbrev Number: 1 (DW_TAG_member)
    <96d>   DW_AT_name        : (indirect string, offset: 0xe88c0): CICR
    <971>   DW_AT_decl_file   : 4
    <971>   DW_AT_decl_line   : 695
    <973>   DW_AT_decl_column : 17
    <973>   DW_AT_type        : <0x8fe>
    <977>   DW_AT_data_member_location: 32
 <2><978>: Abbrev Number: 1 (DW_TAG_member)
    <979>   DW_AT_name        : (indirect string, offset: 0xe8c6d): RESERVED0
    <97d>   DW_AT_decl_file   : 4
    <97d>   DW_AT_decl_line   : 696
    <97f>   DW_AT_decl_column : 17
    <97f>   DW_AT_type        : <0x8f2>
    <983>   DW_AT_data_member_location: 36
 <2><984>: Abbrev Number: 1 (DW_TAG_member)
    <985>   DW_AT_name        : (indirect string, offset: 0xe8bbb): AHB1RSTR
    <989>   DW_AT_decl_file   : 4
    <989>   DW_AT_decl_line   : 697
    <98b>   DW_AT_decl_column : 17
    <98b>   DW_AT_type        : <0x8fe>
    <98f>   DW_AT_data_member_location: 40
 <2><990>: Abbrev Number: 1 (DW_TAG_member)
    <991>   DW_AT_name        : (indirect string, offset: 0xe8916): AHB2RSTR
    <995>   DW_AT_decl_file   : 4
    <995>   DW_AT_decl_line   : 698
    <997>   DW_AT_decl_column : 17
    <997>   DW_AT_type        : <0x8fe>
    <99b>   DW_AT_data_member_location: 44
 <2><99c>: Abbrev Number: 1 (DW_TAG_member)
    <99d>   DW_AT_name        : (indirect string, offset: 0xe89e9): AHB3RSTR
    <9a1>   DW_AT_decl_file   : 4
    <9a1>   DW_AT_decl_line   : 699
    <9a3>   DW_AT_decl_column : 17
    <9a3>   DW_AT_type        : <0x8fe>
    <9a7>   DW_AT_data_member_location: 48
 <2><9a8>: Abbrev Number: 1 (DW_TAG_member)
    <9a9>   DW_AT_name        : (indirect string, offset: 0xe8c77): RESERVED1
    <9ad>   DW_AT_decl_file   : 4
    <9ad>   DW_AT_decl_line   : 700
    <9af>   DW_AT_decl_column : 17
    <9af>   DW_AT_type        : <0x8f2>
    <9b3>   DW_AT_data_member_location: 52
 <2><9b4>: Abbrev Number: 1 (DW_TAG_member)
    <9b5>   DW_AT_name        : (indirect string, offset: 0xe895f): APB1RSTR1
    <9b9>   DW_AT_decl_file   : 4
    <9b9>   DW_AT_decl_line   : 701
    <9bb>   DW_AT_decl_column : 17
    <9bb>   DW_AT_type        : <0x8fe>
    <9bf>   DW_AT_data_member_location: 56
 <2><9c0>: Abbrev Number: 1 (DW_TAG_member)
    <9c1>   DW_AT_name        : (indirect string, offset: 0xe8969): APB1RSTR2
    <9c5>   DW_AT_decl_file   : 4
    <9c5>   DW_AT_decl_line   : 702
    <9c7>   DW_AT_decl_column : 17
    <9c7>   DW_AT_type        : <0x8fe>
    <9cb>   DW_AT_data_member_location: 60
 <2><9cc>: Abbrev Number: 1 (DW_TAG_member)
    <9cd>   DW_AT_name        : (indirect string, offset: 0xe8a3c): APB2RSTR
    <9d1>   DW_AT_decl_file   : 4
    <9d1>   DW_AT_decl_line   : 703
    <9d3>   DW_AT_decl_column : 17
    <9d3>   DW_AT_type        : <0x8fe>
    <9d7>   DW_AT_data_member_location: 64
 <2><9d8>: Abbrev Number: 1 (DW_TAG_member)
    <9d9>   DW_AT_name        : (indirect string, offset: 0xe8c81): RESERVED2
    <9dd>   DW_AT_decl_file   : 4
    <9dd>   DW_AT_decl_line   : 704
    <9df>   DW_AT_decl_column : 17
    <9df>   DW_AT_type        : <0x8f2>
    <9e3>   DW_AT_data_member_location: 68
 <2><9e4>: Abbrev Number: 1 (DW_TAG_member)
    <9e5>   DW_AT_name        : (indirect string, offset: 0xe8909): AHB1ENR
    <9e9>   DW_AT_decl_file   : 4
    <9e9>   DW_AT_decl_line   : 705
    <9eb>   DW_AT_decl_column : 17
    <9eb>   DW_AT_type        : <0x8fe>
    <9ef>   DW_AT_data_member_location: 72
 <2><9f0>: Abbrev Number: 1 (DW_TAG_member)
    <9f1>   DW_AT_name        : (indirect string, offset: 0xe899e): AHB2ENR
    <9f5>   DW_AT_decl_file   : 4
    <9f5>   DW_AT_decl_line   : 706
    <9f7>   DW_AT_decl_column : 17
    <9f7>   DW_AT_type        : <0x8fe>
    <9fb>   DW_AT_data_member_location: 76
 <2><9fc>: Abbrev Number: 1 (DW_TAG_member)
    <9fd>   DW_AT_name        : (indirect string, offset: 0xe8a5c): AHB3ENR
    <a01>   DW_AT_decl_file   : 4
    <a01>   DW_AT_decl_line   : 707
    <a03>   DW_AT_decl_column : 17
    <a03>   DW_AT_type        : <0x8fe>
    <a07>   DW_AT_data_member_location: 80
 <2><a08>: Abbrev Number: 1 (DW_TAG_member)
    <a09>   DW_AT_name        : (indirect string, offset: 0xe8c8b): RESERVED3
    <a0d>   DW_AT_decl_file   : 4
    <a0d>   DW_AT_decl_line   : 708
    <a0f>   DW_AT_decl_column : 17
    <a0f>   DW_AT_type        : <0x8f2>
    <a13>   DW_AT_data_member_location: 84
 <2><a14>: Abbrev Number: 1 (DW_TAG_member)
    <a15>   DW_AT_name        : (indirect string, offset: 0xe88d4): APB1ENR1
    <a19>   DW_AT_decl_file   : 4
    <a19>   DW_AT_decl_line   : 709
    <a1b>   DW_AT_decl_column : 17
    <a1b>   DW_AT_type        : <0x8fe>
    <a1f>   DW_AT_data_member_location: 88
 <2><a20>: Abbrev Number: 1 (DW_TAG_member)
    <a21>   DW_AT_name        : (indirect string, offset: 0xe88dd): APB1ENR2
    <a25>   DW_AT_decl_file   : 4
    <a25>   DW_AT_decl_line   : 710
    <a27>   DW_AT_decl_column : 17
    <a27>   DW_AT_type        : <0x8fe>
    <a2b>   DW_AT_data_member_location: 92
 <2><a2c>: Abbrev Number: 1 (DW_TAG_member)
    <a2d>   DW_AT_name        : (indirect string, offset: 0xe891f): APB2ENR
    <a31>   DW_AT_decl_file   : 4
    <a31>   DW_AT_decl_line   : 711
    <a33>   DW_AT_decl_column : 17
    <a33>   DW_AT_type        : <0x8fe>
    <a37>   DW_AT_data_member_location: 96
 <2><a38>: Abbrev Number: 1 (DW_TAG_member)
    <a39>   DW_AT_name        : (indirect string, offset: 0xe8af2): RESERVED4
    <a3d>   DW_AT_decl_file   : 4
    <a3d>   DW_AT_decl_line   : 712
    <a3f>   DW_AT_decl_column : 17
    <a3f>   DW_AT_type        : <0x8f2>
    <a43>   DW_AT_data_member_location: 100
 <2><a44>: Abbrev Number: 1 (DW_TAG_member)
    <a45>   DW_AT_name        : (indirect string, offset: 0xe8a73): AHB1SMENR
    <a49>   DW_AT_decl_file   : 4
    <a49>   DW_AT_decl_line   : 713
    <a4b>   DW_AT_decl_column : 17
    <a4b>   DW_AT_type        : <0x8fe>
    <a4f>   DW_AT_data_member_location: 104
 <2><a50>: Abbrev Number: 1 (DW_TAG_member)
    <a51>   DW_AT_name        : (indirect string, offset: 0xe8c4b): AHB2SMENR
    <a55>   DW_AT_decl_file   : 4
    <a55>   DW_AT_decl_line   : 714
    <a57>   DW_AT_decl_column : 17
    <a57>   DW_AT_type        : <0x8fe>
    <a5b>   DW_AT_data_member_location: 108
 <2><a5c>: Abbrev Number: 1 (DW_TAG_member)
    <a5d>   DW_AT_name        : (indirect string, offset: 0xe8a17): AHB3SMENR
    <a61>   DW_AT_decl_file   : 4
    <a61>   DW_AT_decl_line   : 715
    <a63>   DW_AT_decl_column : 17
    <a63>   DW_AT_type        : <0x8fe>
    <a67>   DW_AT_data_member_location: 112
 <2><a68>: Abbrev Number: 1 (DW_TAG_member)
    <a69>   DW_AT_name        : (indirect string, offset: 0xe8c95): RESERVED5
    <a6d>   DW_AT_decl_file   : 4
    <a6d>   DW_AT_decl_line   : 716
    <a6f>   DW_AT_decl_column : 17
    <a6f>   DW_AT_type        : <0x8f2>
    <a73>   DW_AT_data_member_location: 116
 <2><a74>: Abbrev Number: 1 (DW_TAG_member)
    <a75>   DW_AT_name        : (indirect string, offset: 0xe88e6): APB1SMENR1
    <a79>   DW_AT_decl_file   : 4
    <a79>   DW_AT_decl_line   : 717
    <a7b>   DW_AT_decl_column : 17
    <a7b>   DW_AT_type        : <0x8fe>
    <a7f>   DW_AT_data_member_location: 120
 <2><a80>: Abbrev Number: 1 (DW_TAG_member)
    <a81>   DW_AT_name        : (indirect string, offset: 0xe88f1): APB1SMENR2
    <a85>   DW_AT_decl_file   : 4
    <a85>   DW_AT_decl_line   : 718
    <a87>   DW_AT_decl_column : 17
    <a87>   DW_AT_type        : <0x8fe>
    <a8b>   DW_AT_data_member_location: 124
 <2><a8c>: Abbrev Number: 1 (DW_TAG_member)
    <a8d>   DW_AT_name        : (indirect string, offset: 0xe8baa): APB2SMENR
    <a91>   DW_AT_decl_file   : 4
    <a91>   DW_AT_decl_line   : 719
    <a93>   DW_AT_decl_column : 17
    <a93>   DW_AT_type        : <0x8fe>
    <a97>   DW_AT_data_member_location: 128
 <2><a98>: Abbrev Number: 1 (DW_TAG_member)
    <a99>   DW_AT_name        : (indirect string, offset: 0xe8afc): RESERVED6
    <a9d>   DW_AT_decl_file   : 4
    <a9d>   DW_AT_decl_line   : 720
    <a9f>   DW_AT_decl_column : 17
    <a9f>   DW_AT_type        : <0x8f2>
    <aa3>   DW_AT_data_member_location: 132
 <2><aa4>: Abbrev Number: 1 (DW_TAG_member)
    <aa5>   DW_AT_name        : (indirect string, offset: 0xe89c6): CCIPR
    <aa9>   DW_AT_decl_file   : 4
    <aa9>   DW_AT_decl_line   : 721
    <aab>   DW_AT_decl_column : 17
    <aab>   DW_AT_type        : <0x8fe>
    <aaf>   DW_AT_data_member_location: 136
 <2><ab0>: Abbrev Number: 1 (DW_TAG_member)
    <ab1>   DW_AT_name        : (indirect string, offset: 0xe8c9f): RESERVED7
    <ab5>   DW_AT_decl_file   : 4
    <ab5>   DW_AT_decl_line   : 722
    <ab7>   DW_AT_decl_column : 17
    <ab7>   DW_AT_type        : <0x8f2>
    <abb>   DW_AT_data_member_location: 140
 <2><abc>: Abbrev Number: 1 (DW_TAG_member)
    <abd>   DW_AT_name        : (indirect string, offset: 0xe8999): BDCR
    <ac1>   DW_AT_decl_file   : 4
    <ac1>   DW_AT_decl_line   : 723
    <ac3>   DW_AT_decl_column : 17
    <ac3>   DW_AT_type        : <0x8fe>
    <ac7>   DW_AT_data_member_location: 144
 <2><ac8>: Abbrev Number: 6 (DW_TAG_member)
    <ac9>   DW_AT_name        : CSR
    <acd>   DW_AT_decl_file   : 4
    <acd>   DW_AT_decl_line   : 724
    <acf>   DW_AT_decl_column : 17
    <acf>   DW_AT_type        : <0x8fe>
    <ad3>   DW_AT_data_member_location: 148
 <2><ad4>: Abbrev Number: 0
 <1><ad5>: Abbrev Number: 11 (DW_TAG_typedef)
    <ad6>   DW_AT_name        : (indirect string, offset: 0xe8a88): RCC_TypeDef
    <ada>   DW_AT_decl_file   : 4
    <adb>   DW_AT_decl_line   : 725
    <add>   DW_AT_decl_column : 3
    <ade>   DW_AT_type        : <0x903>
 <1><ae2>: Abbrev Number: 2 (DW_TAG_base_type)
    <ae3>   DW_AT_byte_size   : 8
    <ae4>   DW_AT_encoding    : 4	(float)
    <ae5>   DW_AT_name        : (indirect string, offset: 0xee3ed): long double
 <1><ae9>: Abbrev Number: 12 (DW_TAG_array_type)
    <aea>   DW_AT_type        : <0x8ed>
    <aee>   DW_AT_sibling     : <0xaf9>
 <2><af2>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <af3>   DW_AT_type        : <0x8da>
    <af7>   DW_AT_upper_bound : 6
 <2><af8>: Abbrev Number: 0
 <1><af9>: Abbrev Number: 5 (DW_TAG_const_type)
    <afa>   DW_AT_type        : <0xae9>
 <1><afe>: Abbrev Number: 4 (DW_TAG_variable)
    <aff>   DW_AT_name        : (indirect string, offset: 0x2d6ad): CHANNEL_OFFSET_TAB
    <b03>   DW_AT_decl_file   : 5
    <b04>   DW_AT_decl_line   : 49
    <b05>   DW_AT_decl_column : 22
    <b06>   DW_AT_type        : <0xaf9>
    <b0a>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><b10>: Abbrev Number: 14 (DW_TAG_subprogram)
    <b11>   DW_AT_external    : 1
    <b11>   DW_AT_name        : (indirect string, offset: 0xe8cd9): HAL_MspInit
    <b15>   DW_AT_decl_file   : 1
    <b16>   DW_AT_decl_line   : 64
    <b17>   DW_AT_decl_column : 6
    <b18>   DW_AT_prototyped  : 1
    <b18>   DW_AT_low_pc      : 0x80007ac
    <b1c>   DW_AT_high_pc     : 0x48
    <b20>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b22>   DW_AT_call_all_calls: 1
 <2><b22>: Abbrev Number: 15 (DW_TAG_lexical_block)
    <b23>   DW_AT_low_pc      : 0x80007b2
    <b27>   DW_AT_high_pc     : 0x18
    <b2b>   DW_AT_sibling     : <0xb3f>
 <3><b2f>: Abbrev Number: 4 (DW_TAG_variable)
    <b30>   DW_AT_name        : (indirect string, offset: 0xe8ce5): tmpreg
    <b34>   DW_AT_decl_file   : 1
    <b35>   DW_AT_decl_line   : 71
    <b36>   DW_AT_decl_column : 3
    <b37>   DW_AT_type        : <0x8fe>
    <b3b>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><b3e>: Abbrev Number: 0
 <2><b3f>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <b40>   DW_AT_low_pc      : 0x80007ca
    <b44>   DW_AT_high_pc     : 0x18
 <3><b48>: Abbrev Number: 4 (DW_TAG_variable)
    <b49>   DW_AT_name        : (indirect string, offset: 0xe8ce5): tmpreg
    <b4d>   DW_AT_decl_file   : 1
    <b4e>   DW_AT_decl_line   : 72
    <b4f>   DW_AT_decl_column : 3
    <b50>   DW_AT_type        : <0x8fe>
    <b54>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><b57>: Abbrev Number: 0
 <2><b58>: Abbrev Number: 0
 <1><b59>: Abbrev Number: 0
  Compilation Unit @ offset 0xb5a:
   Length:        0x118 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x3ed
   Pointer Size:  4
 <0><b66>: Abbrev Number: 5 (DW_TAG_compile_unit)
    <b67>   DW_AT_producer    : (indirect string, offset: 0x3c767): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <b6b>   DW_AT_language    : 29	(C11)
    <b6c>   DW_AT_name        : (indirect string, offset: 0xe8d3c): ../Core/Src/stm32l4xx_it.c
    <b70>   DW_AT_comp_dir    : (indirect string, offset: 0x7fb10): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <b74>   DW_AT_ranges      : 0x72
    <b78>   DW_AT_low_pc      : 0
    <b7c>   DW_AT_stmt_list   : 0x17ce
    <b80>   DW_AT_macros      : 0x25239
 <1><b84>: Abbrev Number: 1 (DW_TAG_base_type)
    <b85>   DW_AT_byte_size   : 1
    <b86>   DW_AT_encoding    : 6	(signed char)
    <b87>   DW_AT_name        : (indirect string, offset: 0x751ec): signed char
 <1><b8b>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8c>   DW_AT_name        : (indirect string, offset: 0x4354d): __uint8_t
    <b90>   DW_AT_decl_file   : 2
    <b91>   DW_AT_decl_line   : 43
    <b92>   DW_AT_decl_column : 24
    <b93>   DW_AT_type        : <0xb97>
 <1><b97>: Abbrev Number: 1 (DW_TAG_base_type)
    <b98>   DW_AT_byte_size   : 1
    <b99>   DW_AT_encoding    : 8	(unsigned char)
    <b9a>   DW_AT_name        : (indirect string, offset: 0xdfda1): unsigned char
 <1><b9e>: Abbrev Number: 1 (DW_TAG_base_type)
    <b9f>   DW_AT_byte_size   : 2
    <ba0>   DW_AT_encoding    : 5	(signed)
    <ba1>   DW_AT_name        : (indirect string, offset: 0xac250): short int
 <1><ba5>: Abbrev Number: 1 (DW_TAG_base_type)
    <ba6>   DW_AT_byte_size   : 2
    <ba7>   DW_AT_encoding    : 7	(unsigned)
    <ba8>   DW_AT_name        : (indirect string, offset: 0xde34b): short unsigned int
 <1><bac>: Abbrev Number: 1 (DW_TAG_base_type)
    <bad>   DW_AT_byte_size   : 4
    <bae>   DW_AT_encoding    : 5	(signed)
    <baf>   DW_AT_name        : (indirect string, offset: 0x135b8): long int
 <1><bb3>: Abbrev Number: 1 (DW_TAG_base_type)
    <bb4>   DW_AT_byte_size   : 4
    <bb5>   DW_AT_encoding    : 7	(unsigned)
    <bb6>   DW_AT_name        : (indirect string, offset: 0x58285): long unsigned int
 <1><bba>: Abbrev Number: 1 (DW_TAG_base_type)
    <bbb>   DW_AT_byte_size   : 8
    <bbc>   DW_AT_encoding    : 5	(signed)
    <bbd>   DW_AT_name        : (indirect string, offset: 0x69985): long long int
 <1><bc1>: Abbrev Number: 1 (DW_TAG_base_type)
    <bc2>   DW_AT_byte_size   : 8
    <bc3>   DW_AT_encoding    : 7	(unsigned)
    <bc4>   DW_AT_name        : (indirect string, offset: 0x3004c): long long unsigned int
 <1><bc8>: Abbrev Number: 6 (DW_TAG_base_type)
    <bc9>   DW_AT_byte_size   : 4
    <bca>   DW_AT_encoding    : 5	(signed)
    <bcb>   DW_AT_name        : int
 <1><bcf>: Abbrev Number: 1 (DW_TAG_base_type)
    <bd0>   DW_AT_byte_size   : 4
    <bd1>   DW_AT_encoding    : 7	(unsigned)
    <bd2>   DW_AT_name        : (indirect string, offset: 0x12ac1): unsigned int
 <1><bd6>: Abbrev Number: 3 (DW_TAG_typedef)
    <bd7>   DW_AT_name        : (indirect string, offset: 0x4354f): uint8_t
    <bdb>   DW_AT_decl_file   : 3
    <bdc>   DW_AT_decl_line   : 24
    <bdd>   DW_AT_decl_column : 19
    <bde>   DW_AT_type        : <0xb8b>
 <1><be2>: Abbrev Number: 4 (DW_TAG_const_type)
    <be3>   DW_AT_type        : <0xbd6>
 <1><be7>: Abbrev Number: 1 (DW_TAG_base_type)
    <be8>   DW_AT_byte_size   : 8
    <be9>   DW_AT_encoding    : 4	(float)
    <bea>   DW_AT_name        : (indirect string, offset: 0xee3ed): long double
 <1><bee>: Abbrev Number: 7 (DW_TAG_array_type)
    <bef>   DW_AT_type        : <0xbe2>
    <bf3>   DW_AT_sibling     : <0xbfe>
 <2><bf7>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <bf8>   DW_AT_type        : <0xbcf>
    <bfc>   DW_AT_upper_bound : 6
 <2><bfd>: Abbrev Number: 0
 <1><bfe>: Abbrev Number: 4 (DW_TAG_const_type)
    <bff>   DW_AT_type        : <0xbee>
 <1><c03>: Abbrev Number: 9 (DW_TAG_variable)
    <c04>   DW_AT_name        : (indirect string, offset: 0x2d6ad): CHANNEL_OFFSET_TAB
    <c08>   DW_AT_decl_file   : 4
    <c09>   DW_AT_decl_line   : 49
    <c0a>   DW_AT_decl_column : 22
    <c0b>   DW_AT_type        : <0xbfe>
    <c0f>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><c15>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c16>   DW_AT_external    : 1
    <c16>   DW_AT_name        : (indirect string, offset: 0xe8d2b): DebugMon_Handler
    <c1a>   DW_AT_decl_file   : 1
    <c1a>   DW_AT_decl_line   : 159
    <c1b>   DW_AT_decl_column : 6
    <c1b>   DW_AT_prototyped  : 1
    <c1b>   DW_AT_low_pc      : 0x800081c
    <c1f>   DW_AT_high_pc     : 0xe
    <c23>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c25>   DW_AT_call_all_calls: 1
 <1><c25>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c26>   DW_AT_external    : 1
    <c26>   DW_AT_name        : (indirect string, offset: 0xe8d18): UsageFault_Handler
    <c2a>   DW_AT_decl_file   : 1
    <c2a>   DW_AT_decl_line   : 129
    <c2b>   DW_AT_decl_column : 6
    <c2b>   DW_AT_prototyped  : 1
    <c2b>   DW_AT_low_pc      : 0x8000814
    <c2f>   DW_AT_high_pc     : 0x8
    <c33>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c35>   DW_AT_call_all_calls: 1
 <1><c35>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c36>   DW_AT_external    : 1
    <c36>   DW_AT_name        : (indirect string, offset: 0xe8d69): BusFault_Handler
    <c3a>   DW_AT_decl_file   : 1
    <c3a>   DW_AT_decl_line   : 114
    <c3b>   DW_AT_decl_column : 6
    <c3b>   DW_AT_prototyped  : 1
    <c3b>   DW_AT_low_pc      : 0x800080c
    <c3f>   DW_AT_high_pc     : 0x8
    <c43>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c45>   DW_AT_call_all_calls: 1
 <1><c45>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c46>   DW_AT_external    : 1
    <c46>   DW_AT_name        : (indirect string, offset: 0xe8d8c): MemManage_Handler
    <c4a>   DW_AT_decl_file   : 1
    <c4a>   DW_AT_decl_line   : 99
    <c4b>   DW_AT_decl_column : 6
    <c4b>   DW_AT_prototyped  : 1
    <c4b>   DW_AT_low_pc      : 0x8000804
    <c4f>   DW_AT_high_pc     : 0x8
    <c53>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c55>   DW_AT_call_all_calls: 1
 <1><c55>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c56>   DW_AT_external    : 1
    <c56>   DW_AT_name        : (indirect string, offset: 0xe8d57): HardFault_Handler
    <c5a>   DW_AT_decl_file   : 1
    <c5a>   DW_AT_decl_line   : 84
    <c5b>   DW_AT_decl_column : 6
    <c5b>   DW_AT_prototyped  : 1
    <c5b>   DW_AT_low_pc      : 0x80007fc
    <c5f>   DW_AT_high_pc     : 0x8
    <c63>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c65>   DW_AT_call_all_calls: 1
 <1><c65>: Abbrev Number: 2 (DW_TAG_subprogram)
    <c66>   DW_AT_external    : 1
    <c66>   DW_AT_name        : (indirect string, offset: 0xe8d0c): NMI_Handler
    <c6a>   DW_AT_decl_file   : 1
    <c6a>   DW_AT_decl_line   : 69
    <c6b>   DW_AT_decl_column : 6
    <c6b>   DW_AT_prototyped  : 1
    <c6b>   DW_AT_low_pc      : 0x80007f4
    <c6f>   DW_AT_high_pc     : 0x8
    <c73>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c75>   DW_AT_call_all_calls: 1
 <1><c75>: Abbrev Number: 0
  Compilation Unit @ offset 0xc76:
   Length:        0x5de (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x46d
   Pointer Size:  4
 <0><c82>: Abbrev Number: 14 (DW_TAG_compile_unit)
    <c83>   DW_AT_producer    : (indirect string, offset: 0x3c767): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <c87>   DW_AT_language    : 29	(C11)
    <c88>   DW_AT_name        : (indirect string, offset: 0xe8d9e): ../Core/Src/system_stm32l4xx.c
    <c8c>   DW_AT_comp_dir    : (indirect string, offset: 0x7fb10): C:/Users/Jonat/MIRAERTS/MCUs/IMUTransceiverSTM32L476RG/Debug
    <c90>   DW_AT_ranges      : 0xa3
    <c94>   DW_AT_low_pc      : 0
    <c98>   DW_AT_stmt_list   : 0x1f54
    <c9c>   DW_AT_macros      : 0x253f4
 <1><ca0>: Abbrev Number: 2 (DW_TAG_base_type)
    <ca1>   DW_AT_byte_size   : 1
    <ca2>   DW_AT_encoding    : 6	(signed char)
    <ca3>   DW_AT_name        : (indirect string, offset: 0x751ec): signed char
 <1><ca7>: Abbrev Number: 9 (DW_TAG_typedef)
    <ca8>   DW_AT_name        : (indirect string, offset: 0x4354d): __uint8_t
    <cac>   DW_AT_decl_file   : 2
    <cad>   DW_AT_decl_line   : 43
    <cae>   DW_AT_decl_column : 24
    <caf>   DW_AT_type        : <0xcb3>
 <1><cb3>: Abbrev Number: 2 (DW_TAG_base_type)
    <cb4>   DW_AT_byte_size   : 1
    <cb5>   DW_AT_encoding    : 8	(unsigned char)
    <cb6>   DW_AT_name        : (indirect string, offset: 0xdfda1): unsigned char
 <1><cba>: Abbrev Number: 2 (DW_TAG_base_type)
    <cbb>   DW_AT_byte_size   : 2
    <cbc>   DW_AT_encoding    : 5	(signed)
    <cbd>   DW_AT_name        : (indirect string, offset: 0xac250): short int
 <1><cc1>: Abbrev Number: 2 (DW_TAG_base_type)
    <cc2>   DW_AT_byte_size   : 2
    <cc3>   DW_AT_encoding    : 7	(unsigned)
    <cc4>   DW_AT_name        : (indirect string, offset: 0xde34b): short unsigned int
 <1><cc8>: Abbrev Number: 2 (DW_TAG_base_type)
    <cc9>   DW_AT_byte_size   : 4
    <cca>   DW_AT_encoding    : 5	(signed)
    <ccb>   DW_AT_name        : (indirect string, offset: 0x135b8): long int
 <1><ccf>: Abbrev Number: 9 (DW_TAG_typedef)
    <cd0>   DW_AT_name        : (indirect string, offset: 0xe8b47): __uint32_t
    <cd4>   DW_AT_decl_file   : 2
    <cd5>   DW_AT_decl_line   : 79
    <cd6>   DW_AT_decl_column : 25
    <cd7>   DW_AT_type        : <0xcdb>
 <1><cdb>: Abbrev Number: 2 (DW_TAG_base_type)
    <cdc>   DW_AT_byte_size   : 4
    <cdd>   DW_AT_encoding    : 7	(unsigned)
    <cde>   DW_AT_name        : (indirect string, offset: 0x58285): long unsigned int
 <1><ce2>: Abbrev Number: 2 (DW_TAG_base_type)
    <ce3>   DW_AT_byte_size   : 8
    <ce4>   DW_AT_encoding    : 5	(signed)
    <ce5>   DW_AT_name        : (indirect string, offset: 0x69985): long long int
 <1><ce9>: Abbrev Number: 2 (DW_TAG_base_type)
    <cea>   DW_AT_byte_size   : 8
    <ceb>   DW_AT_encoding    : 7	(unsigned)
    <cec>   DW_AT_name        : (indirect string, offset: 0x3004c): long long unsigned int
 <1><cf0>: Abbrev Number: 15 (DW_TAG_base_type)
    <cf1>   DW_AT_byte_size   : 4
    <cf2>   DW_AT_encoding    : 5	(signed)
    <cf3>   DW_AT_name        : int
 <1><cf7>: Abbrev Number: 2 (DW_TAG_base_type)
    <cf8>   DW_AT_byte_size   : 4
    <cf9>   DW_AT_encoding    : 7	(unsigned)
    <cfa>   DW_AT_name        : (indirect string, offset: 0x12ac1): unsigned int
 <1><cfe>: Abbrev Number: 9 (DW_TAG_typedef)
    <cff>   DW_AT_name        : (indirect string, offset: 0x4354f): uint8_t
    <d03>   DW_AT_decl_file   : 3
    <d04>   DW_AT_decl_line   : 24
    <d05>   DW_AT_decl_column : 19
    <d06>   DW_AT_type        : <0xca7>
 <1><d0a>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <d0b>   DW_AT_type        : <0xcfe>
 <1><d0f>: Abbrev Number: 3 (DW_TAG_const_type)
    <d10>   DW_AT_type        : <0xcfe>
 <1><d14>: Abbrev Number: 9 (DW_TAG_typedef)
    <d15>   DW_AT_name        : (indirect string, offset: 0xa82d1): uint32_t
    <d19>   DW_AT_decl_file   : 3
    <d1a>   DW_AT_decl_line   : 48
    <d1b>   DW_AT_decl_column : 20
    <d1c>   DW_AT_type        : <0xccf>
 <1><d20>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <d21>   DW_AT_type        : <0xd14>
 <1><d25>: Abbrev Number: 3 (DW_TAG_const_type)
    <d26>   DW_AT_type        : <0xd20>
 <1><d2a>: Abbrev Number: 3 (DW_TAG_const_type)
    <d2b>   DW_AT_type        : <0xd14>
 <1><d2f>: Abbrev Number: 12 (DW_TAG_structure_type)
    <d30>   DW_AT_byte_size   : 140
    <d31>   DW_AT_decl_file   : 4
    <d32>   DW_AT_decl_line   : 440
    <d34>   DW_AT_decl_column : 9
    <d34>   DW_AT_sibling     : <0xe5f>
 <2><d38>: Abbrev Number: 1 (DW_TAG_member)
    <d39>   DW_AT_name        : (indirect string, offset: 0xe8dd6): CPUID
    <d3d>   DW_AT_decl_file   : 4
    <d3e>   DW_AT_decl_line   : 442
    <d40>   DW_AT_decl_column : 18
    <d41>   DW_AT_type        : <0xd25>
    <d45>   DW_AT_data_member_location: 0
 <2><d46>: Abbrev Number: 1 (DW_TAG_member)
    <d47>   DW_AT_name        : (indirect string, offset: 0xe8dd1): ICSR
    <d4b>   DW_AT_decl_file   : 4
    <d4c>   DW_AT_decl_line   : 443
    <d4e>   DW_AT_decl_column : 18
    <d4f>   DW_AT_type        : <0xd20>
    <d53>   DW_AT_data_member_location: 4
 <2><d54>: Abbrev Number: 1 (DW_TAG_member)
    <d55>   DW_AT_name        : (indirect string, offset: 0xe8dbd): VTOR
    <d59>   DW_AT_decl_file   : 4
    <d5a>   DW_AT_decl_line   : 444
    <d5c>   DW_AT_decl_column : 18
    <d5d>   DW_AT_type        : <0xd20>
    <d61>   DW_AT_data_member_location: 8
 <2><d62>: Abbrev Number: 1 (DW_TAG_member)
    <d63>   DW_AT_name        : (indirect string, offset: 0xe8e8a): AIRCR
    <d67>   DW_AT_decl_file   : 4
    <d68>   DW_AT_decl_line   : 445
    <d6a>   DW_AT_decl_column : 18
    <d6b>   DW_AT_type        : <0xd20>
    <d6f>   DW_AT_data_member_location: 12
 <2><d70>: Abbrev Number: 6 (DW_TAG_member)
    <d71>   DW_AT_name        : SCR
    <d75>   DW_AT_decl_file   : 4
    <d76>   DW_AT_decl_line   : 446
    <d78>   DW_AT_decl_column : 18
    <d79>   DW_AT_type        : <0xd20>
    <d7d>   DW_AT_data_member_location: 16
 <2><d7e>: Abbrev Number: 6 (DW_TAG_member)
    <d7f>   DW_AT_name        : CCR
    <d83>   DW_AT_decl_file   : 4
    <d84>   DW_AT_decl_line   : 447
    <d86>   DW_AT_decl_column : 18
    <d87>   DW_AT_type        : <0xd20>
    <d8b>   DW_AT_data_member_location: 20
 <2><d8c>: Abbrev Number: 6 (DW_TAG_member)
    <d8d>   DW_AT_name        : SHP
    <d91>   DW_AT_decl_file   : 4
    <d92>   DW_AT_decl_line   : 448
    <d94>   DW_AT_decl_column : 18
    <d95>   DW_AT_type        : <0xe6f>
    <d99>   DW_AT_data_member_location: 24
 <2><d9a>: Abbrev Number: 1 (DW_TAG_member)
    <d9b>   DW_AT_name        : (indirect string, offset: 0xe8e04): SHCSR
    <d9f>   DW_AT_decl_file   : 4
    <da0>   DW_AT_decl_line   : 449
    <da2>   DW_AT_decl_column : 18
    <da3>   DW_AT_type        : <0xd20>
    <da7>   DW_AT_data_member_location: 36
 <2><da8>: Abbrev Number: 1 (DW_TAG_member)
    <da9>   DW_AT_name        : (indirect string, offset: 0xe8e2b): CFSR
    <dad>   DW_AT_decl_file   : 4
    <dae>   DW_AT_decl_line   : 450
    <db0>   DW_AT_decl_column : 18
    <db1>   DW_AT_type        : <0xd20>
    <db5>   DW_AT_data_member_location: 40
 <2><db6>: Abbrev Number: 1 (DW_TAG_member)
    <db7>   DW_AT_name        : (indirect string, offset: 0xe8e0a): HFSR
    <dbb>   DW_AT_decl_file   : 4
    <dbc>   DW_AT_decl_line   : 451
    <dbe>   DW_AT_decl_column : 18
    <dbf>   DW_AT_type        : <0xd20>
    <dc3>   DW_AT_data_member_location: 44
 <2><dc4>: Abbrev Number: 1 (DW_TAG_member)
    <dc5>   DW_AT_name        : (indirect string, offset: 0xe8e77): DFSR
    <dc9>   DW_AT_decl_file   : 4
    <dca>   DW_AT_decl_line   : 452
    <dcc>   DW_AT_decl_column : 18
    <dcd>   DW_AT_type        : <0xd20>
    <dd1>   DW_AT_data_member_location: 48
 <2><dd2>: Abbrev Number: 1 (DW_TAG_member)
    <dd3>   DW_AT_name        : (indirect string, offset: 0xe8df9): MMFAR
    <dd7>   DW_AT_decl_file   : 4
    <dd8>   DW_AT_decl_line   : 453
    <dda>   DW_AT_decl_column : 18
    <ddb>   DW_AT_type        : <0xd20>
    <ddf>   DW_AT_data_member_location: 52
 <2><de0>: Abbrev Number: 1 (DW_TAG_member)
    <de1>   DW_AT_name        : (indirect string, offset: 0xe8df4): BFAR
    <de5>   DW_AT_decl_file   : 4
    <de6>   DW_AT_decl_line   : 454
    <de8>   DW_AT_decl_column : 18
    <de9>   DW_AT_type        : <0xd20>
    <ded>   DW_AT_data_member_location: 56
 <2><dee>: Abbrev Number: 1 (DW_TAG_member)
    <def>   DW_AT_name        : (indirect string, offset: 0xe8dcc): AFSR
    <df3>   DW_AT_decl_file   : 4
    <df4>   DW_AT_decl_line   : 455
    <df6>   DW_AT_decl_column : 18
    <df7>   DW_AT_type        : <0xd20>
    <dfb>   DW_AT_data_member_location: 60
 <2><dfc>: Abbrev Number: 6 (DW_TAG_member)
    <dfd>   DW_AT_name        : PFR
    <e01>   DW_AT_decl_file   : 4
    <e02>   DW_AT_decl_line   : 456
    <e04>   DW_AT_decl_column : 18
    <e05>   DW_AT_type        : <0xe89>
    <e09>   DW_AT_data_member_location: 64
 <2><e0a>: Abbrev Number: 6 (DW_TAG_member)
    <e0b>   DW_AT_name        : DFR
    <e0f>   DW_AT_decl_file   : 4
    <e10>   DW_AT_decl_line   : 457
    <e12>   DW_AT_decl_column : 18
    <e13>   DW_AT_type        : <0xd25>
    <e17>   DW_AT_data_member_location: 72
 <2><e18>: Abbrev Number: 6 (DW_TAG_member)
    <e19>   DW_AT_name        : ADR
    <e1d>   DW_AT_decl_file   : 4
    <e1e>   DW_AT_decl_line   : 458
    <e20>   DW_AT_decl_column : 18
    <e21>   DW_AT_type        : <0xd25>
    <e25>   DW_AT_data_member_location: 76
 <2><e26>: Abbrev Number: 1 (DW_TAG_member)
    <e27>   DW_AT_name        : (indirect string, offset: 0xe8def): MMFR
    <e2b>   DW_AT_decl_file   : 4
    <e2c>   DW_AT_decl_line   : 459
    <e2e>   DW_AT_decl_column : 18
    <e2f>   DW_AT_type        : <0xea3>
    <e33>   DW_AT_data_member_location: 80
 <2><e34>: Abbrev Number: 1 (DW_TAG_member)
    <e35>   DW_AT_name        : (indirect string, offset: 0xe8dff): ISAR
    <e39>   DW_AT_decl_file   : 4
    <e3a>   DW_AT_decl_line   : 460
    <e3c>   DW_AT_decl_column : 18
    <e3d>   DW_AT_type        : <0xebd>
    <e41>   DW_AT_data_member_location: 96
 <2><e42>: Abbrev Number: 1 (DW_TAG_member)
    <e43>   DW_AT_name        : (indirect string, offset: 0xe8c6d): RESERVED0
    <e47>   DW_AT_decl_file   : 4
    <e48>   DW_AT_decl_line   : 461
    <e4a>   DW_AT_decl_column : 18
    <e4b>   DW_AT_type        : <0xec2>
    <e4f>   DW_AT_data_member_location: 116
 <2><e50>: Abbrev Number: 1 (DW_TAG_member)
    <e51>   DW_AT_name        : (indirect string, offset: 0xe8e25): CPACR
    <e55>   DW_AT_decl_file   : 4
    <e56>   DW_AT_decl_line   : 462
    <e58>   DW_AT_decl_column : 18
    <e59>   DW_AT_type        : <0xd20>
    <e5d>   DW_AT_data_member_location: 136
 <2><e5e>: Abbrev Number: 0
 <1><e5f>: Abbrev Number: 4 (DW_TAG_array_type)
    <e60>   DW_AT_type        : <0xd0a>
    <e64>   DW_AT_sibling     : <0xe6f>
 <2><e68>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <e69>   DW_AT_type        : <0xcf7>
    <e6d>   DW_AT_upper_bound : 11
 <2><e6e>: Abbrev Number: 0
 <1><e6f>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <e70>   DW_AT_type        : <0xe5f>
 <1><e74>: Abbrev Number: 4 (DW_TAG_array_type)
    <e75>   DW_AT_type        : <0xd25>
    <e79>   DW_AT_sibling     : <0xe84>
 <2><e7d>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <e7e>   DW_AT_type        : <0xcf7>
    <e82>   DW_AT_upper_bound : 1
 <2><e83>: Abbrev Number: 0
 <1><e84>: Abbrev Number: 3 (DW_TAG_const_type)
    <e85>   DW_AT_type        : <0xe74>
 <1><e89>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <e8a>   DW_AT_type        : <0xe84>
 <1><e8e>: Abbrev Number: 4 (DW_TAG_array_type)
    <e8f>   DW_AT_type        : <0xd25>
    <e93>   DW_AT_sibling     : <0xe9e>
 <2><e97>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <e98>   DW_AT_type        : <0xcf7>
    <e9c>   DW_AT_upper_bound : 3
 <2><e9d>: Abbrev Number: 0
 <1><e9e>: Abbrev Number: 3 (DW_TAG_const_type)
    <e9f>   DW_AT_type        : <0xe8e>
 <1><ea3>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <ea4>   DW_AT_type        : <0xe9e>
 <1><ea8>: Abbrev Number: 4 (DW_TAG_array_type)
    <ea9>   DW_AT_type        : <0xd25>
    <ead>   DW_AT_sibling     : <0xeb8>
 <2><eb1>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <eb2>   DW_AT_type        : <0xcf7>
    <eb6>   DW_AT_upper_bound : 4
 <2><eb7>: Abbrev Number: 0
 <1><eb8>: Abbrev Number: 3 (DW_TAG_const_type)
    <eb9>   DW_AT_type        : <0xea8>
 <1><ebd>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <ebe>   DW_AT_type        : <0xeb8>
 <1><ec2>: Abbrev Number: 4 (DW_TAG_array_type)
    <ec3>   DW_AT_type        : <0xd14>
    <ec7>   DW_AT_sibling     : <0xed2>
 <2><ecb>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <ecc>   DW_AT_type        : <0xcf7>
    <ed0>   DW_AT_upper_bound : 4
 <2><ed1>: Abbrev Number: 0
 <1><ed2>: Abbrev Number: 13 (DW_TAG_typedef)
    <ed3>   DW_AT_name        : (indirect string, offset: 0xe8e45): SCB_Type
    <ed7>   DW_AT_decl_file   : 4
    <ed8>   DW_AT_decl_line   : 463
    <eda>   DW_AT_decl_column : 3
    <eda>   DW_AT_type        : <0xd2f>
 <1><ede>: Abbrev Number: 10 (DW_TAG_variable)
    <edf>   DW_AT_name        : (indirect string, offset: 0xe8e4e): SystemCoreClock
    <ee3>   DW_AT_decl_file   : 5
    <ee3>   DW_AT_decl_line   : 57
    <ee4>   DW_AT_decl_column : 17
    <ee5>   DW_AT_type        : <0xd14>
    <ee9>   DW_AT_external    : 1
    <ee9>   DW_AT_declaration : 1
 <1><ee9>: Abbrev Number: 4 (DW_TAG_array_type)
    <eea>   DW_AT_type        : <0xd0f>
    <eee>   DW_AT_sibling     : <0xef9>
 <2><ef2>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <ef3>   DW_AT_type        : <0xcf7>
    <ef7>   DW_AT_upper_bound : 15
 <2><ef8>: Abbrev Number: 0
 <1><ef9>: Abbrev Number: 3 (DW_TAG_const_type)
    <efa>   DW_AT_type        : <0xee9>
 <1><efe>: Abbrev Number: 10 (DW_TAG_variable)
    <eff>   DW_AT_name        : (indirect string, offset: 0xe8e7c): AHBPrescTable
    <f03>   DW_AT_decl_file   : 5
    <f03>   DW_AT_decl_line   : 59
    <f04>   DW_AT_decl_column : 23
    <f05>   DW_AT_type        : <0xef9>
    <f09>   DW_AT_external    : 1
    <f09>   DW_AT_declaration : 1
 <1><f09>: Abbrev Number: 4 (DW_TAG_array_type)
    <f0a>   DW_AT_type        : <0xd0f>
    <f0e>   DW_AT_sibling     : <0xf19>
 <2><f12>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <f13>   DW_AT_type        : <0xcf7>
    <f17>   DW_AT_upper_bound : 7
 <2><f18>: Abbrev Number: 0
 <1><f19>: Abbrev Number: 3 (DW_TAG_const_type)
    <f1a>   DW_AT_type        : <0xf09>
 <1><f1e>: Abbrev Number: 10 (DW_TAG_variable)
    <f1f>   DW_AT_name        : (indirect string, offset: 0xe8e30): APBPrescTable
    <f23>   DW_AT_decl_file   : 5
    <f23>   DW_AT_decl_line   : 60
    <f24>   DW_AT_decl_column : 23
    <f25>   DW_AT_type        : <0xf19>
    <f29>   DW_AT_external    : 1
    <f29>   DW_AT_declaration : 1
 <1><f29>: Abbrev Number: 4 (DW_TAG_array_type)
    <f2a>   DW_AT_type        : <0xd2a>
    <f2e>   DW_AT_sibling     : <0xf39>
 <2><f32>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <f33>   DW_AT_type        : <0xcf7>
    <f37>   DW_AT_upper_bound : 11
 <2><f38>: Abbrev Number: 0
 <1><f39>: Abbrev Number: 3 (DW_TAG_const_type)
    <f3a>   DW_AT_type        : <0xf29>
 <1><f3e>: Abbrev Number: 10 (DW_TAG_variable)
    <f3f>   DW_AT_name        : (indirect string, offset: 0xe8e69): MSIRangeTable
    <f43>   DW_AT_decl_file   : 5
    <f43>   DW_AT_decl_line   : 61
    <f44>   DW_AT_decl_column : 23
    <f45>   DW_AT_type        : <0xf39>
    <f49>   DW_AT_external    : 1
    <f49>   DW_AT_declaration : 1
 <1><f49>: Abbrev Number: 12 (DW_TAG_structure_type)
    <f4a>   DW_AT_byte_size   : 152
    <f4b>   DW_AT_decl_file   : 6
    <f4c>   DW_AT_decl_line   : 685
    <f4e>   DW_AT_decl_column : 9
    <f4e>   DW_AT_sibling     : <0x1166>
 <2><f52>: Abbrev Number: 6 (DW_TAG_member)
    <f53>   DW_AT_name        : CR
    <f56>   DW_AT_decl_file   : 6
    <f57>   DW_AT_decl_line   : 687
    <f59>   DW_AT_decl_column : 17
    <f5a>   DW_AT_type        : <0xd20>
    <f5e>   DW_AT_data_member_location: 0
 <2><f5f>: Abbrev Number: 1 (DW_TAG_member)
    <f60>   DW_AT_name        : (indirect string, offset: 0xe8acd): ICSCR
    <f64>   DW_AT_decl_file   : 6
    <f65>   DW_AT_decl_line   : 688
    <f67>   DW_AT_decl_column : 17
    <f68>   DW_AT_type        : <0xd20>
    <f6c>   DW_AT_data_member_location: 4
 <2><f6d>: Abbrev Number: 1 (DW_TAG_member)
    <f6e>   DW_AT_name        : (indirect string, offset: 0xe89f9): CFGR
    <f72>   DW_AT_decl_file   : 6
    <f73>   DW_AT_decl_line   : 689
    <f75>   DW_AT_decl_column : 17
    <f76>   DW_AT_type        : <0xd20>
    <f7a>   DW_AT_data_member_location: 8
 <2><f7b>: Abbrev Number: 1 (DW_TAG_member)
    <f7c>   DW_AT_name        : (indirect string, offset: 0xe8b97): PLLCFGR
    <f80>   DW_AT_decl_file   : 6
    <f81>   DW_AT_decl_line   : 690
    <f83>   DW_AT_decl_column : 17
    <f84>   DW_AT_type        : <0xd20>
    <f88>   DW_AT_data_member_location: 12
 <2><f89>: Abbrev Number: 1 (DW_TAG_member)
    <f8a>   DW_AT_name        : (indirect string, offset: 0xe89f2): PLLSAI1CFGR
    <f8e>   DW_AT_decl_file   : 6
    <f8f>   DW_AT_decl_line   : 691
    <f91>   DW_AT_decl_column : 17
    <f92>   DW_AT_type        : <0xd20>
    <f96>   DW_AT_data_member_location: 16
 <2><f97>: Abbrev Number: 1 (DW_TAG_member)
    <f98>   DW_AT_name        : (indirect string, offset: 0xe8b5d): PLLSAI2CFGR
    <f9c>   DW_AT_decl_file   : 6
    <f9d>   DW_AT_decl_line   : 692
    <f9f>   DW_AT_decl_column : 17
    <fa0>   DW_AT_type        : <0xd20>
    <fa4>   DW_AT_data_member_location: 20
 <2><fa5>: Abbrev Number: 1 (DW_TAG_member)
    <fa6>   DW_AT_name        : (indirect string, offset: 0xe88cf): CIER
    <faa>   DW_AT_decl_file   : 6
    <fab>   DW_AT_decl_line   : 693
    <fad>   DW_AT_decl_column : 17
    <fae>   DW_AT_type        : <0xd20>
    <fb2>   DW_AT_data_member_location: 24
 <2><fb3>: Abbrev Number: 1 (DW_TAG_member)
    <fb4>   DW_AT_name        : (indirect string, offset: 0xe88ca): CIFR
    <fb8>   DW_AT_decl_file   : 6
    <fb9>   DW_AT_decl_line   : 694
    <fbb>   DW_AT_decl_column : 17
    <fbc>   DW_AT_type        : <0xd20>
    <fc0>   DW_AT_data_member_location: 28
 <2><fc1>: Abbrev Number: 1 (DW_TAG_member)
    <fc2>   DW_AT_name        : (indirect string, offset: 0xe88c0): CICR
    <fc6>   DW_AT_decl_file   : 6
    <fc7>   DW_AT_decl_line   : 695
    <fc9>   DW_AT_decl_column : 17
    <fca>   DW_AT_type        : <0xd20>
    <fce>   DW_AT_data_member_location: 32
 <2><fcf>: Abbrev Number: 1 (DW_TAG_member)
    <fd0>   DW_AT_name        : (indirect string, offset: 0xe8c6d): RESERVED0
    <fd4>   DW_AT_decl_file   : 6
    <fd5>   DW_AT_decl_line   : 696
    <fd7>   DW_AT_decl_column : 17
    <fd8>   DW_AT_type        : <0xd14>
    <fdc>   DW_AT_data_member_location: 36
 <2><fdd>: Abbrev Number: 1 (DW_TAG_member)
    <fde>   DW_AT_name        : (indirect string, offset: 0xe8bbb): AHB1RSTR
    <fe2>   DW_AT_decl_file   : 6
    <fe3>   DW_AT_decl_line   : 697
    <fe5>   DW_AT_decl_column : 17
    <fe6>   DW_AT_type        : <0xd20>
    <fea>   DW_AT_data_member_location: 40
 <2><feb>: Abbrev Number: 1 (DW_TAG_member)
    <fec>   DW_AT_name        : (indirect string, offset: 0xe8916): AHB2RSTR
    <ff0>   DW_AT_decl_file   : 6
    <ff1>   DW_AT_decl_line   : 698
    <ff3>   DW_AT_decl_column : 17
    <ff4>   DW_AT_type        : <0xd20>
    <ff8>   DW_AT_data_member_location: 44
 <2><ff9>: Abbrev Number: 1 (DW_TAG_member)
    <ffa>   DW_AT_name        : (indirect string, offset: 0xe89e9): AHB3RSTR
    <ffe>   DW_AT_decl_file   : 6
    <fff>   DW_AT_decl_line   : 699
    <1001>   DW_AT_decl_column : 17
    <1002>   DW_AT_type        : <0xd20>
    <1006>   DW_AT_data_member_location: 48
 <2><1007>: Abbrev Number: 1 (DW_TAG_member)
    <1008>   DW_AT_name        : (indirect string, offset: 0xe8c77): RESERVED1
    <100c>   DW_AT_decl_file   : 6
    <100d>   DW_AT_decl_line   : 700
    <100f>   DW_AT_decl_column : 17
    <1010>   DW_AT_type        : <0xd14>
    <1014>   DW_AT_data_member_location: 52
 <2><1015>: Abbrev Number: 1 (DW_TAG_member)
    <1016>   DW_AT_name        : (indirect string, offset: 0xe895f): APB1RSTR1
    <101a>   DW_AT_decl_file   : 6
    <101b>   DW_AT_decl_line   : 701
    <101d>   DW_AT_decl_column : 17
    <101e>   DW_AT_type        : <0xd20>
    <1022>   DW_AT_data_member_location: 56
 <2><1023>: Abbrev Number: 1 (DW_TAG_member)
    <1024>   DW_AT_name        : (indirect string, offset: 0xe8969): APB1RSTR2
    <1028>   DW_AT_decl_file   : 6
    <1029>   DW_AT_decl_line   : 702
    <102b>   DW_AT_decl_column : 17
    <102c>   DW_AT_type        : <0xd20>
    <1030>   DW_AT_data_member_location: 60
 <2><1031>: Abbrev Number: 1 (DW_TAG_member)
    <1032>   DW_AT_name        : (indirect string, offset: 0xe8a3c): APB2RSTR
    <1036>   DW_AT_decl_file   : 6
    <1037>   DW_AT_decl_line   : 703
    <1039>   DW_AT_decl_column : 17
    <103a>   DW_AT_type        : <0xd20>
    <103e>   DW_AT_data_member_location: 64
 <2><103f>: Abbrev Number: 1 (DW_TAG_member)
    <1040>   DW_AT_name        : (indirect string, offset: 0xe8c81): RESERVED2
    <1044>   DW_AT_decl_file   : 6
    <1045>   DW_AT_decl_line   : 704
    <1047>   DW_AT_decl_column : 17
    <1048>   DW_AT_type        : <0xd14>
    <104c>   DW_AT_data_member_location: 68
 <2><104d>: Abbrev Number: 1 (DW_TAG_member)
    <104e>   DW_AT_name        : (indirect string, offset: 0xe8909): AHB1ENR
    <1052>   DW_AT_decl_file   : 6
    <1053>   DW_AT_decl_line   : 705
    <1055>   DW_AT_decl_column : 17
    <1056>   DW_AT_type        : <0xd20>
    <105a>   DW_AT_data_member_location: 72
 <2><105b>: Abbrev Number: 1 (DW_TAG_member)
    <105c>   DW_AT_name        : (indirect string, offset: 0xe899e): AHB2ENR
    <1060>   DW_AT_decl_file   : 6
    <1061>   DW_AT_decl_line   : 706
    <1063>   DW_AT_decl_column : 17
    <1064>   DW_AT_type        : <0xd20>
    <1068>   DW_AT_data_member_location: 76
 <2><1069>: Abbrev Number: 1 (DW_TAG_member)
    <106a>   DW_AT_name        : (indirect string, offset: 0xe8a5c): AHB3ENR
    <106e>   DW_AT_decl_file   : 6
    <106f>   DW_AT_decl_line   : 707
    <1071>   DW_AT_decl_column : 17
    <1072>   DW_AT_type        : <0xd20>
    <1076>   DW_AT_data_member_location: 80
 <2><1077>: Abbrev Number: 1 (DW_TAG_member)
    <1078>   DW_AT_name        : (indirect string, offset: 0xe8c8b): RESERVED3
    <107c>   DW_AT_decl_file   : 6
    <107d>   DW_AT_decl_line   : 708
    <107f>   DW_AT_decl_column : 17
    <1080>   DW_AT_type        : <0xd14>
    <1084>   DW_AT_data_member_location: 84
 <2><1085>: Abbrev Number: 1 (DW_TAG_member)
    <1086>   DW_AT_name        : (indirect string, offset: 0xe88d4): APB1ENR1
    <108a>   DW_AT_decl_file   : 6
    <108b>   DW_AT_decl_line   : 709
    <108d>   DW_AT_decl_column : 17
    <108e>   DW_AT_type        : <0xd20>
    <1092>   DW_AT_data_member_location: 88
 <2><1093>: Abbrev Number: 1 (DW_TAG_member)
    <1094>   DW_AT_name        : (indirect string, offset: 0xe88dd): APB1ENR2
    <1098>   DW_AT_decl_file   : 6
    <1099>   DW_AT_decl_line   : 710
    <109b>   DW_AT_decl_column : 17
    <109c>   DW_AT_type        : <0xd20>
    <10a0>   DW_AT_data_member_location: 92
 <2><10a1>: Abbrev Number: 1 (DW_TAG_member)
    <10a2>   DW_AT_name        : (indirect string, offset: 0xe891f): APB2ENR
    <10a6>   DW_AT_decl_file   : 6
    <10a7>   DW_AT_decl_line   : 711
    <10a9>   DW_AT_decl_column : 17
    <10aa>   DW_AT_type        : <0xd20>
    <10ae>   DW_AT_data_member_location: 96
 <2><10af>: Abbrev Number: 1 (DW_TAG_member)
    <10b0>   DW_AT_name        : (indirect string, offset: 0xe8af2): RESERVED4
    <10b4>   DW_AT_decl_file   : 6
    <10b5>   DW_AT_decl_line   : 712
    <10b7>   DW_AT_decl_column : 17
    <10b8>   DW_AT_type        : <0xd14>
    <10bc>   DW_AT_data_member_location: 100
 <2><10bd>: Abbrev Number: 1 (DW_TAG_member)
    <10be>   DW_AT_name        : (indirect string, offset: 0xe8a73): AHB1SMENR
    <10c2>   DW_AT_decl_file   : 6
    <10c3>   DW_AT_decl_line   : 713
    <10c5>   DW_AT_decl_column : 17
    <10c6>   DW_AT_type        : <0xd20>
    <10ca>   DW_AT_data_member_location: 104
 <2><10cb>: Abbrev Number: 1 (DW_TAG_member)
    <10cc>   DW_AT_name        : (indirect string, offset: 0xe8c4b): AHB2SMENR
    <10d0>   DW_AT_decl_file   : 6
    <10d1>   DW_AT_decl_line   : 714
    <10d3>   DW_AT_decl_column : 17
    <10d4>   DW_AT_type        : <0xd20>
    <10d8>   DW_AT_data_member_location: 108
 <2><10d9>: Abbrev Number: 1 (DW_TAG_member)
    <10da>   DW_AT_name        : (indirect string, offset: 0xe8a17): AHB3SMENR
    <10de>   DW_AT_decl_file   : 6
    <10df>   DW_AT_decl_line   : 715
    <10e1>   DW_AT_decl_column : 17
    <10e2>   DW_AT_type        : <0xd20>
    <10e6>   DW_AT_data_member_location: 112
 <2><10e7>: Abbrev Number: 1 (DW_TAG_member)
    <10e8>   DW_AT_name        : (indirect string, offset: 0xe8c95): RESERVED5
    <10ec>   DW_AT_decl_file   : 6
    <10ed>   DW_AT_decl_line   : 716
    <10ef>   DW_AT_decl_column : 17
    <10f0>   DW_AT_type        : <0xd14>
    <10f4>   DW_AT_data_member_location: 116
 <2><10f5>: Abbrev Number: 1 (DW_TAG_member)
    <10f6>   DW_AT_name        : (indirect string, offset: 0xe88e6): APB1SMENR1
    <10fa>   DW_AT_decl_file   : 6
    <10fb>   DW_AT_decl_line   : 717
    <10fd>   DW_AT_decl_column : 17
    <10fe>   DW_AT_type        : <0xd20>
    <1102>   DW_AT_data_member_location: 120
 <2><1103>: Abbrev Number: 1 (DW_TAG_member)
    <1104>   DW_AT_name        : (indirect string, offset: 0xe88f1): APB1SMENR2
    <1108>   DW_AT_decl_file   : 6
    <1109>   DW_AT_decl_line   : 718
    <110b>   DW_AT_decl_column : 17
    <110c>   DW_AT_type        : <0xd20>
    <1110>   DW_AT_data_member_location: 124
 <2><1111>: Abbrev Number: 1 (DW_TAG_member)
    <1112>   DW_AT_name        : (indirect string, offset: 0xe8baa): APB2SMENR
    <1116>   DW_AT_decl_file   : 6
    <1117>   DW_AT_decl_line   : 719
    <1119>   DW_AT_decl_column : 17
    <111a>   DW_AT_type        : <0xd20>
    <111e>   DW_AT_data_member_location: 128
 <2><111f>: Abbrev Number: 1 (DW_TAG_member)
    <1120>   DW_AT_name        : (indirect string, offset: 0xe8afc): RESERVED6
    <1124>   DW_AT_decl_file   : 6
    <1125>   DW_AT_decl_line   : 720
    <1127>   DW_AT_decl_column : 17
    <1128>   DW_AT_type        : <0xd14>
    <112c>   DW_AT_data_member_location: 132
 <2><112d>: Abbrev Number: 1 (DW_TAG_member)
    <112e>   DW_AT_name        : (indirect string, offset: 0xe89c6): CCIPR
    <1132>   DW_AT_decl_file   : 6
    <1133>   DW_AT_decl_line   : 721
    <1135>   DW_AT_decl_column : 17
    <1136>   DW_AT_type        : <0xd20>
    <113a>   DW_AT_data_member_location: 136
 <2><113b>: Abbrev Number: 1 (DW_TAG_member)
    <113c>   DW_AT_name        : (indirect string, offset: 0xe8c9f): RESERVED7
    <1140>   DW_AT_decl_file   : 6
    <1141>   DW_AT_decl_line   : 722
    <1143>   DW_AT_decl_column : 17
    <1144>   DW_AT_type        : <0xd14>
    <1148>   DW_AT_data_member_location: 140
 <2><1149>: Abbrev Number: 1 (DW_TAG_member)
    <114a>   DW_AT_name        : (indirect string, offset: 0xe8999): BDCR
    <114e>   DW_AT_decl_file   : 6
    <114f>   DW_AT_decl_line   : 723
    <1151>   DW_AT_decl_column : 17
    <1152>   DW_AT_type        : <0xd20>
    <1156>   DW_AT_data_member_location: 144
 <2><1157>: Abbrev Number: 6 (DW_TAG_member)
    <1158>   DW_AT_name        : CSR
    <115c>   DW_AT_decl_file   : 6
    <115d>   DW_AT_decl_line   : 724
    <115f>   DW_AT_decl_column : 17
    <1160>   DW_AT_type        : <0xd20>
    <1164>   DW_AT_data_member_location: 148
 <2><1165>: Abbrev Number: 0
 <1><1166>: Abbrev Number: 13 (DW_TAG_typedef)
    <1167>   DW_AT_name        : (indirect string, offset: 0xe8a88): RCC_TypeDef
    <116b>   DW_AT_decl_file   : 6
    <116c>   DW_AT_decl_line   : 725
    <116e>   DW_AT_decl_column : 3
    <116e>   DW_AT_type        : <0xf49>
 <1><1172>: Abbrev Number: 2 (DW_TAG_base_type)
    <1173>   DW_AT_byte_size   : 8
    <1174>   DW_AT_encoding    : 4	(float)
    <1175>   DW_AT_name        : (indirect string, offset: 0xee3ed): long double
 <1><1179>: Abbrev Number: 4 (DW_TAG_array_type)
    <117a>   DW_AT_type        : <0xd0f>
    <117e>   DW_AT_sibling     : <0x1189>
 <2><1182>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <1183>   DW_AT_type        : <0xcf7>
    <1187>   DW_AT_upper_bound : 6
 <2><1188>: Abbrev Number: 0
